[
  "THE PROVINCIAL MOTOR VEHICLES ORDINANCE, 1965 (W.P. Ord. XIX of 1965) C O N T E N T S  SECTION   HEADING  CHAPTER I PRELIMINARY 1.   Short title and extent.  2.   Definitions.  CHAPTER II LICENSING OF DRIVERS OF MOTOR VEHICLES 3.   Prohibition on driving without licence.  4.   Age limit in connection with driving of motor vehicles.  5.   Owners of motor vehicles not to permit contravention of section 3 or section 4.  6.   Restriction on use of licence by person other than holder.  7.   Grant of licence.  8.   Form and contents of licence.  9.   Additions to licences.  10.   Extent of validity of licence.  11.   Currency of licences.  12.   Renewal of licences.  13.   Cancellation of licence on grounds of disease or disability.  14.   Order refusing licences and appeal therefrom.  15.   Licence to drive motor vehicles, the property of the Federal Government.  16.   Power of licensing authority to disqualify for holding a licence.  17.   Power of Regional Transport Authority to disqualify.  18.   Power of Court to order disqualification.  19.   Effect of disqualification order.  20.   Endorsement.  21.   Transfer of endorsement and issue of licence free from endorsement.  22.   Power to make rules. (Space for photograph) Photograph  1 [* * *] official stamp of the branch] 131. ZEBRA CROSSING]  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 1 of 85   6/2/2011 2:44 PM",
  "CHAPTER III REGISTRATION OF MOTOR VEHICLES 23.   Motor vehicles not to be driven without registration.  24.   Registration where to be made.  25.   Registration how to be made.  26.   Temporary registration.  27.   Production of vehicle at the time of registration.  28.   Refusal of registration.  29.   Effectiveness of certificate of registration.  30.   [ Omitted ].  31.   Change of residence or place of business.  32.   Transfer of ownership.  32-A.   Cancellation of certificate of registration of vehicles registered in the Tribal Areas of Baluchistan in certain cases.  33.   Alteration in motor vehicle.  34.   Suspension of registration.  35.   Cancellation of registration.  36.   Appeals.  37.   Special requirement for registration of transport vehicles.  38.   Special particulars to be recorded on registration of transport vehicles.  39.   Certificate of fitness of transport vehicles.  40.   Registration of vehicles, the property of the Federal Government.  41.   Special registration of vehicles.  42.   Application of Chapter III to trailers.  43.   Power to make rules.  CHAPTER IV CONTROL OF TRANSPORT VEHICLES  44.   Transport vehicles not to be used or driven without permit.  44-A.   Permission to drive transport vehicles registered in other Provinces.  45.   Power of Government to control road transport.  45-A.   Power of Government to regulate stage carriages.  46.   Transport authorities.  47.   General provisions as to applications for permits.  48.   Application for stage carriage permit.  49.   Procedure for grant of stage carriage permits.  50.   Conditions for grant of stage carriage permits.  51.   Application for contract carriage permit.  52.   Procedure of Regional Transport Authority in considering application for contract carriage permits.  53.   Power to restrict the number of contract carriages and impose conditions on contract carriage permits.  54.   Application for private carriers permit.  55.   Procedure of Regional Transport Authority in considering application for a private carrier's permit.  56.   Application for public carrier's permit.  57.   Procedure of Regional Transport Authority in considering application for public carrier's permit.  58.   Power to restrict the number of and attach conditions to public carrier's permits.  59.   Procedure in applying for and granting permits.  60.   Duration and renewal of permits. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 2 of 85   6/2/2011 2:44 PM",
  "61.   General conditions attaching to all permits.  62.   Cancellation and suspension of permit.  62-A.   Suspension and cancellation of permits of the specified route and forfeiture of performance guarantee.  63.   Transfer of permit on death of holder.  64.   Special permits.  65.   [ Repealed ]  66.   Appeals.  67.   Compensation for the death of, or injury to a passenger.  67-A.   Claims Tribunal.  67-B.   Application for compensation.  67-BB.   Information regarding claim for compensation.  67-C.   Award of compensation.  67-D.   Procedure and powers of Claims Tribunal.  67-E.   Appeal.  67-F.   Recovery of amount of compensation.  67-G.   Bar of jurisdiction.  68.   Power to make rules as to stage carriages and contract carriages.  69.   Power to make rules for the purposes of this Chapter.  69-A   [ Omitted ].  CHAPTER V PUNJAB ROAD TRANSPORT BOARD  70.   Punjab Road Transport Board.  71.   Transport Authorities to have no jurisdiction in respect of motor transport operated by the Board.  72.   Powers of the Road Transport Board to acquire property for motor transport operated by it.  CHAPTER V-A URBAN TRANSPORT COMPANY 72-A.   Company.  72-B.   Powers of the Company.  72-C.   Property of the Company.  72 - D.   Fixation of fares.  72-E.   Delegation of powers.  73-F.   Interpretation.  73-G.   Power to make rules.  CHAPTER VI CONSTRUCTION, EQUIPMENT AND MAINTENANCE OF MOTOR VEHICLES 73.   General provisions regarding construction and maintenance.  74.   Power to make rules.  CHAPTER VII CONTROL OF TRAFFIC 75.   Limits of speed.  76.   Limit of weight and limitation on use.  77.   Power to have vehicle weighed.  78.   Power to restrict the use of vehicles.  79.   Power to erect traffic signs.  80.   Parking places and halting stations. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 3 of 85   6/2/2011 2:44 PM",
  "81.   Main roads.  82.   Duty to obey traffic signs.  83.   Signals and signalling devices.  84.   Vehicles with left hand control.  85.   Leaving vehicle in dangerous position.  86.   Riding on running boards.  87.   Obstruction of driver.  88.   Stationary vehicles.  89.   Pillion riding.  89-A.   Rider to wear helmet.  89 -B.   Seatbelt.  90.   Duty to produce licence and certificate of registration.  91.   Railway crossing.  92.   Duty of driver to stop in certain cases.  93.   Duty of owner of motor vehicles to give information.  94.   Duty of driver in case of accident and injury to a person, animal or damage to property.  94-A.   Duty of police officer in case of accident giving rise to claim for compensation.  95.   Inspection of vehicle involved in accident.  96.   Power to make rules.  CHAPTER VIII OFFENCES, PENALTIES AND PROCEDURE 97.   Offences relating to licences.  98.   Driving at excessive speed.  99.   Driving recklessly or dangerously.  99-A.   One wheeling of motorcycle.  100.   Driving while under the influence of drink or drugs.  101.   Driving when mentally or physically unfit to drive.  101-A.   Use of mobile telephones.  102.   Punishment for abetment of certain offences.  103.   Racing and trials of speed.  104.   Using vehicle in unsafe condition.  105.   Sale of vehicle in or alteration of vehicle to a condition contravening this Ordinance.  106.   Using vehicle without permit.  107.   Driving vehicle exceeding permissible weight.  108.   Penalty for failing to stop in case of accident or failure to furnish information etc.  109.   Taking vehicle without authority.  110.   Unauthorized interference with vehicle.  111.   Disobedience of orders, obstruction and refusal of information.  111-A.   Penalty of contravention of rules relating to appliances.  112.   Penalty for other offences.  112-A.   Unauthorized use of emergency light or a distinctive sign.  113.   Power of arrest without warrant.  114.   Power of police officer to seize documents.  115.   Power to detain vehicle used without certificate of registration or permit.  116.   Summary disposal of cases.  116.A.   Ticketing system  117.   Restriction on conviction.  118.   Jurisdiction of Courts.  CHAPTER IX MISCELLANEOUS  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 4 of 85   6/2/2011 2:44 PM",
  "119.   Publication of and commencement of rules.  120.   Appointment of motor vehicles officers.  121.   General provisions regarding appeals to prescribed appellate authorities.  122.   Repeal and savings.  SCHEDULES  First Schedule   Forms  Second Schedule   Disqualification for driving licence  Third Schedule   Test of competence to drive  Fourth Schedule   Authorities entitled to grant licence  Fifth Schedule   Endorsement on licences  Sixth Schedule   [ Omitted. ]  Seventh Schedule   [ Omitted. ]  Eighth Schedule   Limits of speed for motor Vehicles  Ninth Schedule   Traffic Signs  Tenth Schedule   Driving regulations  Eleventh Schedule   Signals  Twelfth Schedule   Violations and Penalties  Thirteenth Schedule   Scale of compensation  Fourteenth Schedule   Enactments repealed.  [1]   [2] (W. P. Ordinance XIX of 1965)  [8 June 1965)  An Ordinance to amend and consolidate the law relating to Motor Vehicles in the Province of West Pakistan  Preamble.–   WHEREAS it is expedient to amend and consolidate the law relating to motor vehicles in the Province of West Pakistan; AND WHEREAS the Provincial Assembly of West Pakistan is not in session and the Governor of West Pakistan is satisfied that circumstances exist which render immediate legislation necessary; Now, THEREFORE, in exercise of the powers conferred on him by clause (1) of Article 79 of the Constitution, the Governor of West Pakistan is pleased to make and promulgate the following Ordinance:-  CHAPTER I PRELIMINARY 1.   Short title and extent.–   (1) This Ordinance may be called the   [3]  [Provincial] Motor Vehicles Ordinance, 1965. (2) It extends to the whole of   [4] [Pakistan].  2.   Definitions.–   In this Ordinance, unless the context otherwise requires, the following expressions shall have the meanings hereby respectively assigned to them, that is to say– (1) “ambulance” means a vehicle designed for the carriage of sick, wounded or invalid persons or animals; (2)   “axle weight” means in relation to an axle of a vehicle the total weight transmitted by the several wheels attached to that axle to the surface whereon the vehicle rests; The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 5 of 85   6/2/2011 2:44 PM",
  "(3)   [5] [“Board”] means the   [6] [Punjab Road Transport Board] established under section 70; (4) “certificate of registration” means the certificate issued by a competent authority to the effect that a motor vehicle has been duly registered in accordance with provisions of Chapter III; (5) “contract carriage” means a motor vehicle which carries a passenger or passengers for hire or reward under a contract expressed or implied for the use of the vehicle as a whole at or for a fixed or agreed rate or sum and from one point to another without stopping to pick up or set down along the line of route passengers not included in the contract; and includes a motor cab notwithstanding that the passengers may pay separate fares; (6) “delivery van” means any goods vehicle the registered laden weight of which does not exceed 5,000 pounds avoirdupois; (7) “driver” includes, where a separate person acts as steersman of a motor vehicle, that person as well as any other person engaged in the driving of the vehicle; (8)   “emergency vehicle” means a motor vehicle used solely for police, fire-bridge or ambulance purposes or to relieve distress; (9) “fares” includes sums payable for a season ticket or in respect of the hire of a contract carriage; (10) “goods” include live-stock, and anything (other than equipment ordinarily used with the vehicle) carried by a vehicle except living persons, but does not include luggage or personal effects carried in a motor car or in a trailer attached to a motor car or the personal luggage of passengers travelling in the vehicle; (11)   “goods vehicle” means any motor vehicle constructed or adapted for use for the carriage of goods, or any motor vehicle not so constructed or adapted when used for the carriage of goods, solely or in addition to passengers; (12) “Government” means the   [7] [Provincial Government]; (13) “heavy transport vehicle” means a transport vehicle the registered axle weight of which exceeds 10,600 pounds avoirdupois, or the registered laden weight of which exceed 14,500 pounds avoirdupois; (14) “intersection “ shall include the area bounded by the side lines, real or projected, of two or more public highways which meet or cross each other; (15)   “invalid carriage” means a motor vehicle the unladen weight of which does not exceed five hundred weights, specially designed and constructed, and not merely adapted, for the use of a person suffering from some physical defect or disability, and used solely by or for such a person; (16) “licence” means the document issued by competent authority authorising the person specified therein to drive a motor vehicle or a motor vehicle of any specified class or description; (17) “licensing authority” means an authority empowered to grant licences under this Ordinance; (18) “light transport vehicle” means any public service vehicle other than a motor cab, or any goods vehicle other than a heavy transport vehicle or a delivery van; (19) “locomotive” means a motor vehicle which is itself not constructed to carry any load (other than equipment used for the purpose of propulsion), the unladen weight of which exceeds 16,000 pounds avoirdupois, but does not include a road-roller; (20) “motor cab” means any motor vehicle constructed, adapted or used to carry not more than ten passengers excluding the driver, for hire or reward; (21)   “motor car” means any motor vehicle other than a transport vehicle, locomotive, road-roller, tractor, motor cycle or invalid carriage; (22) “motor cycle” means a motor vehicle, other than an invalid carriage, with less than four wheels, the unladen weight of which, inclusive of any sidecar attached to the vehicle, does not exceed 900 pounds avoirdupois; (23) “motor vehicle” means any mechanically propelled vehicle adapted for use upon roads whether the powers of propulsion is transmitted thereto from an external or internal source, and includes a chassis to which a body has not been attached,   [8]  [a tractor] and a trailer,   [9]  [a combined The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 6 of 85   6/2/2011 2:44 PM",
  "harvester, a rig, a fork lifter, a road roller, construction and earth moving machinery such as a wheel loader, a crane, an excavator, a grader, a dozer and a pipe layer, a road making and a road/sewerage cleaning plant,] but does not include a vehicle running, upon fixed rails or used solely upon the premises of the owner; (24) “owner” means the person in whose name the motor vehicle is registered and includes– ( a ) a transferee of the motor vehicle from such persons; ( b ) in relation to motor vehicle which is the subject of a hire-purchase agreement, the person in possession of the vehicle under that agreement; and ( c ) where the person in whose name the motor vehicle is registered or the person in possession of the motor vehicle under a hire-purchase agreement is– ( i ) a minor, the guardian of such minor; ( ii )   a company registered under the Companies Act, 1913 [10] , the directors of such company; ( iii ) a society registered under the Societies Registration Act, 1860 [11] , or under any law relating to co-operative societies, the principal officer of such society by whatever designation known; ( iv ) a firm, all the partners of such a firm; and ( v ) any other association of persons, all the members of such association: Provided that where such company, firm, society or other association of persons has given notice to the registering authority that has nominated a director, partner, office-bearer, member or officer, as the case may be, of the company, firm, society or association to be the owner of the vehicle for the purposes of this Ordinance, the person so nominated shall alone be deemed to be the owner for the purpose of this Ordinance; (25)   “permit” means the document issued by the Provincial Transport Authority or a Regional Transport Authority, authorising the use of a transport vehicle as a contract carriage or stage carriage, or authorising the owner as a private carrier or public carrier to use such vehicle; (26) “prescribed” means prescribed by rules made under this Ordinance; (27) “private carrier” means an owner of a transport vehicle other than a public carrier who uses that vehicle solely for the carriage of goods which are his property or the carriage of which is necessary for the purposes of his business, not being a business of providing transport, or who uses the vehicle for any of the purposes specified in sub-section (2) of section 44;  [12] [(27-A) “Province” means the Province of the Punjab;] (28) “public carrier” means an owner of a transport vehicle who transports or undertakes to transport goods, or any class of goods, for another person at any time and in any public place, for hire or reward, whether in pursuance of the terms of a contract or agreement or otherwise and includes any person, body, association or company engaged in the business of carrying the goods of persons associated with that person, body, association or company for the purposes of having their goods transported; (29) “public highway” shall include any highway, road, street, avenue, alley, public place, public driveway or any other public way; (30) “public place” means, a road, street way of other place, whether a thoroughfare or not to which the public have a right of access, and includes any place or stand at which passengers are picked up or set down by a stage carriage; (31) “public service vehicle” means any motor vehicles used or adapted, to be used for the carriage of passengers for hire or reward, and includes a motor cab, contract carriage, and stage carriage; (32) “registered axle weight” means in respect of any vehicle the axle weight certified and registered by the registered authority as permissible for that vehicle; (33)   “registered laden weight” means in respect of any vehicle the total weight of the vehicle and load certified and registered by the registering authority as permissible for that vehicle; The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 7 of 85   6/2/2011 2:44 PM",
  "(34) “registering authority” means an authority empowered to register motor vehicles under Chapter III; (35)   “school bus” means any motor vehicle used exclusively for the carriage of students of any educational institution recognised by Government or the managing committee of which is a society registered under the Societies Registration Act, 1860 [13] ; (36) “semi-trailer” means any vehicle which is so designed that when operated, the forward end of its body or chassis rests upon the body or chassis of the towing motor vehicle; (37)   “stage carriage” means a motor vehicle carrying or adapted to carry more than six persons excluding the driver which carries passengers for hire or reward at separate fares paid by or for individual passengers, either for the whole journey or for stages of the journey; (38) “street (roadway)” means that part of the public highway which is intended for vehicular traffic; (39)   “tractor” means a motor vehicle which is not itself constructed to carry any load (other than equipment used for the purpose of propulsion) the unladen weight of which does not exceed 16,000 pounds avoirdupois but does not include a road-roller; (40) “traffic signs” includes all signals, warning sign posts, direction posts, or other devices for the information, guidance or direction of drivers of motor vehicles; (41)   “trailer” means any vehicle other than a side-car drawn or intended to be drawn by a motor vehicle; (42)   “transport vehicle” means a public service vehicle, a goods vehicle, a locomotive or a tractor  [14] [* * *]; (43)   “unladen weight” means the weight of a vehicle or trailer, including all equipment ordinarily used within the vehicle or trailer when working, but excluding the weight of the driver or attendant; and where alternative parts or bodies are used, the unladen weight of the vehicle means the weight of the vehicle with the heaviest such alternative part of body; (44) “weight” means the total weight transmitted for the time being by the wheels of a vehicle to the surface on which the vehicle rests.  CHAPTER II LICENSING OF DRIVERS OF MOTOR VEHICLES 3.   Prohibition on driving without licence.–   [15] [(1)] No person shall drive a motor vehicle in any public place unless he holds an effective licence authorising him to drive the vehicle; and no person shall so drive a motor vehicle as paid employee or shall so drive a public service vehicle unless his licence specifically entitles him so to do: Provided that a person receiving instructions in driving a motor vehicle may, subject to such conditions as may be prescribed by Government in this behalf, drive a motor vehicle in any public place.  [16] [(2) No person shall drive a motor vehicle in any public place unless he has in his possession his own copy of the most recent version of the Pakistan Highway Code published by the Federal Government.]  4.   Age limit in connection with driving of motor vehicles.–   (1) No person shall drive in any public place– ( i ) a motor cycle or an invalid carriage, unless he has attained the age of eighteen years; ( ii ) a motor car, otherwise than as a paid employee, unless he has attained the age of eighteen years; ( iii ) a motor car as a paid employee or a transport vehicle, unless he has attained the age of twenty-one years; ( iv ) a heavy transport vehicle, unless he has attained the age of twenty-two years. (2)   ( a )   No person about the age of fifty years shall drive a transport vehicle in any public place unless the licence entitling him so to do bears an effective endorsement by the licensing authority that such person has furnished a certificate in Form B as set forth in the First Schedule signed by a registered medical practitioner. ( b ) The licensing authority shall not make on any licence any such endorsement as is referred to in clause ( a ) The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 8 of 85   6/2/2011 2:44 PM",
  "unless it appears from the medical certificate furnished by the holder of the licence that he is not suffering from any disease or disability specified in the Second Schedule or any other disease or disability which is likely to cause the driving by him of a transport vehicle to be a source of danger to the public or to the passengers. ( c )   An endorsement made under the provisions of clause ( a ) shall be effective for a period of twelve months from the date thereof, but the said period may from time to time, be extended by the licensing authority by a further period of twelve months at any one time on the production by the holder of the licence of a fresh medical certificate as required under clause ( a ) and on being satisfied therefrom that the holder of the licence is not suffering from any disease or disability referred to in clause ( b ). (3)   No person shall drive a motor vehicle in a public place with his eyes wholly or partly covered with any cloth or other opaque substance, or in such manner as to interfere in any manner with his vision.  5.   Owners of motor vehicles not to permit contravention of section 3 or section 4.–   No owner or person in charge of a motor vehicle shall cause or permit any person who does not satisfy the provisions of section 3 or section 4 to drive the vehicle.  6.   Restriction on use of licence by person other than holder.–   No holder of a licence shall permit it to be used by any other person.  7.   Grant of licence.–   (1) Any person who is not disqualified under section 4 for driving a motor vehicle and who is not for the time being disqualified for holding or obtaining a licence, may apply to the licensing authority having jurisdiction in the area in which he ordinarily resides or carries on business or, if the application is for a licence to drive as a paid employee, in which the employer resides or carries on business for the issue to him of a licence. (2) Every application under sub-section (1) shall be in Form A as set forth in the First Schedule, shall be signed by, or bear the thumb-impression of the applicant in two places, and shall contain the information required by the Form. (3)   When the application is for a licence to drive as a paid employee or to drive a transport vehicle, or where in any other case the licensing authority for reasons to be stated in writing so requires, the application shall be accompanied by a medical certificate in Form B as set forth in the First Schedule signed by a registered medical practitioner. (4) Every application for a licence to drive   [17] [a motor vehicle] shall be accompanied by three copies of a recent photograph of the applicant attested by a magistrate or   [18] [an officer of Government not inferior in rank to an officer in Grade-17 of the National Pay Scales.] (5) If, from the application or from the medical certificate referred to in sub-section (3) it appears that the applicant is suffering from any disease or disability specified in the Second Schedule or any other disease or disability which is likely to cause the driving by him of a motor vehicle of the class which he would be authorised by the licence applied for to drive to be a source of danger to the public or to the passengers, the licensing authority shall refuse to issue the licence: Provided that– ( a ) a licence limited to driving an invalid carriage may be issued to the applicant, if the licensing authority is satisfied that he is fit to drive such a carriage; ( b ) the applicant may, except where he suffers from a disease or disability specified in the Second Schedule, claim to be subjected to a test of his fitness or ability to drive a motor vehicle of a particular construction or design, and if he passes such test to the satisfaction of the licensing authority and is not otherwise disqualified, the licensing authority shall grant him a licence to drive such motor vehicle as the licensing authority may specify in the licence. (6)   No licence shall be issued to any applicant unless he passes to the satisfaction of the licensing authority the test of competence specified in the Third Schedule: Provided that where the application is for a licence to drive a motor vehicle (not being a transport vehicle) otherwise than as a paid employee, the licensing authority may exempt the applicant from the test specified in the Third Schedule, if– The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 9 of 85   6/2/2011 2:44 PM",
  "( a ) the applicant possesses a driving certificate issued by an automobile association recognised in this behalf by Government, or ( b )   the licensing authority is satisfied that the applicant has previously held a licence (or similar document) valid outside the Province and has had not less than twelve months recent experience of driving a motor vehicle of the class to which the application refers: Provided further that where the applicant, being a serving member of the armed forces of Pakistan, is in possession of a valid army driving licence and has been actually driving one or more classes of motor vehicles for not less than three years immediately before the date of application, the licensing authority shall subject to the prescribed conditions, exempt him from the test specified in the Third Schedule and issue to him a driving licence for the class or classes of motor vehicles he has been so driving. (7) The test of competence to drive shall be carried out in a vehicle of the class to which the application refers, and for the purposes of Part I of the test– ( a )   a person who passes the test in driving a heavy transport vehicle shall be deemed also to have passed the test in driving any motor vehicle other than a motor cycle or a road-roller; ( b )   a person who passes the test in driving a light transport vehicle shall be deemed also to have passed the test in driving a motor car or a motor cab or a delivery van. (8) No licence shall be issued to any applicant to drive a heavy transport vehicle unless he has held for a period of not less than three years immediately preceding the making of the application an effective licence to drive a motor vehicle other than a motor cycle, an invalid carriage or a road-roller. (9)   When an application has been duly made to the appropriate licensing authority and the applicant has satisfied such authority of his physical fitness and of his competence to drive and has paid to the authority the prescribed fee, the licensing authority shall grant the applicant a licence unless the applicant is disqualified under section 4 for driving a motor vehicle or is for the time being disqualified for holding or obtaining a licence: Provided that a licensing authority may issue a licence to drive a motor cycle or a motor car notwithstanding that it is not the appropriate licensing authority; if the licensing authority is satisfied that there is good reason for the applicant’s inability to apply to appropriate licensing authority.  [19] [(10) No licence shall be issued to any applicant unless he has in his possession his own copy of the most recent version of the Pakistan Highway Code published by the Federal Government.]  8.   Form and contents of licence.–   (1) Every licence, except a licence issued under section 15, shall be in Form C as set forth in the First Schedule and shall have affixed thereto one of the signatures or thumb- impression given on the application for the licence and   [20] [* * *] one of the photographs referred to in sub-section (4) of section 7. (2)   A licence shall specify whether the holder is entitled to drive as a paid employee and whether he is entitled to drive a public service vehicle and shall further be expressed as entitling the holder to drive a motor vehicle of one or more of the following classes, namely:- ( a ) motor cycle; ( b ) motor car; ( c ) motor cab; ( d ) delivery van; ( e ) light transport vehicle; ( f )   heavy transport vehicle; ( g ) locomotive; ( h ) tractor; ( i )   road-roller; ( j )   invalid carriage; ( k ) any other motor vehicle of a specified description.  9.   Additions to licences.–   (1) Any person holding a licence issued under this Ordinance who is not for the time being disqualified for holding or obtaining a licence may apply in Form D as set forth in the First The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 10 of 85   6/2/2011 2:44 PM",
  "Schedule to the licensing authority having jurisdiction in the area in which he ordinarily resides or caries on business or, if the application relates to a licence to drive as a paid employee, in which the employer resides or carries on business, for the addition of any class of motor vehicles to the licence as is specified in section 8. (2) The provisions of section 7 shall apply to an application under this section as if the application were for the grant of a licence under that section to drive the class of motor vehicle which the applicant desires to be added to his licence: Provided that the provisions of sub-sections (3) and (4) of that section shall not apply where the applicant is the holder of a licence to drive as a paid employee or to drive a transport vehicle. (3)   No fee other than a fee for the test of competence to drive shall be charged for an addition to a licence under this section.  10.   Extent of validity of licence.–   (1) Subject to any rules made by Government, a licence issued under the foregoing sections shall be effective throughout the Province. (2)   Subject to any rules made by Government, a licence to drive a motor vehicle issued by a competent authority in any part of Pakistan not included in the Province shall be valid throughout the Province as if it were a licence issued under this Ordinance and it shall be lawful for the holder of such a licence to drive and be employed in driving in the Province a motor vehicle of any class or description which he is authorised by such licence to drive: Provided that the holder of such a licence is not disqualified under any of the provisions of this Ordinance for holding or obtaining a licence in the Province.  11.   Currency of licences.–   A licence issued under the foregoing sections shall, subject to the provisions contained in this Ordinance, as holders of licences for holding or obtaining licences, be effective without renewal for a period upto three years in the case of a licence to drive a motor car or motor cycle otherwise than as a paid employee, and in any other case for a period of twelve months only from the date of issue of last renewal.  12.   Renewal of licences.–   (1) Any licensing authority may on an application made to it renew a licence issued under the provisions of this Ordinance   [21] [:]  [22] [Provided that no licence shall be renewed unless the holder thereof has in his possession his own copy of the most recent version of the Pakistan Highway Code published by the Federal Government.] (2) A licence to drive as a paid employee shall not be renewed so as to be effective for any period after the expiry of five years from the date of the medical certificate furnished by the licence holder under section 7 unless he furnishes a fresh medical certificate in Form B as set forth in the First Schedule and signed by a registered medical practitioner in which case the period of five years shall be computed from the date of the last of such certificates. (3) An application for the renewal of a licence shall be in Form E as set forth in the First Schedule and shall contain the declaration required by the Form; provided that if the applicant does not or is unable to subscribe to the said declaration, the provisions of sub-section (5) of section 7 shall apply. (4)   The fee payable for the renewal of a licence shall be as prescribed, and enhanced fee may be prescribed where the application for renewal is made more than thirty days from the date of expiry of the licence: Provided that if the application for renewal is made more than three years after the expiry of the licence, the licensing authority may refuse to renew the licence unless the applicant undergoes and passes to its satisfaction the test of competence specified in the Third Schedule. (5) When the authority renewing the licence is not the authority which issued the licence, it shall intimate the fact of renewal to the authority which issued the licence.  13.   Cancellation of licence on grounds of disease or disability.–   (1) Notwithstanding anything contained in section 11 or section 12, any licensing authority may at any time cancel a licence or may require the holder thereof, as a condition of continuing to hold such licence, to furnish a fresh medical certificate in Form B as The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 11 of 85   6/2/2011 2:44 PM",
  "set forth in the First Schedule and signed by a registered medical practitioner, if the licensing authority has reasonable grounds to believe that the holder of the licence is, by virtue of any disease or disability, unfit to drive a motor vehicle. (2)   When the authority cancelling the licence is not the authority which issued the licence, it shall intimate the fact of cancellation to the authority which issued the licence.  14.   Order refusing licences and appeal therefrom.–   (1) Where the licensing authority refuses to issue or cancels or refuses to renew any licence, it shall do so by an order communicated to the applicant or the holder, as the case may be, giving reasons in writing for such refusal or cancellation. (2)   Upon the issue of any such order the person affected if he is the holder of a licence, shall forthwith surrender his licence to the licensing authority making the order if the licence has not already been surrendered, and the licensing authority shall, if no appeal is preferred against its order as provided in sub-section (3) or where any such appeal has been preferred and been dismissed, destroy the licence or cause it to be destroyed. (3) Any person aggrieved by an order referred to in sub-section (1) may, within thirty days of the service on him of the order, appeal to the prescribed authority, who shall decide the appeal after giving the authority against whose order the appeal has been preferred an opportunity of being heard, and that authority shall be bound by the decision of the appellate authority.  15.   Licence to drive motor vehicles, the property of the   [23] [Federal] Government.–   (1) The authority specified in Part A of the Fourth Schedule may grant licences, valid throughout the Province, to persons who have completed their eighteenth year to drive motor vehicles which are the property or for the time being under the exclusive control of the   [24] [Federal] Government. (2)   A licence issued under this section shall specify the class or classes of vehicles which the holder is entitled to drive and the period for which he is so entitled. (3) A licence issued under this section shall not entitle the holder to drive any motor vehicle except a motor vehicle which is the property or for the time being under the exclusive control of the   [25] [Federal] Government. (4)   The authority issuing any licence under this section shall at the request of Government furnish such information respecting any person to whom a licence is issued as Government may at any time require.  16.   Power of licensing authority to disqualify for holding a licence.–   (1) If a licensing authority is satisfied after giving him an opportunity of being heard that any person– ( a ) is a habitual criminal or a habitual drunkard, or ( b ) is using or has used a motor vehicle in the commission of a cognizable offence, or ( c )   has by his previous conduct as driver of a motor vehicle shown that his driving is likely to be attended with danger to the public, it may, for reasons to be recorded in writing, make an order disqualifying that person for a specified period for holding or obtaining a licence.  [26] [(1-A)   If a licensing authority is satisfied, after giving him an opportunity of being heard, that in respect of a person an order under sub-section (2) of this section, or a declaration under sub-section (1) of section 18, has been made on more than one occasion, it may, for reasons to be recorded in writing, make an order cancelling the licence granted to that person and disqualifying him for holding or obtaining a licence for such period as it may deem fit.] (2) Upon the issue of any such order the person affected, if he is the holder of a licence, shall forthwith surrender his licence to the licensing authority making the order, if the licence has not already been surrendered, and the licensing authority shall keep it until the disqualification has expired or has been removed. (3) Any person aggrieved by an order made by a licensing authority under this section may, within thirty days of the service on him of the order, appeal to the prescribed authority, and such appellate authority shall The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 12 of 85   6/2/2011 2:44 PM",
  "give notice to the licensing authority and hear either party if so required by that party and may make such inquiry into the matter as it thinks fit. An order made by any such appellate authority shall be final.  17.   Power of Regional Transport Authority to disqualify.–   (1) A Regional Transport Authority constituted under Chapter IV may, for reasons to be recorded in writing and subject to any prescribed conditions, declare any person disqualified for a specified period, for holding or obtaining a licence to drive a transport vehicle in the Province. (2)   A Regional Transport Authority making a declaration under sub-section (1) shall, if the person so disqualified is the holder of a licence, furnish a copy of the declaration to the licensing authority by whom the licence was granted, and if the person so disqualified is not the holder of a licence, to the licensing authority within whose jurisdiction he ordinarily resides. (3)   Upon the making of a declaration under sub-section (1), the person affected, if he is the holder of a licence shall forthwith surrender his licence to the licensing authority by whom the licence was granted, and the licensing authority shall keep it until the disqualification has expired or has been removed. (4) Any person aggrieved by an order made under sub-section (1) may, within thirty days of the receipt of intimation of such order, appeal against the order to the prescribed authority.  18.   Power of Court to order disqualification.–   (1) Where a person is convicted of an offence under this Ordinance, or of an offence in the commission of which a motor vehicle was used, the Court by which such person is convicted may, subject to the provisions of this section, in addition to imposing any other punishment authorised by law, declare the person so convicted to be disqualified for such period as the Court may specify for holding any licence or for holding a licence to drive a particular class or description of vehicles: Provided that the Court shall not order the disqualification of an offender convicted for the first or second time of an offence punishable under section 98. (2)   The Court shall order the disqualification of an offender convicted of an offence punishable under section 99 or section 100 and such disqualification shall be for a period of not less than six months. (3)   The Court shall order the disqualification of an offender convicted of an offence against the provisions of clause ( c ) of sub-section (1) of section 92 or of section 94 and such disqualification shall be for a period of not less than one month. (4) The Court shall unless for special reasons to be recorded in writing, if thinks fit to order otherwise, order the disqualification of an offender– ( a ) who having been convicted of an offence punishable under section 101 is again convicted of an offence punishable under that section; ( b ) who is convicted of an offence punishable under section 103; ( c ) who is convicted of an offence punishable under section 106: Provided that the period of disqualification shall not exceed, in the cases referred to in clauses ( a ) and ( b ), two years, and, in the case referred to in clause ( c ), one year. (5) A Court ordering the disqualification of an offender convicted of an offence punishable under section 101 may also direct that the offender shall, whether he has previously passed the test of competency to drive, specified in the Third Schedule or not, remain disqualified until he has, subsequent to the making of the order of disqualification passed that test to the satisfaction of the licensing authority. (6)   The Court to which an appeal lies from any conviction of an offence of the nature specified in sub-section (1) may set aside or vary any order of disqualification made by the Court below, and the Court to which appeals ordinarily lie from any Court may set aside or vary any order of disqualification made by that Court, notwithstanding that no appeal lies against the conviction in connection with which such order was made.  19.   Effect of disqualification order.–   (1) A person in respect of whom any disqualification order is made under this Chapter shall be debarred to the extent and for the period specified in such order from holding or obtaining a licence and the licence, if any, held by such person at the date of the order shall cease to be The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 13 of 85   6/2/2011 2:44 PM",
  "effective during such period. (2) The operation of a disqualification order made under section 18 shall not be suspended or postponed while an appeal is pending against such order or against the conviction as a result of which such order is made, unless the appellate Court so directs. (3) Any person in respect of whom any disqualification order has been made may, at any time after the expiry of six months from the date of the order, apply to the Court or other authority by which the order was made, to remove the disqualification; and the Court or authority, as the case may be, may, having regard to all the circumstances of the case, remove or vary the order of disqualification: Provided that where an application has been made under this section a second application thereunder shall not be entertained before the expiry of a further period of three months.  20.   Endorsement.–   (1) The Court or authority making an order of disqualification shall endorse or cause to be   endorsed   upon   the   licence,   if   any,   held   by   the   person   disqualified,   particulars   of   the   order   of disqualification and of any conviction for an offence in respect of which an order of disqualification is made; and particulars of any removal or variation of an order of disqualification made under sub-section (3) of section 19 shall be similarly so endorsed. (2) Any person accused of an offence specified in the Fifth Schedule or any other offence involving the driving of a motor vehicle shall, when attending the Court trying him for such offence bring with him his licence if it is in his possession. (3) The Court by which any person is convicted of an offence specified in the Fifth Schedule or any other offence involving the driving of a motor vehicle shall, whether or not an order of disqualification is made in respect of such conviction, endorse or cause to be endorsed particulars of such conviction on any licence held by the persons convicted.  21.   Transfer of endorsement and issue of licence free from endorsement.–   (1) An endorsement on any licence shall be transferred to any new or duplicate licence obtained by the holder thereof until the holder becomes entitled under the provisions of this section to have a licence issued to him free from endorsement. (2) Where a licence is required to be endorsed and the licence is at the time not in the possession of the Court or authority by which the endorsement is to be made, then– ( a )   if the person in respect of whom the endorsement is to be made is at the time the holder of a licence he shall produce the licence before the Court or authority within such time as the Court or authority may fix, or ( b ) if, not being then the holder of a licence, he subsequently obtains a licence, he shall within five days after obtaining the licence, produce it before the Court or authority for the purpose of endorsement; and if the licence is not produced within the time specified, the person in respect of whom the endorsement is to be made, shall be deemed to have committed an offence punishable under section 97 and the licence shall on the expiry of such time be of no effect until it has been produced for the purpose of endorsement. (3)   A person whose licence has been endorsed shall if during the period of five years since the last endorsement was made no further order of endorsement has been made against him be entitled, on surrendering his licence and on payment of the prescribed fee, to receive a copy of the licence free from all endorsements; and if the endorsement was only in respect of exceeding a speed limit, he shall be entitled to have a copy of the licence free from endorsement issued on the expiration of one year from the date of the order directing the endorsement to be made: Provided that in computing the said period of five years and one year respectively, the time during which the said person was disqualified for holding or obtaining a licence shall be excluded. (4)   When a licence is endorsed by or an order of endorsement is made by any Court, it shall send particulars of the endorsement or order, as the case may be, to the licensing authority by which the licence was last renewed and to the licensing authority which granted the licence. (5)   Where the holder of a licence is disqualified by the order of any Court for holding or obtaining a licence, the Court shall take possession of the licence and forward it to the licensing authority by which it was granted or last renewed and that authority shall keep the licence until the disqualification has expired or has The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 14 of 85   6/2/2011 2:44 PM",
  "b een removed and the person entitled to the licence has made a demand in writing for its return to him: Provided that, if the disqualification is limited to the driving of a motor vehicle of a particular class or description, the Court shall endorse the licence to this effect and shall send a copy of the order of disqualification to the licensing authority by which the licence was granted and shall return the licence to the holder. (6) Where on an appeal against any conviction or order of a Court which has been endorsed on a licence, the appellate Court varies or sets aside the conviction or order, the appellate Court shall so inform the licensing authority by which the licence was last renewed and the licensing authority which granted the licence, and shall amend or cause to be amended the endorsement of such conviction or order.  22.   Power to make rules.–   (1) Government may make rules for the purpose of carrying into effect the provisions of this Chapter. (2) Without prejudice to the generality of the foregoing power, such rues may provide for all or any of the following matters, namely:- ( a ) the appointment, jurisdiction, control and functions of licensing authorities and other prescribed authorities; ( b ) the conduct and hearing of appeals that may be preferred under this Chapter, the fees to be paid in respect of such appeals and the refund of such fees; provided that no fee so fixed shall exceed two rupees; ( c )   the issue of duplicate licences to replace licences lost, destroyed or mutilated, the replacement of photographs which have become obsolete and the issue of temporary licences to persons receiving instruction in driving and the fees to be charged therefor; ( d )   the conditions subject to which a Regional Transport Authority may disqualify a person for holding a licence to drive a transport vehicle; ( e )   the medical examination and testing of applicants for licences and of drivers and the fees to be charged therefor; ( f )   the fees to be paid for the grant and renewal of licences; ( g ) the exemption of prescribed persons, or prescribed classes of persons from payment of all or any portion of the fees payable under this Chapter; ( h ) the granting by registered medical practitioners of the certificates referred to in sub-section (2) of section 4, sub-section (3) of section 7 and sub-section (1) of section 13; ( i )   the communication of particulars of licences granted by one licensing authority to other licensing authorities; ( j )   the control of schools or establishments for the instruction of drivers of motor vehicles and the acceptance of driving certificates issued by such schools or establishments as qualifying the holder for exemption from Part I of the test specified in the Third Schedule; and ( k ) the exemption of drivers of road-rollers from all or any of the provisions of this Chapter or of the rules made thereunder.  CHAPTER III REGISTRATION OF MOTOR VEHICLES 23.   Motor vehicles not to be driven without registration.–   (1) No person shall drive any motor vehicle and no owner of a motor vehicle shall cause or permit the vehicle to be driven in any   [27] [place] unless the vehicle is registered in accordance with this Chapter and the vehicle carries a registration mark displayed in the prescribed manner.  Explanation – A motor vehicle shall not be deemed to be registered in accordance with this Chapter if the certificate of registration has been suspended or cancelled. (2) Nothing in this section shall apply to a motor vehicle while being driven within the limits of jurisdiction of a registering authority to or from the appropriate place of registration for the purpose of being registered under section 24, 26, 40 or 41 or to a motor vehicle exempted from the provisions of this Chapter while in the possession The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 15 of 85   6/2/2011 2:44 PM",
  "of a dealer in motor vehicles.  24.   Registration where to be made.–   (1) Subject to the provisions of section 26, section 40 and section 41, every owner of a motor vehicle shall cause the vehicle to be registered by the registering authority of the  [28] [district] in which he has his residence or place of business or in which the vehicle is normally kept. (2)   Government may, by rule made under section 43 require that any certificate of registration issued under the provisions of the Motor Vehicles Act, 1939, shall be presented within a prescribed period, to a specified registering authority for entry therein of such further particulars of the vehicle as that authority may, for the purposes of this Ordinance, deem fit to record.  25.   Registration how to be made.–   (1) An application by or on behalf of the owner of a motor vehicle for registration shall be in Form F as set forth in the First Schedule, shall contain the information required by that Form, and shall be accompanied by the prescribed fee. (2)   The registering authority shall issue to the owner of a motor vehicle registered by it a certificate of registration in Form G as set forth in the First Schedule and shall enter in a record to be kept by it particulars of such certificate.  [29] [(3) The registration authority shall assign to the vehicle a distinguishing mark (in this Ordinance referred to as the registration mark) of such description as may be prescribed: Provided that any motor vehicle, whether the property of Government or not, declared by the Federal Government to be meant for the use of the President or the Prime Minister, or by a Provincial Government to be meant for the use of the Governor or the Chief Minister of the Province, shall not be assigned a registration mark, and shall instead display such other mark as may be specified by the Federal Government or the Provincial Government, as the case may be. (4)   The prescribed authority shall make available to the owner of the vehicle, on payment of the prescribed   [30] [price], a set of two plates made of such material, colour and dimensions as may be prescribed.  [31] [(5) The Government may, by a notification, direct the owners of motor vehicles registered in a district to obtain new registration marks within the period and in accordance with the procedure, as may be specified.]  [32] [(6)   The Government may, by a notification, direct the owners of motor vehicles registered in a district to obtain a set of two number plates of the prescribed description within the period and in accordance with the procedure, as may be specified.]  26.   Temporary registration.–   (1) Notwithstanding anything contained in section 24, the owner of a motor vehicle may apply in the prescribed manner to any registering authority to have the vehicle temporarily registered and thereupon such registering authority shall issue to the owner of the vehicle a temporary certificate of registration and assign to the vehicle a temporary mark of registration. (2) A registration made under this section shall be valid only for a period of one month, and shall not be renewable.  27.   Production of vehicle at the time of registration.–   The registering authority may, before proceeding to register a motor vehicle, require the person applying for registration of the vehicle to produce the vehicle either before itself or such authority as Government may, by order appoint for this purpose in order that the registering authority may satisfy itself that the particulars contained in the application are true and that the vehicle complies with the requirements of Chapter VI and the rules made thereunder.  28.   Refusal of registration.–   (1) The registering authority may, for reasons to be recorded in writing, refuse to register any motor vehicle, if– ( a ) the vehicle is mechanically so defective as to render its use unsafe; or ( b ) the vehicle does not comply with the requirements of Chapter VI, or of the rules made thereunder; The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 16 of 85   6/2/2011 2:44 PM",
  "or ( c ) the applicant fails to furnish particulars of any previous registration of the vehicle; or ( d ) the applicant fails to produce before the registering authority– ( i ) where the vehicle has been previously registered under this Ordinance or under any other law relating to the registration of motor vehicles in force in any place in Pakistan, a letter of authority or a certificate of transfer from the person shown as owner in the last registration certificate in respect of such vehicle; or ( ii )   where the vehicle has been imported from any place outside Pakistan and has not been previously registered in any place in Pakistan, an import licence for the vehicle. (2) where a registering authority refuses to register a motor vehicle, it shall furnish to the applicant free of cost a copy of the reasons for such refusal.  [33]   [29. Effectiveness of certificate of registration .– (1) Subject to the other provisions of this section, a motor vehicle registered by a competent authority in any part of Pakistan not included in the Province under the law relating to motor vehicles in force in such part, shall remain effective in the Province. (2)   The registration certificate of the vehicle registered in any part of Pakistan other than the Province shall conform to and substantially contain the same particulars as in the Form G as set forth in the First Schedule. (3) If a registration certificate is issued by an authority specified in sub-section (1) and it complies with the requirements of sub-section (2), the certificate shall be effective throughout the Province as if it is a certificate of registration issued under this Ordinance and the provisions of this Ordinance shall apply to such certificate. (4) Nothing in this section shall apply to a motor vehicle previously registered in the Province if the certificate of registration of the vehicle is, for the time being, suspended or cancelled for any reason other than permanent removal of the vehicle from the Province.]  [34] [ 30.   * * *]  31.   Change of residence or place of business.–   (1) If the owner of a motor vehicle ceases to have his place of business at the address recorded in the certificate of registration of the vehicle, he shall, within thirty days of such change of address, intimate his new address to the registering authority by which the certificate of registration was issued, or, if the new address is within the jurisdiction of another registering authority, to that other registering authority, and shall at the same time forward the certificate of registration to the registering authority in order that the new address may be entered therein. (2)   A registering authority other than the original registering authority making any such entry shall communicate the altered address to the original registering authority. (3)   Nothing in sub-section (1) shall apply where the change of the address recorded in the certificate of registration is due to a temporary absence not intended to exceed six months in duration or where the motor vehicle is neither used nor removed from the address recorded in the certificate of registration.  32.   Transfer of ownership.–   (1) Within thirty days of the transfer of ownership of any motor vehicle registered under this Chapter, the transferee shall report the transfer to the registering authority within whose jurisdiction he ordinarily resides and shall forward the certificate of registration of the vehicle to that registering authority together with the prescribed fee in order that particulars of the transfer of ownership may be entered therein. (2)   A registering authority other than the original registering authority making any such entry shall communicate the transfer of ownership to the original registering authority.  [35] [32-A. Cancellation of certificate of registration of vehicles registered in the Tribal Areas of Baluchistan in certain cases.–   If the owner of a motor vehicle registered by a registering authority having jurisdiction in the Tribal Areas of the Province of Baluchistan ceases to reside or to have his place of business in those areas, or sells or otherwise transfers the motor vehicle to any person who does not reside or have his place of business in those areas, the certificate of registration and registration mark of the vehicle shall stand The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 17 of 85   6/2/2011 2:44 PM",
  "cancelled as from the day on which he ceases to reside or to have his place of business in those areas or, as the case may be, sells or otherwise transfers the vehicle to such person.  33.   Alteration in motor vehicle.–   (1) If a motor vehicle is so altered that the particulars contained in the certificate of registration are no longer accurate, the owner of the vehicle shall within fourteen days of the making of any such alteration, report the alteration, to the registering authority within whose jurisdiction he resides and shall forward the certificate of registration of the vehicle to that authority together with the prescribed fee in order that particulars of the alteration may be entered therein: Provided that it shall not be necessary to report any change in the unladen weight of the motor vehicle consequent on the addition or removal of fittings or accessories, if such change does not exceed two per cent of the weight entered in the certificate of registration. (2)   A registering authority other than the original registering authority making any such entry shall communicate the details of the entry to the original registering authority.  34.   Suspension of registration.–   (1) A registering authority or any other prescribed authority may, after giving the owner an opportunity of making any representation he may wish to make, for reason to be recorded in writing, suspend the registration certificate of a motor vehicle, if– ( a ) the vehicle is not insured as required by law; or ( b ) any fees or taxes payable in respect of the vehicle under this Ordinance or the rules framed thereunder, or the West Pakistan [36]   Motor Vehicles Taxation Act, 1958 [37] , have remained unpaid for a period exceeding three months from the date such fees or taxes were due; or ( c ) in the case of a public service vehicle, it is not covered by a valid certificate of fitness; or ( d ) the authority has reason to believe that the vehicle is in such a condition that its use in a public place would constitute a danger to the public, or that it fails to comply with the requirements of Chapter VI or of the rules made thereunder; or ( e ) a substantially false statement has been made in the application for registration of the vehicle; or ( f )   the registration certificate has been deliberately defaced or mutilated or unauthorised additions or alterations have been made therein; and such suspension shall remain in force till the vehicle is duly insured as required by law, or the fees or taxes have been paid, or a valid certificate of fitness in respect of the vehicle has been obtained, or the defects are remedied to the satisfaction of such authority, or the false statement in the application for registration has been replaced by a correct statement in the prescribed manner, as the case may be. (2) A registering authority or any prescribed authority may, after giving the owner an opportunity of making any representation he may wish to make and for reasons to be recorded in writing, suspend for a period not exceeding six months, the certificate of registration of a vehicle, if it is satisfied that– ( i ) the vehicle is used for subversive activities against the State; or ( ii )   the vehicle is used for hire or reward without obtaining a permit from the Provincial or a Regional Transport Authority as required under section 44; or ( iii ) the vehicle has been found by a Court to have been used by the owner of the vehicle or with his knowledge   or   connivance   in   the   commission   of   a   cognizable   offence   punishable   with imprisonment of not less than five years. (3)   An authority other than a registering authority shall when making a suspension order under sub-section (1), intimate in writing the fact of suspension and the reasons therefor to the registering authority within whose jurisdiction the vehicle is at the time of the suspension. (4) A registering authority or other prescribed authority suspending the registration certificate of a motor vehicle under this section shall communicate the fact of suspension together with the reasons therefor in writing to the owner of the vehicle, and the owner shall thereupon forthwith surrender to that authority the certificate of registration and any token or card issued to authorise the use of the vehicle in a public place. (5) Where the registration of a motor vehicle has been suspended under sub-section (1) for a continuous period of not less than one month, the registering authority, within whose jurisdiction the vehicle was when The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 18 of 85   6/2/2011 2:44 PM",
  "the registration was suspended, shall, if it is not the original registering authority, inform that authority of the suspension, and when the suspension has continued without interruption for a period of not less than six months, the registering authority within whose jurisdiction the vehicle was when the registration was suspended may, if it is the original registering authority, cancel the registration and the entry relating to the vehicle in its records, and if it is not the original registering authority, shall forward the certificate of registration and any token or card surrendered under sub-section (4) to that authority which may cancel it forthwith. (6)   The certificate of registration and any token or card surrendered under sub-section (4) shall be returned to the owner when the order suspending registration is rescinded.  35.   Cancellation of registration.–   (1) If a motor vehicle has been destroyed or has been rendered permanently incapable of use, the owner shall, as soon as may be, report the fact to the registering authority within whose jurisdiction he resides and shall forward to that authority the certificate of registration of the vehicle together with any token or card issued to authorise the use of the vehicle in a public place. (2) The registering authority shall, if it is the original registering authority, cancel the registration and the certificate of registration, or, if it is not, shall forward the report and the certificate of registration, to the original registering authority and that authority shall cancel the registration and the certificate of registration. (3)   Any registering authority may order the examination of another vehicle within its jurisdiction by such authority as Government may by order appoint and, if upon such examination and after giving the owner an opportunity to make any representation he may wish to make it is satisfied that the vehicle is in such a condition that its use in a public place would constitute a danger to the public and that it is beyond reasonable repair, may, for reasons to be recorded in writing, cancel the registration of the vehicle. (4)   If a registering authority is satisfied that a motor vehicle has been permanently removed out of the Province, it shall cancel the registration of the vehicle. (5) A registering authority or any prescribed authority cancelling the registration of a motor vehicle under this section shall communicate the fact, together with the reasons therefor, in writing to the owner of the vehicle and the owner of the vehicle shall thereupon forthwith surrender to that authority the certificate of registration of the vehicle and any token or card issued to authorise the use of the vehicle in a public place. (6)   A registering authority making an order of cancellation under this section shall, if it is the original registering authority, cancel the certificate of registration and the entry relating to the vehicle in its records, and if it is not the original registering authority, intimate in writing the fact of cancellation and the reasons therefor, and forward the certificate of registration and any token or card surrendered to it under sub-section (6) to the original registering authority, and that authority shall cancel the certificate of registration and the entry relating to the motor vehicle in its records. (7) The expression “original registering authority” in this section and in sections 31, 32, 33 and 34 means the registering authority in whose records the registration of the vehicle is recorded.  36.   Appeals.–   (1) Any owner of a motor vehicle aggrieved by an order of refusal to register a motor vehicle made under section 28 or to issue a certificate of fitness made under sub-section (1) of section 39 or by an order of suspension or cancellation of registration made under section 34 or 35 or by an order of cancellation of the fitness certificate made under sub-section (3) of section 39 may, within thirty days of the date on which he has received notice of such order, appeal against the order in the prescribed manner to the prescribed authority. (2)   The appellate authority shall give notice of the appeal to the original authority, and after giving opportunity to the original authority and the appellant to be heard either personally or by pleader in the appeal, pass such orders as is thinks fit.  37.   Special requirement for registration of transport vehicles.–   (1) A registering authority shall refuse to register any transport vehicle, other than a motor cab unless the application for registration is accompanied by a document in Form H as set forth in the First Schedule signed by the maker of the vehicle or an assembler duly authorised by the maker in this behalf stating the maximum laden weight and maximum axle weights for The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 19 of 85   6/2/2011 2:44 PM",
  "which the vehicle is and the several axles are designed. (2) Where a transport vehicle or chassis, as the case may be, has affixed to it a metal plate, bearing the stamp of the maker or assembler and identified as appertaining to the particular vehicle or chassis to which it is attached, which contains the particulars specified in sub-section (1), that plate may at the discretion of a registering authority be deemed to be the document referred to in that sub-section.  38.   Special particulars to be recorded on registration of transport vehicles.–   A registering authority, when registering a transport vehicle other than a motor cab, shall enter in the record of registration and shall also enter in the certificate of registration of the vehicle the following particulars, namely:- ( a ) the unladen weight of the vehicle; ( b ) the number, nature and size of the tyres attached to each wheel; ( c ) the laden weight of the vehicle and the axle weights pertaining to the several axles thereof, determined in accordance with the Tyre and Rim Manufactures Association load ratings for tyres as revised from time to time and approved by the Provincial Transport Authority. ( d )   if the vehicle is used or adapted to be used for the carriage of passengers solely or in addition to goods, the number of passengers for whom accommodation is provided, and the owner of the vehicle shall have the said particulars exhibited in the prescribed manner on the vehicle.  39.   Certificate of fitness of transport vehicles.–   (1) Subject to the provision of section 40, a transport vehicle shall not be deemed to be validly registered for the purposes of section 23, unless it carries a certificate of fitness in Form I as set forth in the First Schedule, issued by the prescribed authority, to the effect that the vehicle complies for the time being with all the requirements of Chapter VI and the rules made thereunder; and where the prescribed authority refuses to issue such certificate, it shall supply the owner of the vehicle with its reasons in writing for such refusal. (2)   Subject to the provisions of sub-section (3), a certificate of fitness shall remain effective for three years unless a shorter period, not being in any case less than six months, is specified in the certificate by the  [38] [authority issuing the certificate]   [39] [:]  [40] [Provided that in case of a permit issued under section 60 (1) ( a ), a certificate of fitness shall remain effective for a period of six months and on the expiry of that period the permit shall be deemed to be suspended until a new certificate of fitness has been obtained.] (3) The   [41] [* * *] prescribed authority may, for reasons to be recorded in writing, cancel a certificate of fitness at any time, if satisfied that the vehicle to which it relates no longer complies with all the requirements of this Ordinance and the rules made thereunder; and on such cancellation, the certificate of registration of the vehicle and any permit granted in respect of the vehicle under Chapter IV shall be deemed to be suspended until a new certificate of fitness has been obtained.  40.   Registration of vehicles, the property of the   [42] [Federal] Government.–   (1) The authorities specified in Part B of the Fourth Schedule may register any motor vehicle which is the property or for the time being under the exclusive control of the   [43] [Federal] Government; and any vehicle so registered shall not, so long as it remains the property or under the exclusive control of the   [44] [Federal] Government, require to be registered otherwise under this Ordinance. (2)   A transport vehicle registered under this section shall carry a certificate of fitness in Form I as set forth in the First Schedule issued by the authority referred to in sub-section (1). (3)   An authority registering a vehicle under sub-section (1) shall assign to it a registration mark in accordance with the provisions contained in the Fourth Schedule and shall issue a certificate in respect of the vehicle that the vehicle has been registered under this section. (4)   If a vehicle registered under this section ceases to be the property or under the exclusive control of the   [45] [Federal] Government, the provision of section 24 shall thereupon apply. (5)   The authority registering a vehicle under sub-section (1) shall furnish to Government all such The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 20 of 85   6/2/2011 2:44 PM",
  "information regarding the general nature, over-all dimensions, and axle weight of the vehicle as Government may at any time require.  [46]   [41. Special registration of vehicles.–   Notwithstanding anything contained in this Chapter and the Sixth Schedule, Government may, by rules, prescribe a special procedure for the registration of any class, or type or category of motor vehicles, or motor vehicles belonging to a specified class of persons, and such rules may among other matters provide for– ( a ) the appointment of a special registration authority for such motor vehicles; and ( b ) special registration mark to be carried by such motor vehicles.]  42.   Application of Chapter III to trailers.–   (1) The registration mark assigned to a trailer shall be displayed in the prescribed manner on the side of the vehicle. (2)   No person shall drive a motor vehicle to which a trailer is or trailers are attached unless the registration mark of the motor vehicle so driven is displayed in the prescribed manner on the trailer or on the last trailer in the train, as the case may be.  43.   Power to make rules.–   (1) Government may make rules for the purpose of carrying into effect the provisions of this Chapter. (2)   Without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:- ( a ) the conduct and hearing of appeals that may be preferred under this Chapter, the fees to be paid in respect of such appeals and the refund of such fees; ( b ) the appointment, functions and jurisdiction of registering and other prescribed authorities; ( c )   the issue of certificates of registration and certificates of fitness and duplicate of such certificates to replace certificates lost, destroyed or mutilated; ( d )   the temporary registration of motor vehicles, and the issue of temporary certificates of registration and mark; ( e ) the manner in which registration marks and the particulars referred to in section 38, and other prescribed particulars shall be exhibited;  [47] [( ee ) the authorising of suitable automobile workshops to issue certificates of fitness, the licensing of such workshops, the equipment and apparatus to be maintained by such workshops, their inspection, the terms and conditions and the period for which, and the authorities by whom, the licences may be granted and renewed, and the fees to be paid for the grant and renewal of the licences;] ( f ) the fees to be charged for the issue or alteration of certificates of registration, for certificates of fitness, for registration marks, and for the examination or inspection of motor vehicles, and the refund of such fees; ( g ) the exemption of prescribed persons or prescribed classes of persons from payment of all or any portion of the fees payable under this Chapter; ( h )   the forms, other than those set forth in the First Schedule, to be used for the purposes of this Chapter; ( i ) the communication between registering authorities of particulars of certificates of registration and by owners of vehicles registered outside the Province of particulars of such vehicles and of their registration; ( j ) the particulars to be furnished by the owner of any motor vehicle to the registering authority, upon the transfer of possession of the motor vehicle under the terms of a hiring agreement; ( k ) the extension of the validity of certificates of fitness pending consideration of applications for their renewal; ( l ) the exemption from the provisions of this Chapter and the conditions and fees for exemption, of motor vehicles in the possession of dealers; ( m )   the exemption of road-rollers, graders and other vehicles designed and used solely for the The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 21 of 85   6/2/2011 2:44 PM",
  "construction, repair and cleaning of roads from all or any of the provisions of this Chapter and the rules made thereunder, and the conditions governing such exemption; and the exemption of light goods vehicles from the provisions of section 39 and the conditions governing such exemption.  CHAPTER IV CONTROL OF TRANSPORT VEHICLES 44.   Transport vehicles not to be used or driven without permit.–   (1) No owner of a transport vehicle shall use or permit the use of, and no driver of a transport vehicle shall drive or cause or permit to be driven, the vehicle in any public place, save in accordance with the conditions of a permit authorising the use or driving of the vehicle in such place granted or countersigned by a Regional or Provincial Transport Authority: Provided that a stage carriage permit shall, subject to any conditions that may be specified in the permit, authorise the use of the vehicle as a contract carriage: Provided further that a stage carriage permit may, subject to any conditions that may be specified in the permit, authorise the use of the vehicle as a goods vehicle either when carrying passengers or not: Provided also that a public carrier’s permit shall, subject to any conditions that may be specified in the permit authorise the holder to use the vehicle for the carriage of goods for or in connection with a trade or business carried on by him. (2)   In determining, for the purposes of this Chapter, whether a transport vehicle is or is not used for the carriage of goods for hire or reward– ( a )   the delivery or collection by or on behalf of the owner of goods sold, used or let on hire or hire-purchase in the course of any trade or business carried on by him other than the trade or business of providing transport; ( b ) the delivery or collection by or on behalf of the owner of goods which have been or which are to be subjected to a process or treatment in the course of a trade or business carried on by him; or ( c ) the carriage of goods in a transport vehicle by a manufacture of or agent or dealer in such goods whilst the vehicle is being used for demonstration purposes, shall not be deemed to constitute a carrying of the goods for hire or reward; but the carriage in a transport vehicle of goods by a person not being a dealer in such goods who has acquired temporary ownership of the goods for the purpose of transporting them to another place and there relinquishing ownership shall be deemed to constitute a carrying of the goods for hire or reward. (3) Sub-section (1) shall not apply– ( a ) to any transport vehicle owned by or on behalf of the   [48]  [Federal] or any Provincial Government and used for public purposes unconnected with any commercial enterprise; ( b ) to any transport vehicle owned by a local authority or by a person acting under contract with a local authority and used solely for road cleaning, watering or conservancy purposes; ( c ) to any emergency vehicle; ( d ) to any transport vehicle used for any other public purpose prescribed in this behalf; ( e ) to any transport vehicle used solely for conveyance of corpses; ( f )   to any transport vehicle used for towing a disabled vehicle or for removing goods from a disabled vehicle to a place of safety; ( g ) to any school bus; or ( h ) to any trailer used for any purpose other than the carriage of goods for hire or reward when drawn by a motor vehicle constructed for the carriage of not more than six passengers excluding the driver. (4)   Subject to the provisions of sub-section (3), sub-section (1) shall, if Government by rules made under section 69 so prescribes, apply to any motor vehicle adapted to carry more than nine passengers excluding the driver.  [49] [44-A.   Permission to drive transport vehicles registered in other Provinces.–   A transport vehicle The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 22 of 85   6/2/2011 2:44 PM",
  "registered in any other Province may be allowed to be driven within the Province– ( a ) in case of a transport vehicle for which a permit has been issued, by general or special resolution of the Provincial Transport Authority; and ( b ) in any other case, by general or special order of the Government; subject to such terms and conditions as may be specified by the Provincial Transport Authority or the Government in the said resolution or order, as the case may be.]  45.   Power of Government to control road transport.–   (1) Government, having regard to– ( a ) the advantages offered to the public, trade and industry by the development of motor transport; and ( b ) the desirability of– ( i ) co-ordinating road and rail transport; ( ii ) preventing the deterioration of the road system; and ( iii ) preventing uneconomic competition among transport vehicles, and after having heard the representatives of the interests affected and having consulted the Provincial and Regional Transport Authorities concerned, may, for reasons to be recorded in writing, by a notification in the official Gazette– ( i ) prohibit or restrict throughout the Province or in any area or on any route within the Province, subject to such conditions as it may think desirable, the conveying of long distance goods traffic generally or of prescribed classes of goods, by private or public carriers; or ( ii )   fix maximum or minimum fares or freights for stage carriages and public carriers to be applicable throughout the Province or within any area or on any route within the Province. (2) Notwithstanding anything in sub-section (1), Government may, by notification under this sub-section, cancel generally or in relation to a specified area any permit or class of permits granted under this Chapter in respect of transport vehicles in order to enable the Corporation constituted under section 70 to use its transport vehicles on the routes thus rendered vacant: Provided that the provisions of section 22 of the West Pakistan [50]   General Clauses Act, 1956 as to previous publication shall apply to a notification under this sub-section, and for the purposes of the said section, a notification under this sub-section shall be deemed to be a rule made under an Act. (3) Government may direct the Provincial Transport Authority or a Regional Transport Authority not to grant or issue any permit (if already granted but not issued) or to restrict the grant of fresh permits to a specified number on any route or routes or part of a route on which the Corporation is already operating motor transport or intends to do so.  Explanation – For the purpose of this sub-section “route” includes any combination of routes or an elongation of a route.  [51] [45-A.   Power of Government   to regulate stage carriages.–   (1) The Government may, in order to regulate stage carriages on a route or in an area, for the purposes of– (a) reducing traffic congestion; (b) providing an efficient, adequate, reliable, dignified, safe, integrated, economical and properly coordinated road transport system; (c) providing adequate seating arrangements for women and disabled; and (d) satisfying any other requirement for proper transportation system; conduct or cause to be conducted a periodical survey in order to determine all or any of the following: (i) the need for alignment or realignment of a route or routes; (ii) the particular type or kind of motor vehicle (including nature, capacity, quality and age) which can be used as a stage carriage on the route; (iii) the number of permits for the stage carriages required to be issued for the route; (iv) the measures to control and reduce environmental pollution and traffic congestion; (v) the need for preservation and future expansion of roads and commuter demands; (vi) the time period for which any of these arrangements may be adequate; and The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 23 of 85   6/2/2011 2:44 PM",
  "(vii) any other factor necessary for the development of a proper road transport system. (2) The Government may, subject to sub-section (1), by notification in the official Gazette– (a) declare a route to be a specified route; (b) determine the technical specifications (including capacity, quality and age) of the stage carriages which shall ply on the specified route; (c) fix the number of permits required to be issued in respect of a specified route; and (d) determine qualifications and conditions for the grant of a permit for the specified route which may be based on the following: (i) competence of the applicant; (ii) viable business plan of the applicant; (iii) the minimum number of stage carriages that an applicant shall have to ply or operate on the specified route; (iv) the services that an applicant shall have to establish, operate and maintain on the specified route; (v) the requisite arrangements for the maintenance and operations of the stage carriages of an applicant; (vi) the nature, value, extent and duration of a performance guarantee which an applicant shall be required to furnish; and (vii) any other reasonable qualifications and conditions as may be prescribed in the interest of the development of the road transport system.]  46.   Transport authorities.–   (1) Government shall by notification in the official Gazette, constitute– ( i )   a Provincial Transport Authority to exercise and discharge throughout the Province the powers and functions specified in sub-section (6); and ( ii )   Regional Transport Authorities to exercise and discharge throughout such areas (in this Chapter referred to as regions) as may be specified in the notification, in respect of each Regional Transport Authority, the powers and functions conferred by or under this Chapter on such authorities: Provided that the area specified as the region of a Regional Transport Authority shall in no case be less than an entire district. (2) The Provincial Transport Authority or a Regional Transport Authority shall consist of such   [52] [persons] as Government may think fit to appoint, but no person who has any financial interests whether as proprietor, employee or otherwise in any transport undertaking, shall be appointed or continue as a member of the Provincial or a Regional Transport Authority.  Explanation – A person shall not be deemed to have any financial interest in a transport undertaking for the purposes of this section merely by reason of the fact that he is a member or an employee of the Railway Board or is a person in the service of Pakistan or serving under the Corporation. (3)   If any person who is appointed as member of the Provincial or a Regional Transport Authority has any such interest in a transport undertaking as is referred to in sub-section (2), he shall forthwith give notice of the same in writing to Government. (4) If any member of the Provincial or a Regional Transport Authority during his term of office acquires any such interest in a transport undertaking as is referred to in sub-section (2), he shall within four weeks of acquiring such interest give notice of the same in writing to Government, and shall on the giving of such notice cease to be such member. (5) If any person becomes a member or continues to remain as a member of the Provincial or a Regional Transport Authority in contravention of the provisions of this section he shall be deemed to have committed an offence against this Ordinance. (6) The Provincial Transport Authority shall exercise and discharge the following powers and functions, namely:- ( i ) to co-ordinate and regulate the activities and policies of the Regional Transport Authorities; ( ii ) to perform the duties of a Regional Transport Authority– The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 24 of 85   6/2/2011 2:44 PM",
  "( a ) where there is no such authority; or ( b ) where there is such authority, if it thinks fit so to do and if so required by that authority;  [53] [or]  [54] [(c) where the Government directs it to do so;] ( iii ) to settle all disputes and decide all matters on which differences of opinion arise between the Regional Transport Authorities; and ( iv ) to discharge such other functions as may be prescribed. (7)   The Provincial Transport Authority may, subject to such conditions as may be prescribed, issue to a Regional Transport Authority such orders and directions of a general character in respect of road transport as it may deem necessary, and the Regional Transport Authority shall give effect to all such orders and directions. (8) The Provincial Transport Authority and any Regional Transport Authority, if authorised in this behalf by rules made under section 69, may delegate such of its powers and functions to such authority, or person and subject to such restrictions, limitations and conditions as may be prescribed by the said rules.  47.   General provisions as to applications for permits.–   (1) Every application for a permit shall be made to the Regional Transport Authority of the region or of one of the regions in which it is proposed to use the vehicle or vehicles and, if the applicant resides or has his principal place of business in any one of those regions, to the Regional Transport Authority of that region. (2) Nothing in sub-section (1) shall apply to road transport services operated by the Corporation.  [55] [(3)   Notwithstanding anything contained in sub-sections (1) and (2), where a notification has been issued by the Government under section 45-A, the Provincial Transport Authority shall invite applications for the grant of permits through advertisement in the press indicating the route, specification of the stage carriages, the number of permits to be issued for that route and the qualifications and conditions determined in such notification.]  [56]   [48. Application for stage carriage permit.–   (1) An application for a permit to use a motor vehicle as a stage carriage (in this Chapter referred to as a stage carriage permit) shall contain the following particulars, namely:- ( a ) the name and address of the applicant; ( b )   the registration number, type, model and seating capacity of the vehicle in respect of which the application is made; ( c ) the route or routes on which   [57]  [* * *] it is intended to use the vehicle; and ( d ) such other matters as may be prescribed. (2) An application for a permit shall be accompanied by an affidavit of the applicant to the effect that he is the actual owner of the motor vehicle in respect of which the application is made [58][and that no Government servant has any financial interest in such motor vehicle, either directly or indirectly.]  Explanation – For the purposes of this Chapter, “actual owner” means a person or a body of persons having proprietary rights in a motor vehicle, acquired by way of purchase, gift, inheritance, or under a hire-purchase agreement, or as a result of the settlement of a lawful claim.  [59] [(3) No application for grant of permit shall be made unless the vehicle in respect of which the permit is required conforms to the age prescribed for the purpose].  [60]  [(4) An application for the grant of the permit of a specified route shall be supported by sufficient material showing that the applicant is qualified for the grant of the permit in terms of the qualifications determined by the Government under section 45-A.]  [61]   [49. Procedure for grant of stage carriage permits.   (1) Where an application for a stage carriage permit The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 25 of 85   6/2/2011 2:44 PM",
  "conforming to the provisions of this Ordinance has been received by the Provincial or the Regional Transport Authority, as the case may be, it may, on the payment of the prescribed fee, and furnishing of a bank guarantee to its satisfaction for the payment of any compensation which the applicant may be required to pay under the provision of this Ordinance, grant a permit to the applicant in the prescribed form in respect of motor vehicle specified in the application: Provided that where any such permit granted in respect of the vehicle for which the permit is applied for has been suspended or cancelled, the Provincial or Regional Transport Authority– (a)   shall not, during the period of suspension of the previous permit, grant a permit in respect of the vehicle; and (b)   may, in case of a previous permit, for reasons to be recorded in writing, a copy whereof shall be granted to the applicant free of cost, refuse to grant a permit for a period not exceeding three months whereafter the applicant may make a fresh application for the grant of a stage carriage permit in respect of the same vehicle .  (2) Condition of furnishing a bank guarantee under sub-section (1) may be dispensed with if– (a)   the applicant furnishes security, equalling the requisite bank guarantee, issued by an insurance company duly registered with the Securities and Exchange Commission of Pakistan; or (b)   the applicant furnishes a valid membership certificate issued by the West Pakistan Transporters Mutual Assistance Cooperative Society Limited.]  [62]   [50. Conditions for grant of stage carriage permits.–   [63] [(1) A Regional Transport Authority or the Provincial Transport Authority shall insert a condition in every stage carriage permit that in case of death of or injury to a passenger in the stage carriage arising out of the use of the stage carriage, the permit holder shall pay, as compensation to the passenger or the legal representatives of the passenger, the amount specified in the Thirteenth Schedule.] (2) A Regional Transport Authority may attach to a stage carriage permit any prescribed condition or any or all of the following conditions, namely:- ( i ) that the service specified in the permit shall be commenced not later than a specified date and period; ( ii ) that a specified number of return trips of daily service shall be maintained on the route or routes specified in the permit and that they may be varied only in accordance with the specified conditions; ( iii ) that the stage carriage shall be used only on specified routes   [64] [* * *]; ( iv ) that copies of the fare-table and time-table approved by the Regional Transport Authority shall be exhibited on the stage carriage and at its stands and stops on the route, and that the timetable and fare-table so exhibited shall be observed; ( v ) that not more than a specified number of passengers and not more than a specified amount of luggage shall be carried on any stage carriage at any one time; ( vi ) that within municipal limits and in such other areas and places as may be prescribed, passengers shall not be taken up or set down except at specified places; ( vii ) that the permit holder shall maintain such accounts and records of the operation of the services and shall submit such financial and statistical returns as may be required by the Regional or Provincial Transport Authority, and that the records and accounts shall be produced for inspection before the person or persons authorised in this behalf by the Regional or Provincial Transport Authority; and ( viii ) that tickets shall be issued to passengers for the fares paid. (3)   The Provincial Transport Authority or a Regional Transport Authority may regulate the timings of departure of stage carriages, whether they belong to one or more owners.]  51.   Application for contract carriage permit.–   [65] [(1)] An application for a permit to use a motor vehicle as a contract carriage (in this Chapter referred to as a contract carriage permit) shall contain the following particulars, The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 26 of 85   6/2/2011 2:44 PM",
  "namely:-  [66] [( a ) the name and address of the applicant;]  [67] [( aa )] the type and seating capacity of the vehicle; ( b ) the area for which the permit is required; ( c )   [68] [* * * * * * * * * * *] ( d ) any other particulars which may be prescribed.  [69] [(2) An application under sub-section (1) shall be accompanied by an affidavit of the applicant to the effect that no Government servant has, either directly or indirectly, any financial interest in the vehicle in respect of which permit is applied for.]  52.   Procedure of Regional Transport Authority in considering application for contract carriage permits.–   A Regional Transport Authority, shall, in deciding whether to grant or refuse a contract carriage permit, have regard to the extent to which additional contract carriages may be necessary or desirable in the public interest; and shall also take into consideration any representations made by persons already holding contract carriage permits in the region or by any authority or police authority in the region to the effect that the number of contract carriages for which permits have already been granted is sufficient for or in excess of the needs of the region or any area within the region.  53.   Power to restrict the number of contract carriages and impose conditions on contract carriage permits.–   [70] [(1)] A Regional Transport Authority may, after consideration of the matters specified in section 52– ( a )   fix the number of contract carriages generally or contract carriages of any specified type for which contract carriage permits may be granted in the region or any specified area within the region; ( b ) refuse to grant a contract carriage permit or grant a contract carriage permit in respect of a particular contract carriage or a particular service of contract carriages in such form as it may, subject to the rules made under section 69, deem fit: Provided that no person shall be granted a contract carriage permit for any area not specified in the application made by him under section 51; ( c )   attach to the contract carriage permit any prescribed condition or all or any one of the following conditions, namely:- ( i ) that the contract carriage or contract carriages shall be used only in a specified area or on a specified route or routes; ( ii ) that except in accordance with specified conditions no contract or hiring may be entered into for transporting goods or passengers in the contract carriage or carriages outside a specified area; ( iii ) that subject to specified conditions, goods may be carried in a contract carriage to the exclusion of or in addition to passengers; ( iv ) that in the case of motor cabs, specified fares shall be charged and a table of fares displayed on the vehicle; ( v )   that in the case of vehicles other than motor cabs specified rates of hiring not exceeding specified maximum shall be charged; ( vi ) that in the case of motor cabs, a specified weight of passengers, luggage shall be carried free of charge and a specified charge shall be made for any luggage in excess of the luggage to be carried free of charge; ( vii ) that a taxi meter shall be fitted to every motor cab; ( viii ) that specified conditions of the permit shall be liable to be varied, and that further specified conditions may be attached to the permit by the authority at any time on due notice being given to the permit holder; ( ix )   that the conditions of the permit shall not be departed from save with the approval of the authority. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 27 of 85   6/2/2011 2:44 PM",
  "[71] [(2) The Regional Transport Authority or the Provincial Transport Authority shall insert a condition in every contract carriage permit, other than a permit in respect of a contract carriage constructed, adapted or used for carrying not more than six passengers including the driver, that in case of death of or injury to a passenger in the contract carriage arising out of the use of the contract carriage, the permit holder shall pay, as compensation to the passenger or the legal representatives of the passenger, the amount specified in the Thirteenth Schedule.]  54.   Application for private carriers permit.–   [72] [(1)] An application for a permit to use a transport vehicle for the carriage of goods for or in connection with a trade or business carried on by the applicant (in this Chapter referred to as a private carrier’s permit) shall contain the following particulars, namely:- ( a ) the type and carrying capacity of the vehicle; ( b ) the nature of the goods which the applicant expects normally to carry in connection with his trade or business; ( c ) the area for which the permit is required; and ( d ) any other particulars which may be prescribed.  [73] [(2) An application under sub-section (1) shall be accompanied by an affidavit of the applicant to the effect that no Government servant has, either directly or indirectly, any financial interest in the vehicle in respect of which permit is applied for.]  55.   Procedure of Regional Transport Authority in considering application for a private carrier’s permit.–   (1) Where an application conforming to the provisions of section 54 for a private carrier’s permit has been received by the Regional Transport Authority, it shall, if satisfied that the vehicle or vehicles for which the permit is required will not be used except in connection with the business of the applicant, such business not being transport business, grant the applicant, on the payment of the prescribed fee, a permit in the prescribed form in respect of the vehicle or vehicles specified, in the application: Provided that the Regional Transport Authority may, for reasons to be recorded in writing, a copy whereof shall be granted free of cost to the applicant, refuse to grant a permit, where– ( i ) the applicant is the holder of a private carrier’s permit which has been suspended; or ( ii ) any such permit previously held by the applicant has been cancelled; or ( iii )   any such permit previously granted in respect of the vehicle or vehicles for which the permit is applied for has been suspended or cancelled. (2)   A Regional Transport Authority may in granting a private carrier’s permit impose conditions to be specified in the permit relating to the description of goods which may be carried, or the area in which the permit shall be valid, or the maximum laden weight and axle weight of any vehicle used. (3)   A Regional Transport Authority may on the application of the holder of a private carrier’s permit granted by it and subject to such conditions as it may attach, extend the operation of the permit to the region or to any area within the region of another Regional Transport Authority, and the requirements of section 65 as to counter-signature of permits shall not be applicable to any such permit: Provided that nothing in this section shall authorise a Regional Transport Authority to grant a permit effective solely within the region of another Regional Transport Authority.  56.   Application for public carrier’s permit.–   An application for a permit to use a motor vehicle for the carriage of goods for hire or reward (in this Chapter referred to as a public carrier’s permit) shall be made on the prescribed form and shall contain the prescribed particulars   [74] [:]  [75] [Provided that the application shall be accompanied by an affidavit of the applicant to the effect that no Government servant has any financial interest, either directly or indirectly, in the vehicle in respect of which the application is made.] The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 28 of 85   6/2/2011 2:44 PM",
  "57.   Procedure of Regional Transport Authority in considering application for public carrier’s permit.–   (1) Where an application for a public carrier’s permit conforming to the provisions of section 56 has been received by a Regional Transport Authority, it shall, on payment of the prescribed fee, grant a permit in the prescribed form in respect of the vehicle or vehicles specified in the application: Provided that the Regional Transport Authority may refuse to grant the permit where– ( i ) the applicant is the holder of a public carrier’s permit which has been suspended; or ( ii ) any such permit previously held by the applicant has been cancelled; or ( iii )   any such permit previously granted in respect of the vehicle or vehicles for which the permit is applied for has been suspended or cancelled. (2)   A Regional Transport Authority may on the application of the holder of a public carrier’s permit granted by it, and subject to such conditions as it may attach, extend the operation of the permit to the region or to any area within the region of another Regional Transport Authority and the requirements of section 65 as to counter-signature of permits shall not be applicable to any such permit: Provided that nothing in this section shall authorise a Regional Transport Authority to grant a permit effective solely within the region of another transport authority.  58.   Power to restrict the number of and attach conditions to public carrier’s permits.–   The Regional Transport Authority may attach to a public carrier’s permit all or any of the following conditions, namely:- ( i ) that the vehicle shall be used only on specified routes or in a specified area; ( ii )   that the laden weight and the axle weights of any vehicles used shall not exceed a specified maximum; ( iii ) that such records as may be prescribed relating to the plying of the vehicles shall be maintained; and ( iv ) that the vehicle used shall comply with such other specified condition or conditions appropriate to the service which the Regional Transport Authority thinks proper to impose in the public interest or with a view to prevent uneconomic competition between road transport services.  59.   Procedure in applying for and granting permits.–   [76] [(1) An application for a permit of any kind may be made at any time.] (2)   [77] [* * * * * * * * * * * *] (3)   [78] [* * * * * * * * * * * *] (4)   [79]  [* * * * * * * * * * * *] (5)   [80]  [* * * * * * * * * * * *] (6)   [81] [* * * * * * * * * * * *] (7) When a Regional Transport Authority refuses an application for a permit of any kind it shall give to the applicant in writing its reasons for the refusal.  60.   Duration and renewal of permits.–   [82] [(1) A permit other than a special permit issued under section 64 shall be effective   [83] [* * *]– ( a )   in the case of a stage carriage permit or a contract carriage permit, not being a permit to ply a motor-cab, for such period not being less than one year and not more than three years as the  [84] [Provincial or]   Regional Transport   Authority   may   after   considering the   condition   of   the  [85] [public service vehicle] for the route in question in its discretion specify in the permit; and ( b ) in the case of any other permit, for such period not being less than three years and not more than five years, as the Regional Transport Authority may, in its discretion specify in the permit.] The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 29 of 85   6/2/2011 2:44 PM",
  "(2)   A permit may be renewed on an application made in that behalf in the prescribed manner and on payment of the prescribed fee for a period specified in sub-section (1)   [86] [:]  [87] [Provided that no person shall claim renewal of a permit of a stage carriage as a matter of right and the Authority which granted the permit may or may not renew it, for reasons to be recorded in writing.]  61.   General conditions attaching to all permits.–   (1) Save as provided in section 62, a permit shall not be transferable from one person to another except with the permission of the transport authority which granted the permit and shall not without such permission operate to confer on any person to whom a vehicle covered by the permit is transferred any right to use that vehicle in the manner authorised by the permit. (2) The holder of a permit may, with the permission of the authority by which the permit was granted, replace by another vehicle of the same or substantially similar nature and capacity any vehicle covered by the permit. (3) The following shall be conditions of every permit:- ( a )   that the vehicle or vehicles to which the permit relates are at all times so maintained as to comply with the requirements of Chapter VI and the rules made thereunder; ( b ) that the vehicle or vehicles to which the permit relates are not driven at a speed exceeding the speed permissible under this Ordinance; ( c )   that any prohibition or restriction imposed and any maximum or minimum fares or freights fixed by notification made under section 45 are observed in connection with any vehicle or vehicles to which the permit relates; ( d ) that the vehicle or vehicles to which the permit relates are not driven in contravention of the provision of section 76;  [88] [( dd ) that no Government servant shall acquire any interest, either directly or indirectly, in the vehicle covered by a permit except when he acquires such interest by operation of law or under the decree, judgment or order of any court or with the permission, in writing, of the authority by which the permit was granted;] ( e ) that the permit holder shall furnish to the Provincial Transport Authority or a Regional Transport Authority or an officer of the Transport Department authorized in this behalf, within such period of time as may be fixed by that authority or the officer, such information relating to the vehicle or vehicles covered by the permit or the permit holder’s business as a carrier as may be required by that authority or officer; ( f ) that the provisions of any law for the time being in force in the Province relating to insurance of motor vehicles so far as they apply to the holder of the permit are observed; and ( g )   that the permit holder’s business premises shall be according to a design approved by the Provincial Transport Authority and maintained properly.  Explanation – In this clause, business premises include bus stations, shelters, garages and repair shops for the vehicle or vehicles to which the permit relates.  62.   Cancellation and suspension of permit.–   (1) The transport authority which granted a permit may cancel the permit or may suspend it for such period as it thinks fit– ( a ) on the breach of any condition specified in sub-section (3) of section 61 or of any other condition contained in the permit; or ( b ) if the holder of the permit uses or causes or allows a vehicle to which the permit relates to be used in any manner not authorized by the permit; or ( c ) if the holder of the permit ceases to possess the vehicle or vehicles covered by the permit; or ( d ) if the holder of the permit has obtained the permit by fraud or misrepresentation; or ( e ) if the holder of a public carrier’s permit fails, without reasonable cause, to ply the vehicle; or ( f )   if the holder of the permit uses or causes or allows the vehicle or vehicles to be used for subversive activities against the State; or ( g )   if the holder of the permit uses or causes or allows the vehicle or vehicles to be used for the The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 30 of 85   6/2/2011 2:44 PM",
  "transport of goods the movement of which is banned under any law for the time being in force, or for the commission of a cognizable offence; or ( h )   if a forgery has been committed in respect of the permit or it has in any way otherwise been tampered with   [89] [; or]  [90] [(i) if the holder of a permit, of a route specified under section 45-A, fails to comply with any of the qualifications or any of the terms and conditions of the permit:] Provided that no permit shall be cancelled unless an opportunity has been given to the holder of the permit to submit his explanation and of being heard. (2) Where a transport authority cancels or suspends a permit, it shall record in writing its reasons for the cancellation or suspension and shall give a copy thereof to the holder of the permit.  [91]   [62-A. Suspension and cancellation of permits of the specified route and forfeiture of performance guarantee.–   If an owner, plying his stage carriages on a specified route having more than one permits, fails to comply with or violates any of the qualifications, or any terms and conditions of the permit, the Provincial Transport Authority may impose all or any of the following penalties upon him: (a) forfeiture of the whole or part of the performance guarantee; or (b) suspend all or any of the permits; or (c) cancel all or any of the permits: Provided that no such penalty shall be imposed upon the owner unless he is afforded an opportunity to show-cause against the specific allegations and the penalty proposed to be imposed upon him.]  63.   Transfer of permit on death of holder.–   (1) Where the holder of a permit dies, the person succeeding to the possession of the vehicle or vehicles covered by the permit may, for a period of three months, use the permit as if it had been granted to himself: Provided that such person has, within thirty days of the death of the holder, informed the transport authority which granted the permit of the death of the holder and of his intention to use the permit: Provided further that no permit shall be so used after the date on which it would have ceased to be effective without renewal in the hands of the deceased holder. (2) The transport authority may, on application made to it within three months of the death of the holder of a permit, transfer the permit to the person succeeding to the possession of the vehicles covered by the permit.  [92] [Explanation.–   For the purposes of this section, the word “death” shall include winding up, dissolution, insolvency or any other mode of extinction of a person or an entity.]  [93]   [64. Special permits.–   (1) A Regional Transport Authority may grant special permits, to be effective for one return trip only, authorising the use of a motor vehicle for that trip as a public service vehicle   [94] [or authorising a transport vehicle being driven empty.] (2)   A Regional Transport Authority may, subject to such conditions as it may impose in this behalf, delegate its powers of issuing a permit under sub-section (1) to its Chairman, any member or any gazetted officer of Government.]  65.   [ Validation of permits for use outside region in which granted ]. Deleted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (IX of 1970).  66.   Appeals.–   (1) Any person– ( a ) aggrieved by the refusal of the Provincial or a Regional Transport Authority to grant a permit, or by any condition attached to a permit granted to him; or The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 31 of 85   6/2/2011 2:44 PM",
  "( b )   aggrieved by the cancellation or suspension of the permit or by any variation of the conditions thereof; or ( c ) aggrieved by the refusal to transfer the permit to the person succeeding on the death of the holder of a permit to the possession of the vehicle or vehicles covered by the permit; or ( d ) aggrieved by the refusal of the Provincial or a Regional Transport Authority to countersign a permit, or by any condition attached to such countersignature; or ( e ) aggrieved by the refusal to renew a permit; or ( f )   being a local authority or police authority or an association which, or a person providing transport facilities who, having opposed the grant of a permit, is aggrieved by the grant thereof or by any condition attached thereto; or ( g ) being the holder of a licence, who is aggrieved by the refusal of a Regional Transport Authority to grant an authorisation to drive a public service vehicle;   [95] [or]  [96] [(h) aggrieved by a penalty of forfeiture, suspension or cancellation imposed under section 62-A,] may, within thirty days, and in the prescribed manner, appeal to the prescribed authority, who after giving such person and the original authority an opportunity of being heard, pass such order, not inconsistent with the provisions of this Ordinance or the rules framed thereunder, as it may deem fit: Provided that the appellate authority shall not increase the number of permits granted by the Provincial Transport Authority or a Regional Transport Authority. (2) No appeal shall lie against any order passed under sub-section (2) of section 45. (3) Save as expressly provided in this Ordinance, no Court or other authority shall have jurisdiction– ( a ) to entertain or adjudicate upon any matter which the Provincial or a Regional Transport Authority or the prescribed authority is empowered by this Ordinance to dispose of or to determine; or ( b )   to question the legality of anything done under this Ordinance by or at the instance of the Provincial or a Regional Transport Authority or the prescribed authority. (4) No Court or other authority shall be competent to grant an injunction or other order in relation to any proceedings before the Provincial or a Regional Transport Authority or the prescribed authority under this Ordinance, or anything done or intended to be done by or at the instance of any such authority under this Ordinance.  [97]   [67. Compensation for the death of, or injury to a passenger.–   [98] [(1) In the case of death of or injury to a passenger in a stage carriage or a contract carriage, other than a contract carriage constructed, adapted or used to carry not more than six passengers including the driver, arising out of the use of such carriage, the holder of the permit or, in the absence of the permit, the owner of the carriage shall pay, as compensation to the passenger or the legal representatives of the passenger, the amount specified in the Thirteenth Schedule.] (2)   The compensation payable under sub-section (1) shall be in addition to any sum which the person entitled to receive compensation may receive or be eligible to receive under a policy of insurance under the provisions of section 95 of the Motor Vehicles Act, 1939 (IV of 1939). (3) Any contract for the conveyance of a passenger in a stage carriage or contract carriage, other than a contract carriage constructed, adapted or used to carry not more than six passengers including the driver, in respect of which a permit has been issued under this Chapter, shall, so far as it purports to restrict the liability of any person, or to absolve any person from his liability, in respect of any claim made against that person in respect of the death of, or injury to, the passenger who is being carried in, entering or alighting from the vehicle or purports to impose any conditions with respect to the enforcement of any such liability, be void.]  [99]   [67-A.   Claims Tribunal.–   (1) Government may, by notification in the official Gazette, constitute a Claims Tribunal for such area or areas as may be specified in the notification, for the purpose of adjudicating upon claims for compensation under section 67. (2) A Claims Tribunal shall consist of one or more members as Government may deem fit to appoint, and where it consists of two or more members, one of them shall be appointed as the Chairman thereof.] The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 32 of 85   6/2/2011 2:44 PM",
  "[100]   [67-B.   Application for compensation.–   (1) An application for compensation under section 67 may be made– ( a ) by the person who has sustained the injury; or ( b ) where death has resulted, by the legal representatives of the deceased passenger; or ( c )   by an agent duly authorised by the person injured or the legal representatives of the deceased passenger, as the case may be. (2) Every application under sub-section (1) shall be made to the Claims Tribunal having jurisdiction over the area in which the accident resulting in the death or injury, as the case may be, of the passenger, and shall be in such form and shall contain such particulars as may be prescribed. (3) No application for compensation under this section shall be entertained unless it is   [101] [accompanied by such fee as may be prescribed and is] made within ninety days of the accident: Provided that the Claims Tribunal may entertain an application after the expiry of the said ninety days, if it is satisfied that the applicant was prevented by sufficient cause from making the application in time].  [102] [67-BB. Information regarding claim for compensation.–   Where the Claims Tribunal receives information from any source that an accident giving rise to a claim for compensation under section 67 has occurred within its jurisdiction, it may, after such inquiry as it may deem proper, inform the passenger injured in the accident or the legal representatives of the passenger who has died as a result of the accident that it is open to him or them to make an application for compensation under section 67-B and may give him or them, as the case may be, such other information as it may think fit.]  [103]   [67-C.   Award of compensation.–   On receipt of an application for compensation made under section 67-B, the Claims Tribunal shall hold an inquiry into the claim, giving an opportunity to the parties of being heard, and pass an order determining, in accordance with the provisions of section 67, the amount of compensation payable, and specifying the person or persons to whom the compensation shall be paid.]  [104]   [67-D.   Procedure and powers of Claims Tribunal.–   (1) In the holding of an inquiry under section 67-C, the Claims Tribunal shall, subject to any rules that may be made in this behalf by Government, follow such summary procedure as it thinks fit. (2)   The Claims Tribunal shall be deemed to be a Civil Court for all the purposes of section 195 and Chapter XXXV of the Code of Criminal Procedure, 1898 (Act V of 1898). (3) The Claims Tribunal shall have all the powers of a Civil Court– ( a ) for the purposes of taking evidence on oath, enforcing the attendance of witnesses and compelling the discovery and production of documents and material objects; and ( b ) for such other purposes as may be prescribed.]  [105]   [67-E. Appeal.–   (1) Subject to the provisions of sub-section (2), any person aggrieved by an order of the Claims Tribunal awarding or refusing to award compensation, may   [106] [on payment of such fee as may be prescribed] within ninety days from the date of the order, prefer an appeal to the prescribed authority   [107] [:]  [108] [Provided that the appellate authority may entertain an appeal after the expiry of the said ninety days, if it is satisfied that the appellant was prevented by sufficient cause from preferring the appeal in time.]  [109] [(2)   An appeal shall not lie under sub-section (1) if the amount in dispute in the appeal does not exceed rupees twenty-five thousand.]] The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 33 of 85   6/2/2011 2:44 PM",
  "[110]   [67-F.   Recovery of amount of compensation.–   (1) Where any compensation has been awarded by the Claims Tribunal or the prescribed authority, and the same has not been paid to the person to whom it has been awarded, within seven days of the order awarding the compensation– ( a ) if the compensation is payable by a person who has furnished a bank guarantee under section 49, the bank giving the guarantee shall on being required by the Tribunal deposit with the Tribunal the amount of compensation or so much thereof as can be paid out of the amount secured under the guarantee; provided that any amount of compensation which cannot be so recovered shall be recoverable in the manner provided in clause ( b ); ( b ) if the compensation is payable by a person who has not furnished a bank guarantee under section 49, the Claims Tribunal or the prescribed authority awarding the compensation may on the application of the person entitled to receive the compensation, issue a certificate to the Collector, and the Collector shall thereupon proceed to recover the amount specified in the certificate in the same manner as an arrear of land-revenue. (2)   Where any compensation has been paid under the provisions of clause ( a ) of sub-section (1) out of any amount secured under section 49 in respect of a stage carriage, the permit in respect of such stage carriage shall stand suspended until the permit holder furnishes to the Regional Transport Authority which issued the permit, a fresh bank guarantee of the prescribed sum under the provisions of section 49.]  [111] [(3)   An order passed by a Claims Tribunal of any other Province or of the State of Azad Jammu and Kashmir shall be enforceable in the Province in the same manner as if it were an order of the Claims Tribunal of the Province; provided the orders of the Claims Tribunal in the Province are also enforceable in such other Province or the said State.]  [112]   [67-G. Bar of jurisdiction.–   No Civil Court shall have jurisdiction to entertain any question relating to any claim for compensation which may be adjudicated upon by a Claims Tribunal, and no injunction in respect of any action taken or to be taken by or before a Claims Tribunal in respect of any claim for compensation shall be granted by a Civil Court.]  68.   Power to make rules as to stage carriages and contract carriages.–   (1) Government may make rules in respect of stage carriages and contract carriages– ( a ) to provide for the licensing of persons acting as conductors of such carriages; ( b )   to regulate the conduct of persons licensed to act as drivers of, and the conduct and duties of conductors of such vehicles, when acting as such; and ( c ) to regulate the conduct of passengers in such vehicles. (2) Without prejudice to the generality of the foregoing provisions, such rules may– ( a ) authorise the removal from such vehicle by the driver or conductor, or on the request of the driver or conductor, or any passenger, by any police officer, of any person infringing the rules; ( b ) require a passenger who is reasonably suspected by the driver or conductor of contravening the rules to give his name and address to a police officer or to the driver or conductor on demand; ( c ) require a passenger to declare, if so requested by the driver or conductor, the journey he intends to take or has taken in the vehicle and to pay the fare for the whole of such journey and to accept any ticket provided therefor; ( d )   require, on demand being made for the purpose by the driver or conductor or other persons authorised by the owner of the vehicle production during the journey and surrender at the end of the journey by the holder thereof any ticket issued to him; ( e )   require a passenger, if so requested by the driver or conductor, to leave the vehicles on the completion of the journey for which he has paid the fare; ( f )   require the surrender by the holder thereof on the expiry of the period of journey for which it is issued, of a ticket issued to him; ( g ) require the maintenance of complaint books in stage carriages and prescribe the conditions under The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 34 of 85   6/2/2011 2:44 PM",
  "which passengers may record any complaints in the same.  69.   Power to make rules for the purposes of this Chapter.–   (1) Government may make rules for the purposes of carrying into effect the provisions of this Chapter. (2) Without prejudice to the generality of the foregoing power, rules under this section may be made with respect to all or any of the following matters, namely:- ( i ) the period of appointment and the terms of appointment of and the conduct of business by Regional and Provincial Transport Authorities   [113] [the delegation of powers by them to their respective Chairmen or any member] and the reports to be furnished by them; ( ii ) the conduct and hearing of appeals that may be preferred under this Chapter, the fees to be paid in respect of such appeals and the refund of such fees; ( iii ) the forms to be used for the purposes of this Chapter, including the forms of permits; ( iv ) the issue of copies of permits in place of permits mutilated, defaced, lost or destroyed; ( v ) the documents, plates and marks to be carried by transport vehicles, the manner in which they are to be carried and the languages in which any such documents are to be expressed; ( vi )   the badges and uniform to be worn by drivers and conductors of stage carriages and contract carriages; ( vii ) the fees to be paid in respect of permits, duplicate permits, plates and badges; ( viii )   the exemption of prescribed persons or classes of persons from payment of all or any portion of the fees payable under this Chapter; ( ix )   the custody, production and cancellation on expiration, of permits, and the return of permits which have become void or have been cancelled; ( x )   the conditions subject to which a permit issued in one region shall be valid in another region; ( xi ) the authorities to whom, the time within which and the manner in which appeals may be preferred; ( xii ) the construction and fittings of, and the equipment to be carried in by stage and contract carriages, whether generally or in specified areas; ( xiii ) the determination of the number of passengers a stage or contract carriage is adapted to carry and the number of passengers which may be carried; ( xiv ) the condition subject to which goods may be carried on stage and contract carriages partly or wholly in lieu of passengers; ( xv ) the safe custody and disposal of property left in a stage or contract carriage; ( xvi ) regulating the painting or marking of transport vehicles and the display of advertising matter thereon, and in particular prohibiting the painting or marking of transport vehicles in such colour or manner as to induce any person to believe that the vehicle is used for the transport of mails; ( xvii )   the conveyance in stage or contract carriages of corpses or persons suffering from any infectious contagious disease or goods likely to cause discomfort or injury to passengers, and the inspection and disinfection of such carriages, if used for such purposes; ( xviii )   the provision of fitting taxi-meters of approved standard type on motor cabs, and the examining, testing and sealing of taxi-meters; ( xix )   prohibiting the picking up or setting down of passengers by stage or contract carriages at specified places or in specified areas or at places other than duly notified stands or halting places, and requiring the driver of a stage carriage to stop and remain stationary for a reasonable time when so required by a passenger desiring to board or alight from the vehicle at a notified halting place; ( xx ) the requirements which shall be complied with in the construction or use of any duly notified stand or halting place, including the provision or adequate facilities for the convenience of the users thereof, the fees, if any, which may be charged for the use of such stands or places, the staff to be employed thereat and the duties and conduct of such staff, and generally for The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 35 of 85   6/2/2011 2:44 PM",
  "maintaining such stands and places in a serviceable and clean condition; ( xxi ) the regulation of motor cab ranks; ( xxii ) requiring the owners of transport vehicles to notify any change of address or to report the failure of or damage to any vehicle used for the conveyance of passengers for hire or reward; ( xxiii ) authorising specified persons to enter at all reasonable times and inspect all premises used by permit holders for the purposes of their business; ( xxiv ) requiring a person incharge of a stage carriage to carry any person tendering the legal or customary fare; ( xxv ) the conditions under which, the types of containers or vehicles in which and the seasons during which animals or birds may or may not be carried; ( xxvi ) the licensing of and the regulation of the conduct of agents or canvassers who engage in the sale of tickets for travel by public service vehicles or otherwise solicit business for such vehicles; ( xxvii ) the licensing of and the regulation of the activities of agents in the business of collecting, forwarding and distributing of goods carried by transport vehicles; (x xviii ) the inspection of transport vehicles and their contents and of the permits relating to them; ( xxix ) the carriage of persons other than the driver in goods vehicles; ( xxx )   the records to be maintained and the return to be furnished by the owners of transport vehicles;   [114] [*]  [115] [[( xxxi )   the classification of routes and imposition of restrictions regarding age of vehicles for the purpose of issuing stage carriage permits;] ( xxxii ) the form in which application should be made for grant of permits; ( xxxiii )   the amount of security which should be made for the grant of stage carriage and contract carriage permits; and]  [116] [( xxxiv )] any other matter which is to be or may be prescribed.  [117]   [69A.   *   *   *   *   *   *   *   *   *   *   *   * ]  CHAPTER V [118]   [PUNJAB ROAD TRANSPORT BOARD] 70.   [119] [Punjab Road Transport Board].–   (1) Government may establish a   [120]  [Punjab Road Transport Board] for the purpose of operating road transport services in the Province and the   [121] [Board] so established shall be a body corporate by the name of the   [122] [Punjab Road Transport Board], having perpetual succession and a common seal and shall by that name sue and be sued.  [123] [(2)   The Board shall consist of a Chairman and eleven members and shall be constituted as follows:- ( i ) Minister incharge of Transport Department.   Chairman. ( ii ) Two members of the Provincial Assembly of the Punjab to be appointed by Government. Member. ( iii )   One representative or any bargaining agent of Road Transport   Board   workers   union   or   federation   to   be appointed by Government. Member. ( iv )   A representative of Technical Branch of Punjab Road Transport Board to be appointed by Government. Member. ( v )   A representative of Traffic Branch of Punjab Road Transport Board to be appointed by Government. Member. ( vi ) A representative of the Pakistan Western Railway to be appointed by Government. Member. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 36 of 85   6/2/2011 2:44 PM",
  "( vii ) Managing Director of the Punjab Road Transport Board.   Member. ( viii ) A representative of the Finance Department, Government of the Punjab to be appointed by Government. Member. ( ix ) A representative of the Punjab Transport Department to be appointed by Government. Member. ( x )   A representative of the Punjab Board of Industrial Management to be appointed by Government. Member. ( xi )   A representative of the Bankers’ consortium to be appointed by Government.] Member.  [124] [(3)   The term of office of each individual member shall be such as may be determined by Government at the time of his appointment.] (4) On the expiry of the term of his office   [125] [* * *] a member shall be eligible for re-appointment for another term or for such shorter term as Government may determine. (5)   [126] [Any] member may at any time resign his office. Provided that his resignation shall not take effect until it is accepted by Government. (6)   [127] [Each] member   [128] [may] receive such salary   [129] [or] allowances as may be determined by Government and shall perform such duties as may be assigned to them under this Ordinance or the rules framed thereunder. (7) Government may, by notification in the official Gazette, remove   [130] [* * *] any member– ( i )   if he refuses or fails to discharge or becomes in the opinion of Government incapable of discharging his responsibilities under this Ordinance; or ( ii ) if he has been declared insolvent; or ( iii )   if he has been declared to be disqualified for employment in, or has been dismissed from the service under the   [131] [Federal] Government or the Provincial Government or has been convicted of an offence involving moral turpitude; or ( iv )   if he has knowingly acquired or continues to hold, without the permission in writing of Government, directly or indirectly or through a partner, any share or interest in any contract or employment with or by or on behalf of the   [132] [Board] or in any land or property which to his knowledge is likely to benefit or has benefitted as a result of the operations of the   [133] [Board];  [134]  [( v ) if he absents himself form any meeting of the Board without leave of absence; ( vi ) if he is found to be a lunatic or is of unsound mind.]  [135]  [(7-A)   A person employed for the purpose of an organization established under sub-section (1) shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860).]  [136] [(8)   A person employed for the purpose of the   [137] [Board] shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code, 1860, but shall not be deemed to be a servant of the Government on the ground that he is employed by the   [138] [Board] established by the Government.]  [139] [(9)] Government shall consult the   [140] [Board] in all matters relating to the co-ordination of road and rail transport and in the fixation of fares and freights under Chapter IV.  [141]  [(10)]   Government may make rules not inconsistent with the provisions of this Ordinance, prescribing the powers and functions of the   [142]  [Board].  [143]  [(11) Notwithstanding anything contained in any law or any instrument having the force of law for the time being in force, or any judgment of any court Government shall have the Power, and shall be deemed always to have had the power, to dissolve by notification the Board established under subsection (1) and to lay down in the The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 37 of 85   6/2/2011 2:44 PM",
  "notification the manner in which all or any of the affairs of the Board, including matters relating to the assets, liabilities, employees and officers of the Board and all matters ensuing as a consequence of the dissolution of the Board shall be dealt with after its dissolution. (12)   Any action taken, notification issued or order made by Government on or after the ninth day of May, 1985, for the dissolution of the Board established under subsection (1) and dealing with the matters ensuing as a consequence of the dissolution shall, notwithstanding anything contained in any law or any instrument having the force of law for the time being in force, or any judgment of any Court, be deemed to have been validly taken, issued or made, as the case may be.]  71.   Transport Authorities to have no jurisdiction in respect of motor transport operated by the [144]   [Board].–   (1) The   [145] [Board] may operate motor transport on any route it may think fit, and where it so operates such transport, the Provincial Transport Authority and a Regional Transport Authority shall, notwithstanding anything in this Ordinance, have no jurisdiction in relation to that transport. (2) The Provincial Transport Authority or the Regional Transport Authority shall not grant or issue stage carriage permits on new route or routes wholly lying within an urban area to be notified in this behalf by Government, unless an offer has first been made to the   [146] [Board] to operate its services on such route or routes and the   [147] [Board] has declined to operate its services on such route or routes: Provided that if the   [148] [Board] fails to operate its services on such route or routes within three months of the date on which the offer of the Provincial Transport Authority or the Regional Transport Authority, as the case may be, was communicated to it, it shall be presumed that the   [149] [Board] has declined to operate its services on such route or routes.  72.   Powers of the   [150]   [Road Transport Board] to acquire property for motor transport operated by it.–   (1)   [151] [Board] shall have power to acquire any property, movable or immovable, used in, or for, or ancillary to, the operation of any motor transport conducted under this Chapter. (2)   Such acquisition may be made by serving a notice of acquisition on the owner of the property, or if such owner is not readily traceable or the ownership is in dispute, by a notice of acquisition published in the official Gazette and shall take effect from the beginning of the day on which the notice is served or published. (3) For any property so acquired there shall be paid compensation equivalent to the market value of the property acquired to be calculated in such manner as Government may prescribe. (4)   If any dispute arises as to the amount of compensation payable under sub-section (3), it shall be referred to the arbitration of a person who is or has been a High Court Judge and his award shall be final and binding on the parties and shall not be called in question in any Court of law nor shall anything in the Arbitration Act, 1940 [152] , apply to such an arbitration.  [153]   [CHAPTER V-A URBAN TRANSPORT COMPANY 72-A.   Company .– (1) The Government may, in the notified area, establish an Urban Transport Company registered under the Companies Ordinance 1984 (XLVII of 1984) for the provision of urban transport and related services.  (2) A director or an employee of the Company shall be deemed as a public servant within the meaning of section 21 of the Pakistan Penal Code 1860 (XLV of 1860). (3) The Company shall advise the Government on all public policy matters of urban transport and related services.  72-B.   Powers of the Company .– (1) The Company may, in the notified area– (a) plan, align, classify and re-classify a route; (b) specify, operate and enforce the urban transport on the routes; and The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 38 of 85   6/2/2011 2:44 PM",
  "(c) plan, build, and maintain infrastructures for the urban transport and related services. (2)   If the Company undertakes to operate urban transport on a route in the notified area that caters to the needs of passengers on the route then notwithstanding anything contained in this Ordinance, the Provincial Transport Authority or a Regional Transport Authority shall not: (a) issue route permit for such route to any public service vehicle as the Company may notify to the Authority; or (b)   perform any function or exercise any power in relation to a matter specifically assigned to the Company.  72-C.   Property of the Company .– (1) The Company may acquire, hold, possess and dispose of any property, movable or immovable, for purposes of the urban transport.  (2) The Company shall not dispose of an immovable property without the prior approval of the Government.  72-D.   Fixation of fares .– (1)   Notwithstanding anything contained in section 45, the Company shall fix the fares to be charged by the urban transport. (2) The Government may, on its own motion or on the application of any person, revise the fare fixed by the Company by taking into consideration the operational viability of the urban transport.  72-E.   Delegation of powers .– The Government may delegate any powers or functions of an officer, authority or body under this Ordinance to the Company or employees of the Company to be exercised by it or them in the notified area subject to such conditions as may be determined by the Government.  72-F.   Interpretation .– In this Chapter– (a) “Company” means the Urban Transport Company established under section 72-A; (b) “infrastructure” means: (i) bus stops; (ii) shelters; (iii) bus lanes and markings; (iv) signage; (v) bus terminals; (vi) interchanges and transfer terminals; and (vii) any other related structures. (c)   “notified area” means an area notified by the Government for the purpose of provision of urban transport and related services; and (d) “urban transport” means the public service vehicles operating in the notified area.  72-G.   Power to make rules .– The Government may, by notification, make rules regulating the urban transport, provision of infrastructure in the notified area, routes and other connected purposes.]  CHAPTER VI CONSTRUCTION, EQUIPMENT AND MAINTENANCE OF MOTOR VEHICLES 73.   General provisions regarding construction and maintenance.–   Every motor vehicle shall be so constructed and so maintained as to be at all times under the effective control of the person driving the vehicle.  74.   Power to make rules.–   (1) Government may make rules regulating the construction, equipment and maintenance of motor vehicles and trailers. (2)   Without prejudice to the generality of the foregoing power, Government may make rules governing any of the following matters either generally in respect of motor vehicles or trailers or motor vehicles or trailers of a particular class or in particular circumstances, namely:- ( a ) the width, height, length and overhang of vehicles and of the loads to be carried therein; ( b )   seating arrangements in public service vehicles and the protection of passengers against the The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 39 of 85   6/2/2011 2:44 PM",
  "weather; ( c ) the size, nature and condition of tyres; ( d ) brakes and steering gear; ( e ) the use of safety glass; ( f ) signalling appliances, lamps and reflectors; ( g ) speed governors; ( h ) the emission of smoke, visible vapour, sparks, ashes, grit or oil; ( i ) the reduction of noise emitted by or caused by vehicles; ( j ) prohibiting or restricting the use of audible signals at certain times or in certain places; ( k ) prohibiting the carrying of appliance likely to cause annoyance or danger; ( l ) the periodical testing and inspection of vehicles by prescribed authorities; ( m )   the particulars, other than registration marks, to be exhibited by vehicles and the manner in which they shall be exhibited; ( n ) the use of trailers or semi-trailers with motor vehicles; and ( o )   prohibiting or requiring the painting in particular colours of motor vehicles of particular description or for particular purposes or in particular areas.  CHAPTER VII CONTROL OF TRAFFIC 75.   Limits of speed.–   (1) No person shall drive a motor vehicle or cause or allow a motor vehicle to be driven in any public place at a speed exceeding the maximum speed fixed for the vehicle by or under this Ordinance or by or under any other law for the time being in force: Provided that such maximum speed shall in no case exceed the maximum fixed for the vehicle in the Eighth Schedule. (2)   Government or any authority authorized in this behalf by Government may, if satisfied that it is necessary to restrict the speed of motor vehicles in the interest of public safety or convenience or because of the nature of any road or bridge, by notification in the official Gazette, fix such maximum speed limits as it thinks fit for motor vehicles or any specified class of motor vehicles or for motor vehicles to which a trailer is attached either generally or in a particular area or on a particular road or roads, and where any such restrictions are imposed, cause appropriate traffic signs to be placed or erected under section 79 at suitable places in such area or on or near such road or bridge, as the case may be. (3) Nothing in this section shall apply to any vehicle registered under section 40 while it is being used in the execution of military manoeuvres within the area and during the period specified in a notification under sub-section (1) of section 2 of the Manoeuvres, Field Firing and Artillery Practice Act, 1938 [154] .  76.   Limit of weight and limitation on use.–   (1) Government may prescribe conditions for the issue of permits for heavy transport vehicles by the Provincial or Regional Transport Authorities and may prohibit or restrict the use of such vehicles in any area or route within the Province. (2)   Except as may be otherwise prescribed, no person shall drive or cause or allow to be driven in any public place any motor vehicle which is not fitted with pneumatic tyres. (3) No person shall drive or cause or allow to be driven in any public place any motor vehicle or trailer– ( a ) the unladen weight of which exceeds the unladen weight specified in the certificate of registration of the vehicle; or ( b )   the laden weight of which exceeds the registered laden weight specified in the certificate of registration; or ( c ) any axle weight which exceeds the maximum axle weight specified for that axle in the certificate of registration. (4) Where the driver or person in charge of a motor vehicle or trailer driven in contravention of sub-section (2) or sub-section (3) is not the owner, a Court may presume that the offence was committed with the knowledge of or under the orders of the owner of the motor vehicle or trailer. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 40 of 85   6/2/2011 2:44 PM",
  "77.   Power to have vehicle weighed.–   Any person authorized in this behalf by Government may, if he has reason to believe that a goods vehicle or trailer is being used in contravention of section 76, require the driver to convey the vehicle to a weighing device, if any, within a distance of one mile from any point on the forward route or within a distance of five miles from the destination of the vehicle for weighment; and if on such weighment the vehicle is found to contravene in any respect the provisions of section 76 regarding weight, he may, by order in writing, direct the driver to convey the vehicle or trailer to the nearest place to be specified in the order, where facilities exist for the storage of goods, and not to remove the vehicle or trailer form that place until the laden weight or axle weight has been reduced or the vehicle has otherwise been treated so that it complies with the provisions of the last preceding section.  78.   Power to restrict the use of vehicles.–   Government or any authority authorized in this behalf by Government, if satisfied that it is necessary in the interest of public safety or convenience, or because of the nature of any road or bridge, may by notification in the official Gazette, prohibit or restrict, subject to such exceptions and conditions as may be specified in the notification, the driving of motor vehicles or of any specified class of motor vehicles or the use of trailers either generally in a specified area or on a specified road, or bridge, and when any such prohibition or restriction is imposed, shall cause appropriate traffic signs to be placed or erected under section 79 at suitable places in such area or on or near such road or bridge, as the case may be: Provided that where any prohibition or restriction under this section is to remain in force for a period of not more than one month, notification thereof shall not be necessary.  79.   Power to erect traffic signs.–   (1) Government or any authority authorized in this behalf by Government may cause or permit traffic signs to be placed or erected in any public place for the purpose of regulating motor vehicle traffic. (2)   Traffic signs erected under this Chapter for any purpose for which provision is made in the Ninth Schedule shall be of the size, colour and type and shall have the meanings set forth in the Ninth Schedule, but Government or any authority empowered in this behalf by Government may make or authorise the addition to any sign set forth in the said Schedule of transcription of the words, letters or figures thereon in such script as Government may think fit: Provided that the transcription shall be of similar size and colour to the words, letters or figures set forth in the Ninth Schedule. (3) Except as provided by this Chapter, no traffic sign shall, after the commencement of this Ordinance, be placed or erected on or near any road; but all traffic signs erected prior to the commencement of this Ordinance by any competent authority shall for the purposes of this Ordinance be deemed to be traffic signs erected under the provisions of this Chapter. (4)   Government or any authority authorized under sub-section (1) may remove or cause to be removed any sign or advertisement which, in its opinion, is so placed as to obscure any traffic sign from view or any sign or advertisement which is, in its opinion so similar in appearance to a traffic sign as to be misleading.  80.   Parking places and halting stations.–   Government or any authority authorized in this behalf by Government may, in consultation with the local authority having jurisdiction in the area concerned, determine places at which motor vehicles may stand either indefinitely or for a specified period of time, and may determine the places at which public service vehicles may stop for a longer time than is necessary for taking up and setting down of passengers.  81.   Main roads.–   Government or any authority authorized by it in this behalf may, by notification in the official Gazette or by the erection at suitable places of the appropriate traffic signs referred to in   [155] [Part III] of the Ninth Schedule, designate certain roads as main roads for the purposes of the regulations contained in the Tenth Schedule.  82.   Duty to obey traffic signs.–   (1) Every driver of a motor vehicle shall drive the vehicle in conformity The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 41 of 85   6/2/2011 2:44 PM",
  "with any indication given by a mandatory traffic sign and in conformity with the driving regulations set forth in the Tenth Schedule, and shall comply with all directions given by any electrical traffic signalling device or by any police officer engaged in the regulation of traffic in any public place. (2)   In this section “mandatory traffic sign” means traffic sign included in   [156] [Part III] of the Ninth Schedule, of any traffic sign of similar form (that is to say, consisting of or including a circular disc displaying a device, word or figure and having a red ground or border) erected for the purpose of regulating motor vehicle traffic under sub-section (1) of section 79.  83.   Signals and signalling devices.–   The driver of a motor vehicle shall on the occasions specified in the Eleventh Schedule make the signal specified therein: Provided that the signals of an intention to turn to the right or left or to stop may be given by a mechanical or an electrical device of a prescribed nature affixed to the vehicle.  84.   Vehicles with left hand control.–   No person shall drive or cause or allow to be driven in any public place any motor vehicle with a left hand steering control unless it is equipped with a mechanical or electrical signalling device of a prescribed nature and in working order.  85.   Leaving vehicle in dangerous position.–   No person in charge of a motor vehicle shall cause or allow the vehicle or any trailer to remain at rest on any road in such a position or in such a condition or in such circumstances as to cause or be likely to cause danger, obstruction or undue inconvenience to other users of the road.  86.   Riding on running boards.–   No person driving or in charge of a motor vehicle shall carry any person or permit any person to be carried on the running board or otherwise than within the body of the vehicle: Provided that Government may, by notification in the official Gazette, permit, in such areas as may be specified in the notification, the Civil Armed Forces, the Frontier Constabulary, the West Pakistan Rangers and the Armed Police to have an armed picket on the running board of a motor vehicle or otherwise than within the body of the vehicle.  87.   Obstruction of driver.–   No person driving a motor vehicle shall allow any person to stand or sit or anything to be placed in such manner or position as to hamper the driver in his control of the vehicle.  88.   Stationary vehicles.–   No person driving or in charge of a motor vehicle shall cause or allow the vehicle to remain stationary in any public place, unless there is in the driver’s seat a person duly licensed to drive the vehicle or unless the mechanism has been stopped and a brake or brakes applied or such other measures taken to ensure that the vehicle cannot accidentally be put in motion in the absence of the driver.  89.   Pillion riding.–   No driver of a two wheeled motor cycle shall carry more than one person in addition to himself on the cycle and no such person shall be carried otherwise than sitting on a proper seat securely fixed to the cycle behind the driver’s seat.  [157] [89-A. Rider to wear helmet.–   No person shall drive, or ride the pillion seat of, a two-wheeled motor vehicle except when he is wearing a crash helmet.  Explanation – In this section, “crash helmet” means a helmet made of such material and meeting such other requirements as may be prescribed.]  [158]   [89-B. Seatbelt .– (1) A person who is driving a motor car, motor cab, light transport vehicle or a heavy transport vehicle on a notified road shall fasten a seatbelt. (2)   The provision of sub-section (1) shall not apply if– (a)   the person who is driving has a medical exemption certificate issued by a qualified medical practitioner; (b) no seatbelt is fitted in the vehicle by the manufacturer; (c)   the vehicle is a two or three wheel vehicle or a delivery van, an emergency vehicle, or a goods vehicle; or The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 42 of 85   6/2/2011 2:44 PM",
  "(d) the person driving the vehicle is performing a reverse maneuver. (3)   The Government may exempt a class of vehicles, a vehicle, a person or a class of persons from the application of this provision and may charge a prescribe amount of fee for the exemption. (4) The Government shall notify roads for the purposes of this section.]  90.   Duty to produce licence and certificate of registration.–   (1) The driver of a motor vehicle in any public place, shall, on demand by any police officer in uniform or any officer of the Transport Department not below the rank of Sub-Inspector   [159] [or a person authorized by the Government], on production if so required of his authority, produce his licence and the certificate of registration of the vehicle and where, the vehicle is transport vehicle, the certificate of fitness and the permit of the vehicle referred to in section 39 and 44, respectively for examination. (2)   The owner of a motor vehicle, or in his absence the driver or other person in charge of the vehicle shall, on demand by a registering authority or any person authorized in this behalf by Government, produce the certificate of registration of vehicle and, where the vehicle is a transport vehicle, the certificate of fitness referred to in section 39. (3) If the licence or certificates, as the case may be, are not at the time in the possession of the person to whom demand is made, it shall be a sufficient compliance with this section if such person produces the licence or certificate within ten days at any police station in the Province which he specifies, to the officer or authority making the demand: Provided that, except to such extent and with such modifications as may be prescribed, the provisions of this sub-section shall not apply to a driver driving as a paid employee, or to the driver of a transport vehicle or to any person required to produce the certificate of registration or the certificate of fitness of a transport vehicle.  91.   Railway crossing.–   (1) The driver of a transport vehicle who desires to pass over   [160] [an un-manned] railway level crossing shall cause the vehicle to stop before the crossing and shall not attempt to pass over the crossing unless the conductor of the vehicle, or where the vehicle has no conductor, a person authorized in this behalf by the owner of the vehicle in writing other than the driver of the vehicle, walks before the vehicle until it has cleared the railway lines. (2) The name and particulars of the persons authorized by the owner under sub-section (1) shall be reported by the owner to the Registration Authority. (3)   A person shall not be deemed to have been authorized by owner of the vehicle for the purposes of sub-section (1) unless he has in his possession at the time of performing the act required to be done under that sub-section the written authority of the owner in this behalf.  92. Duty of driver to stop in certain cases.–   [161]  [(1) A person who is driving a motor vehicle shall cause the vehicle to stop and remain stationery when– (a) required or directed by a police officer in uniform; (b) required by a person authorized by the Government; (c)   required by a person in charge of an animal if the person apprehends that the animal is, or being alarmed by the vehicle, and may become unmanageable; or (d) the vehicle is involved in an accident with a person or property and the person driving shall give his name and address and the name and address of the owner to the person affected by the accident.] (2) The driver of a motor vehicle shall, on demand by a person giving his own name and address and alleging that the driver has committed an offence punishable under section 99, give his name and address to that person. (3) In this section the expression “animal” means any horse, cattle, elephant, camel, ass, mule, sheep or goat.  93.   Duty of owner of motor vehicles to give information.–   The owner of a motor vehicle the driver of which is accused of any offence under this Ordinance shall, on the demand of any police officer or an officer of the The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 43 of 85   6/2/2011 2:44 PM",
  "Transport Department   [162] [or a person] authorized in this behalf by Government, give all information regarding the name and address of and the licence held by the driver which is in his possession or could by the exercise of due diligence be ascertained by him.  94.   Duty of driver in case of accident and injury to a person, animal or damage to property.–   When any accident occurs, in which a motor vehicle is involved, the driver of the vehicle or other person in charge of the vehicle shall– ( a )   if any person is injured as a result of such accident, take all reasonable steps to secure medical attention for the person so injured, and, if necessary, convey him to the nearest hospital, unless the injured person or his guardian, in case he is a minor, desires otherwise; ( b ) if any animal is injured as a result of such accident, take steps and endeavour to locate and report the matter to the owner or custodian of the animal so injured and take all reasonable steps to secure medical attention, if necessary, for the animal; ( c ) if any damage has been caused to any property as a result of such accident, take reasonable steps to report the damage to the party sustaining the damage; and ( d )   give on demand by a police officer or an officer of the Transport Department   [163] [or a person] authorized in this behalf by Government any information required by such officer relating to the occurrence, or, if no such officer is present, report the circumstances of occurrence at the nearest police station as soon as possible, and in any case within twenty-four hours of the occurrence.  [164] [94-A.   Duty of police officer in case of accident giving rise to claim for compensation.–   When an accident giving rise to a claim for compensation under section 67 is reported at a police station, the officer- in-charge of the police station shall immediately forward a copy of the first information report or the relevant extract of the daily diary, as the case may be, to the Claims Tribunal within whose jurisdiction the accident has taken place.]  95.   Inspection of vehicle involved in accident.–   When any accident occurs in which a motor vehicle is involved, any person authorized in this behalf by Government may, on production if so required of his authority, inspect the vehicle and for that purpose may enter at any reasonable time any premises where the vehicle may be, and may remove the vehicle for examination: Provided that the place to which the vehicle is so removed shall be intimated to the owner of the vehicle and the vehicle shall be returned without unnecessary delay, and in no case later than forty-eight hours of its removal.  96.   Power to make rules.–   (1) Government may make rules for the purpose of carrying into effect the provisions of this Chapter. (2)   Without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:- ( a ) the nature of the mechanical or electrical signalling devices which may be used on motor vehicles; ( b )   the erection of electrical traffic signalling devices, and the types of such devices that may be installed; ( c ) the removal and the safe custody of vehicles, including their loads, which have broken down or which have been left standing or have been abandoned on roads; ( d ) the installation and use of weighing devices; ( e ) the exemption from all or any of the provisions of this Chapter of emergency vehicles and other special classes of vehicles, subject to such conditions as may be prescribed; ( f )   the maintenance and management of parking places and stands and the fees, if any, which may be charged for their use; ( g ) prohibiting the driving down hill of a motor vehicle with the gear disengaged, either generally or in specified place; ( h ) prohibiting the taking hold of or mounting of a motor vehicle in motion; The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 44 of 85   6/2/2011 2:44 PM",
  "( i )   prohibiting the use of foot paths or pavements by motor vehicles; ( j )   generally, the prevention of danger, injury or annoyance to the public or any person, or of danger or injury to property or of obstruction to traffic.  CHAPTER VIII OFFENCES, PENALTIES AND PROCEDURE 97.   Offences relating to licences.–   Whoever, being disqualified under this Ordinance for holding or obtaining a licence, drives a motor vehicle in a public place or applies for or obtains a licence or, not being entitled to have a licence issued to him free of endorsement, applies for or obtains a licence without disclosing the endorsements made on a licence previously held by him, or being disqualified under this Ordinance for holding or obtaining a licence, uses a licence such as is referred to in sub-section (2) of section 10, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both, and any licence so obtained by him shall be of no effect; and if the vehicle so driven is a transport vehicle or, the licence so applied for, obtained or used is a licence to drive a transport vehicle, shall be punished with imprisonment which may extend to two years and with fine which may extend to rupees one thousand, and any licence so obtained by him shall be of no effect.  98.   Driving at excessive speed.–   [165] [(1) A person who drives a motor vehicle in contravention of section 75 shall be punished with fine which shall not be less than two hundred rupees and which may extend to five hundred rupees, and in case of a transport vehicle, with a fine which shall not be less than five hundred rupees and which may extend to one thousand rupees.] (2) Whoever causes any person who is employed by him or is subject to his control to drive a motor vehicle in contravention of section 75 shall be punished with fine which may extend to two hundred rupees, and when the vehicle is a transport vehicle, with a fine which may extend to five hundred rupees. (3) No person shall be convicted of an offence punishable under sub-section (1) solely on the evidence of one witness to the effect that in the opinion of the witness such person was driving at a speed which was unlawful, unless that opinion is shown to be based on an estimate obtained by the use of some mechanical device. (4) The publication of a time table under which, or the giving of any direction that any journey or part of a journey is to be completed within a specified time shall, if in the opinion of the Court it is not practicable in the circumstances of the case for the journey or part of a journey to be completed in the specified time without infringing the provisions of section 75, be   prima facie   evidence that the person who published the time table or gave the direction has committed an offence punishable under sub-section (2).  99.   Driving recklessly or dangerously.–   (1) Whoever drives a motor vehicle at a speed or in a manner which is dangerous to human life or property having regard to all the circumstances of the case, including the nature, condition and use of the place where the vehicle is driven and the amount of traffic which actually is at the time or which might reasonably be expected to be in the place, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five hundred rupees, and if the vehicle be a transport vehicle, with imprisonment which may extend to one year and with a fine which may extend to one thousand rupees. (2)   Whoever, having been previously convicted of an offence specified in sub-section (1) shall, within three years of such conviction, be guilty of an offence punishable under that sub-section, shall be subject for every such subsequent offence to imprisonment of either description for a term which may extend to two years, or with fine which may extend to one thousand rupees, or with both, and where the vehicle is a transport vehicle, with imprisonment which may extend to four years and with fine which may extend to one thousand rupees.  [166] [99-A.   One wheeling of motorcycle.–   (1) Whoever drives or rides a motorcycle in any public place, while standing or lying thereon or on one wheel, which endangers or is likely to endanger human life or property, shall be The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 45 of 85   6/2/2011 2:44 PM",
  "liable to be punished with imprisonment for a term which may extend to six months or with fine which may extend to five thousand rupees or with both. (2)   Whoever, having previously been convicted of an offence specified in sub-section (1), commits the same offence within three years of his previous conviction, shall, for every such subsequent offence, be liable to be punished with imprisonment for a term which may extend to two years or with fine which may extend to ten thousand rupees or with both. (3)   Offence under this section shall be cognizable and the police officer   [167] [or a person authorized by the Government] may seize and detain the motorcycle. (4)   The motorcycle seized and detained under sub-section (3) by any police officer   [168] [or a person authorized by the Government], may not be released before or during the trial of the offence and may be forfeited at the time of conviction of the accused. (5) Offence under this section shall be triable by a Judicial Magistrate of the first class and the Magistrate may, if he thinks fit, try the offence, punishable under this section, in a summary way in accordance with the provisions of Chapter XXII of the Criminal Procedure Code, 1898 (V of 1898).]  100.   Driving while under the influence of drink or drugs.–   Whoever while driving or attempting to drive a motor vehicle is under the influence of drink or a drug to such an extent as to be incapable of exercising proper control over the vehicle, shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both, and if having been previously convicted of such an offence, shall again be guilty of an offence punishable under this section, shall be subject for every such subsequent offence to imprisonment of either description for a term which may extend to two years, or with fine which may extend to one thousand rupees, or with both.  101.   Driving when mentally or physically unfit to drive.–   Whoever drives a motor vehicle in any public place when he is to his knowledge suffering from any disease or disability calculated to cause his driving of the vehicle to be a source of danger to the public, shall be punished with fine which may extend to two hundred rupees, and if having been previously convicted of such an offence, shall again be guilty of an offence punishable under this section, shall be subject for every such subsequent offence to fine which may extend to five hundred rupees.  [169]   [101-A.   Use of mobile telephones .– (1) A person shall not drive a motor vehicle if he is using a hand-held   mobile   telephone   or   a   device   which   performs   an   interactive   communication   function   of transmitting and receiving data. (2)   A person shall not be guilty of contravention of sub-section (1) if, at the time of the alleged contravention, he is– (a)   using the mobile telephone or the device to call the police, fire, ambulance or other emergency service; or (b) acting in response to an emergency. (3)   A person who contravenes the provision of sub-section (1), shall be punished with fine which shall not be less than two hundred rupees and which may extend to five hundred rupees, and in case of a transport vehicle, with a fine which shall not be less than five hundred rupees and which may extend to one thousand rupees.]  102.   Punishment for abetment of certain offences.–   Whoever abets the commission of an offence under section 99, 100 or 101, shall be punishable with the punishment provided for the offence.  103.   Racing and trials of speed.–   Whoever, without the written consent of Government, permits or takes part in a race or trial of speed between motor vehicles in any public place shall be punished with imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 46 of 85   6/2/2011 2:44 PM",
  "104.   Using vehicle in unsafe condition.–   Any person who drives or causes or allows to be driven in any public place a motor vehicle or trailer while the vehicle or trailer has any defect, which such person knows of or could have discovered by the exercise of ordinary care and which is calculated to render the driving of the vehicle a source of danger to persons and vehicles using such place, shall be punished with imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both, or if as a result of such defect an accident causing bodily injury to any person or animal or damage to property takes place, with imprisonment which may extend to six months, or with fine which may extend to one thousand rupees, or with both.  105.   Sale of vehicle in or alteration of vehicle to a condition contravening this Ordinance.–   Whoever, being an importer of or dealer in motor vehicles, sells or delivers or offers to sell or deliver a motor vehicle or trailer in such condition that the use thereof in a public place would be in contravention of Chapter VI or any rule made thereunder or alters the motor vehicle or trailer so as to render its condition such that its use in a public place would be in contravention of Chapter VI or any rule made thereunder shall be punished with fine which may extend to two hundred rupees: Provided that no person shall be convicted under this section if he proves that he had reasonable cause to believe that the vehicle would not be used in a public place until it had been put into a condition in which it might lawfully be so used.  106.   Using vehicle without permit.–   Whoever drives a motor vehicle or causes or allows a motor vehicle to be used or lets out a motor vehicle for use in contravention of the provisions of sub-section (1) of section 44 shall be punished with imprisonment for a term which may extend to six months or with fine which may extend to five hundred rupees, and if having been previously convicted of such an offence, shall again be guilty of an offence punishable under this section, shall be subject for every such subsequent offence to imprisonment for a term which may extend to two years, or with fine which may extend to one thousand rupees, or with both. (2) Nothing in this section shall apply to the use of a motor vehicle in an emergency for the conveyance of persons suffering from sickness or injury or for the transport of materials for repair or of food or materials to relieve distress or of medical supplies for a like purpose; provided that the person using the vehicle reports such use to the Regional Transport Authority within seven days.  107.   Driving vehicle exceeding permissible weight.–   Whoever drives a motor vehicle or causes or allows a motor vehicle to be driven in contravention of the provisions of section 76 or of the conditions of any permit issued thereunder, or in contravention of any prohibition or restriction imposed under section 78 shall be punished with fine which may extend to one hundred rupees, and if having been previously convicted of such an offence, shall again be guilty of an offence under this section, shall be subject for every such subsequent offence to fine which may extend to five hundred rupees.  108.   Penalty for failing to stop in case of accident or failure to furnish information, etc.–   Whoever contravenes the provisions of clause ( c ) of sub-section (1) of section 92 or any of the provisions contained in section 94 or furnishes any information required to be furnished thereunder which he knows to be false shall be punishable with imprisonment which may extend to six months, or with fine which may extend to one thousand rupees, or with both.  109.   Taking vehicle without authority.–   Whoever takes and drives away any motor vehicle without having either the consent of the owner thereof or other lawful authority shall be punished with imprisonment which may extend to three months, or with fine which may extend to five hundred rupees, or with both: Provided that no accused person shall be convicted under this section if the Court is satisfied that the accused acted in the reasonable belief that he had lawful authority or in the reasonable belief that the owner would in the circumstances of the case have given his consent if he had been asked to do so. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 47 of 85   6/2/2011 2:44 PM",
  "110.   Unauthorized interference with vehicle.–   Whoever otherwise than with lawful authority or reasonable excuse enters or mounts any stationary motor vehicle or tampers with the brake or any part of the mechanism of a motor vehicle shall be punished with imprisonment which may extend to one month or with fine which may extend to two hundred rupees, or with both.  111.   Disobedience of orders, obstruction and refusal of information.–   Whoever wilfully disobeys any direction lawfully given by any person or authority empowered under this Ordinance to give such direction, or obstructs any person or authority in the discharge of any functions which such person or authority is required or empowered under this Ordinance to discharge, or, being required by or under this Ordinance to supply any information, withholds such information or gives information which he knows to be false or which he does not believe to be true shall, if no other penalty is provided for the offence, be punished with fine which may extend to two hundred rupees.  [170]   [111-A. Penalty of contravention of rules relating to appliances.–   Whoever carries in any motor vehicle any appliance the carrying of which is prohibited by rules made under section 74 shall be punished with fine which may extend to five hundred rupees and such appliance shall be forfeited to Government.]  [171]   [112. Penalty for other offences .– A person who contravenes any provision of this Ordinance or the rules made thereunder shall, if no other penalty is provided for the contravention, be punished with fine which shall not be less than two hundred rupees and which may extend to five hundred rupees, and in case of a transport vehicle, with a fine which shall not be less than five hundred rupees and which may extend to one thousand rupees.]  [172]   [112-A.   Unauthorized use of emergency light or a distinctive sign .– A person who displays a revolving or an emergency light, fabricates or counterfeits a distinctive sign or mark on a motor vehicle in violation of the provisions of this Ordinance, the rules or a notification issued by the Government, shall be punished with imprisonment which may extend to six months or with fine which may extend to one thousand rupees or with both.]  113.   Power of arrest without warrant.–   (1) A police officer in uniform   [173] [or a person authorized by the Government] may arrest without warrant any person who commits in his view an offence punishable under section 99 or section 100 or section 110: Provided that any person so arrested in connection with an offence punishable under section 100 shall be subjected to a medical examination by a registered medical practitioner within two hours of his arrest, and if not so subjected within the said period of two hours shall be released from custody. (2)   A police officer in uniform   [174] [or a person authorized by the Government] may arrest without warrant– ( a ) any person who being required under the provisions of this Ordinance to give his name and address refuses to do so or gives a name and address which the police officer   [175] [or a person authorized by the Government] has reason to believe to be false, or ( b )   any person concerned in an offence under this Ordinance or reasonably suspected to have been so concerned, if the police officer   [176] [or a person authorized by the Government] has reason to believe that he will abscond or otherwise avoid the service of a summons. (3) A police officer   [177] [or a person authorized by the Government] arresting without warrant the driver of a motor vehicle shall, if the circumstances so required, take or cause to be taken any steps he may consider proper for the temporary disposal and safe custody of the vehicle. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 48 of 85   6/2/2011 2:44 PM",
  "114.   Power of police officer to seize documents.–   (1) Any police officer authorised in this behalf or other person authorized in this behalf by Government may, if he has reason to believe that any identification mark carried on a motor vehicle or any licence, permit, certificate of registration, certificate of insurance or other document produced before him by the driver or person in charge of a motor vehicle is a false document within the meaning of section 464 of the Pakistan Penal Code [178] , seize the mark or document and call upon the driver or owner of the vehicle to account for his possession of or the presence in the vehicle of such mark or document. (2)   Any police officer   [179] [or a person] authorized in this behalf by Government may, if he has reason to believe that the driver of a motor vehicle who is charged with any offence under this Ordinance may abscond or otherwise avoid the service of a summons, seize any licence held by such driver, and forward it to the Court taking cognizance of the offence, and the said Court may, on the appearance of such driver before it and on such terms as to security as it may deem fit, return the licence to him, and require him to surrender any temporary acknowledgment given to him under sub-section (3). (3)   A police officer   [180] [or a person] seizing a licence under sub-section (2) shall give to the person surrendering the licence a temporary acknowledgment thereof and such acknowledgment shall authorise the holder to drive any motor vehicle specified in his licence until the licence has been returned to him or up to a date which the police officer shall specify in the temporary acknowledgment whichever is earlier: Provided that where for any cause in respect of which the holder of the licence is not at fault, he is unable to appear in the Court before the temporary acknowledgment ceases to be effective, any magistrate or a police officer   [181] [or a person] authorized by Government in this behalf may, on application made to him, substitute a later date in the temporary acknowledgment given under this sub-section.  115. Power to detain vehicle used without certificate of registration or permit.–   Any police officer authorized in this behalf or other person authorized in this behalf by Government may if he has reason to believe that a motor vehicle has been or is being used in contravention of the provisions of sub-section (1) of section 23 or without the permit required by sub-section (1) of section 44 or in contravention of any condition of such permit relating to the route on which or the area in which or the purpose for which the vehicle may be used, seize and detain the vehicle, and for this purpose take or cause to be taken any steps he may consider proper for the temporary safe custody of the vehicle.  116.   Summary disposal of cases.–   (1) A Court taking cognizance of an offence under this Ordinance shall, unless for reasons to be recorded in writing, the Court directs otherwise or when the offence is an offence specified in Part A of the Fifth Schedule state upon the summons to be served on the accused person that he– ( a ) may appear by pleader and not in person, or ( b )   may by a specified date prior to the hearing of the charge plead guilty to the charge by registered letter and remit to the Court such sum not exceeding seventy-five rupees as the Court may specify. (2) Where the offence dealt with in accordance with sub-section (1) is an offence specified in Part B of the Fifth Schedule, the accused person shall, if he pleads guilty to the charge, forward his licence to the Court with the letter containing his plea in order that the conviction may be endorsed on the licence. (3)   Where an accused person pleads guilty and remits the sum specified and has complied with the provisions of sub-section (2), no further proceedings in respect of the offence shall be taken against him, nor shall he be liable to be disqualified for holding or obtaining a licence by reason of his having pleaded guilty.  [182]   [116-A.   Ticketing System.–   [183] [(1) Notwithstanding anything contained in the Ordinance or any other law, if a person commits an offence mentioned in the Twelfth Schedule, an authorized police officer or a person authorized by the Government may, at the spot, draw a charge against him stating the offence.]  [184] [(2)   The police officer or the authorized person shall draw the charge on five copies of Form-J and shall immediately– (a) deliver three copies of Form-J to the accused and get the acknowledgement; The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 49 of 85   6/2/2011 2:44 PM",
  "(b) forward the fourth copy and the seized document to the bank branch, the post office or the traffic sector office from where the accused may get his document after payment of the fine; and (c) retain the fifth copy in office for record.] (3) A person charged with an offence under this section shall, if he does not want to contest the charge, pay within ten days from the date of delivery of the charge to him under sub-section (2), the penalty specified for the offence in the Twelfth Schedule, as mentioned in the charge, through cash in the notified branch of the bank of the town, or post office or traffic sector office as indicated in the charge.  [185] [(4)   Where the accused pleads guilty and pays the prescribed fine within the specified time, no further proceedings in respect of the offence shall be taken against him.] (5) The bank, post office or the traffic sector office shall retain one copy of the charge for record, send second copy to the treasury and shall hand over the third copy to the depositor.  [186] [(6)   If the fine is not paid within the specified time, the police officer or the authorized person shall file a complaint against the accused before the court of competent jurisdiction.] (7) If during the trial, the offender is found guilty of the offence by the trial court, he shall be convicted to fine double to that mentioned in the charge.]  117.   Restriction on conviction.–   No person prosecuted for an offence punishable under section 99   [187] [* * *] shall be convicted unless– ( a ) he was warned at the time the offence was committed that the question of prosecuting him would be taken into consideration, or ( b )   within fourteen days from the commission of the offence, a notice specifying the nature of the offence and the time and place where it is alleged to have been committed, was served on or sent by registered post to him or the person registered as the owner of the vehicle at the time of the commission of the offence, or ( c )   within twenty-eight days from the commission of the offence, a summons for the offence was served on him: Provided that nothing in this section shall apply where the Court is satisfied that– ( a ) the failure to serve the notice or summons referred to in this sub-section was due to the fact that neither the name and address of the accused nor the name and address of the registered owner of the vehicle could with reasonable diligence have been ascertained in time, or ( b ) such failure was brought about by the conduct of the accused.  118.   Jurisdiction of Courts.–   No Court inferior to that of a magistrate of the second class shall try any offence punishable under this Ordinance or any rules made thereunder.  CHAPTER IX MISCELLANEOUS 119.   Publication of and commencement of rules.–   (1) Every power to make rules given by this Ordinance is subject to the condition of the rules being made after previous publication. (2) All rules made under this Ordinance shall be published in the official Gazette, and shall, unless some later date is appointed, come into force on the date of such publication.  120.   Appointment of motor vehicles officers.–   (1) Government may, for the purpose of carrying into effect the provisions of this Ordinance establish a Motor Vehicles Department and a Transport Department and appoint as officers thereof such persons as it thinks fit. (2)   Every such officer shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code. (3) Government may make rules to regulate the discharge by officers of the Motor Vehicles Department and the Transport Department of their functions, and in particular and without prejudice to the generality of the foregoing power, to prescribe the uniform to be worn by them, the authorities to which they shall be subordinate, the duties to be performed by them, the powers to be exercised by them, and the conditions The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 50 of 85   6/2/2011 2:44 PM",
  "governing the exercise of such powers.  121.   General provisions regarding appeals to prescribed appellate authorities.–   (1) An appeal under sub-section (3) of section 14, sub-section (3) of section 16, sub-section (4) of section 17, sub-section (1) of section 36 or section 66 shall not operate as a stay of the order or proceedings under the order appealed from, except so far as the appellate authority may direct. (2) In an appeal under this Ordinance, the order appealed from shall not be altered or reversed merely on account of any error, omission or irregularity, not materially affecting the merits, in the procedure or order of the original authority.  122. Repeal and savings.–   (1) The enactments specified in the   [188] [Fourteenth] Schedule are hereby repealed to the extent specified against each. (2) Notwithstanding the repeal of the enactments specified in the Twelfth Schedule, everything done, action taken, obligation, liability, penalty or punishment incurred, inquiry or proceeding commenced, officer appointed or person authorised, jurisdiction or power conferred, licence, certificate or permit granted, rule made and order issued under any of the provisions of the said enactments shall, if not inconsistent with the provisions of this Ordinance, continue in force and, so far as may be, be deemed to have been respectively done, taken, incurred, commenced, appointed, authorised, conferred, granted, made or issued under this Ordinance. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 51 of 85   6/2/2011 2:44 PM",
  "THE SCHEDULES ______________ FIRST SCHEDULE FORMS FORM A [SEE SECTION 7 (2)] FORM OF APPLICATION FOR LICENCE TO DRIVE A MOTOR VEHICLE SECTION I APPLICATION  I apply for a licence to enable me to drive as a paid employee *otherwise than as a paid employee vehicles of the following description:- ( a ) motor cycles, ( b ) motor cars, ( c ) invalid carriages, ( d ) motor cabs, ( e ) delivery vans, ( f )   light transport vehicles *including public service vehicle, excluding ( g ) heavy transport vehicles *including public service vehicle, excluding ( h ) tractors, ( i )   road-rollers, ( j )   locomotives, ( k ) a vehicle of a special type (description attached) constructed or adopted to be driven by me.  SECTION II PARTICULARS TO BE FURNISHED BY THE APPLICANT  1.   Full name and name of father___________________________ 2.   Permanent address____________________________________ 3.   Temporary address____________________________________ 4.   Age on the date of the application________________________  [189] [4-A. Identity Card Number__________________________________ ] 5.   Particulars of any licence previously held by applicant________ 6.   Particulars and date of every conviction which has been ordered to be endorsed on any licence held by the applicant. 7.   Have you been disqualified for obtaining a licence to drive. If so give date, testing authority and result of test.  SECTION III DECLARATION AS TO PHYSICAL FITNESS OF APPLICANT  The applicant is required to answer “Yes” or “No” in the space provided opposite each question– ( a ) Do you suffer from epilepsy, or from sudden attacks of disabling giddiness or fainting? ( b )   Are you able to distinguish with each eye at a distance of twenty-five yards in good daylight (with glasses, if worn) a motor car number plate containing seven letters and figures? ( c ) Have you lost either hand or foot or are you suffering from any defect in movement, control, or muscular power of either arm or leg? ( d ) Can you readily distinguish the pigmentary colours red and green? ( e ) Do you suffer from night blindness? ( f )   Do you suffer from a defect of hearing? ( g )   Do you suffer from any other disease or disability likely to cause your driving of a motor vehicle to be source of danger to the public? If so, give particulars. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 52 of 85   6/2/2011 2:44 PM",
  "I declare that to the best of my information and belief the particulars given in Section II and the declaration made in Section III hereof are true.  Note – An applicant who answers “Yes” to questions ( b ) and ( c ) in the declaration and “No” to the other questions may claim to be subjected to a test as to his competency to drive vehicles of a specified type or types. ___________________________  Signature or thumb-impression of applicant  Dated   19  CERTIFICATE OF TEST OF ABILITY TO DRIVE  The applicant has passed/failed in the test specified in the Third Schedule to the   [190] [Provincial] Motor Vehicles Ordinance, 1965. The test was conducted on *________________ at   on (date)  ___________________________ Signature of Testing Authority  ___________________________  Signature or thumb-impression of applicant  * (Here enter description of vehicle).  FORM B [S EE   SECTION 4(2), SECTION 7(3) AND SECTION 15] FORM OF MEDICAL CERTIFICATE IN RESPECT OF AN APPLICANT FOR A LICENCE TO DRIVE ANY TRANSPORT VEHICLE OR TO DRIVE ANY VEHICLE AS A PAID EMPLOYEE  (To be filled up by a registered medical practitioner) 1.   What is the applicant’s apparent age?   ________________ 2.   Is the applicant subject to epilepsy, vertigo or any mental ailment likely to affect his efficiency.   ________________ 3.   Does the applicant suffer from any heart or lung disorder which might interfere with the performance of his duties as a driver ?   ________________ 4.   ( a )   Is there any defect of visions ? If so, has it been corrected by suitable spectacles? ( b ) Can the applicant readily distinguish the pigmentary colours red and green? ( c ) Does the applicant suffer from night blindness?_____________ ( d )   Does the applicant suffer from a degree of deafness which would prevent his hearing the ordinary sound signals?   ________________ 5.   Has the applicant any deformity or loss of members which would interfere with the efficient performance of his duties as a driver? ________________ 6.   Does he show any evidence of being addicted to the excessive use of alcohol, tobacco or drugs?   ________________ 7.   Is he generally fit as regards ( a ) bodily health, and ( b ) eyesight?____ 8.   Marks of identification   ________________ I certify to the best of my knowledge and belief that the applicant ____________________________ is the person herein above described and that the attached photograph is a reasonably correct likeness of the applicant. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 53 of 85   6/2/2011 2:44 PM",
  "Signature______________________ Name_________________________ Designation____________________  Note –   Special attention should be directed to distant vision and to the condition of the arms and hands and the joints of both extremities. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 54 of 85   6/2/2011 2:44 PM",
  "FORM C [S EE   SECTION 8(1)] DRIVING LICENCE  No._______________   19______________________ (Name)___________________________________________________ son/daughter of (father’s name)__________________________________ of (permanent address)_________________________________________ _________________________________________________________  1 The words “if necessary” deleted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  Signature or thumb-impression  is licensed to drive, throughout the Province of   [191] [“_______________ ”] vehicles of the following description:-   name of the Province ( a )   Motor cycle. ( b )   Motor car. ( c )   Motor cab. ( d )   Delivery van. ( e )   Light transport vehicle. ( f )   heavy transport vehicle. ( g )   Locomotive. ( h )   Tractor. ( i )   Invalid carriage. ( j )   Road-roller. ( k )   A motor vehicle hereunder described. He   is   also   authorized   to   drive   as   a   paid   employee.*   This   licence   is   valid   from __________________   to ______________________. (*To be struck out if inapplicable).  Signature and designation Date___________________   19__   of Licensing Authority  Authorisation to drive public service vehicle–   So long as this licence is valid and is renewed from time to time, the holder is authorized to drive a public service vehicle within the Province of   [192] [“__________________”] name of the Province  Signature and designation Date___________________   19__   of Prescribed Authority  This licence is hereby   Signature of renewed up to   Licencing Authority  the__________   day of___________   19   ____________________ the__________   day of___________   19   ____________________ the__________   day of___________   19   ____________________ the__________   day of___________   19   ____________________ the__________   day of___________   19   ____________________  ENDORSEMENTS  Date   Section   Fine or other punishment   Signature of  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 55 of 85   6/2/2011 2:44 PM",
  "and rule   Endorsing Authority  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 56 of 85   6/2/2011 2:44 PM",
  "FORM D [S EE   SECTION 9] FORM OF APPLICATION FOR THE ADDITION OF A NEW CLASS OF VEHICLE TO A DRIVING LICENCE  I hereby apply for the addition of the following class/classes of motor vehicles to the attached licence:- ( a ) Motor cycle. ( b ) Motor car. ( c ) Motor cab. ( d ) Delivery van. ( e ) Light transport vehicle. ( f )   Heavy transport vehicle. ( g ) Locomotive. ( h ) Tractor. ( i )   Road-roller. ( j )   Invalid carriage. ( k ) Motor vehicle of a specified description. *I enclose ( a ) a medical certificate ( b ) three copies of a recent photograph. *(Required only where the applicant is not entitled to drive as a paid employee or a transport vehicle and now wishes to do so).  Date________________   19__   Signature of applicant  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 57 of 85   6/2/2011 2:44 PM",
  "FORM E [S EE   SECTION 12(2)] FORM OF APPLICATION FOR RENEWAL OF DRIVING LICENCE  I hereby apply for a renewal of the licence under the   [193] [Provincial] Motor Vehicles Ordinance, 1965, which was issued to me on the ____ by _____________________ (state title of Licensing Authority). I hereby declare that I am not subject to any disease or disability likely to cause my driving of a motor vehicle to be a source of danger to the public.  Date________________   19__   Signature of applicant  FORM F [S EE S ECTION 25(1)] FORM OF APPLICATION FOR THE REGISTRATION OF MOTOR VEHICLE  1.   Full name, name of father, and address of person to be registered as registered owner ________________________ 2.   Class of vehicle   ________________________ 3.   Type of body   ________________________ 4.   Maker’s name   ________________________ 5.   Year of manufacture   ________________________ 6.   Number of cylinders   ________________________ 7.   Horse power   ________________________ 8.   Maker’s classification or, if not known, wheel-base____________ 9.   Chassis number   ________________________ 10.   Engine number   ________________________ 11.   Seating capacity (including driver)   ________________________ 12.   Unladen weight   ________________________ 13.   Particular of previous registration and registered No.(if any)_____  Additional particulars to be completed only in the case of transport vehicles other than motor cabs  14.   Number, description and size of tyres– ( a ) front axle_____________________ ( b ) rear axle______________________ ( c ) any other axle__________________ 15.   Maximum laden weight________________ lbs. 16.   Maximum axle weight– ( a ) front axle________________________ lbs. ( b ) rear axle_________________________ lbs. ( c ) any other axle_____________________ lbs. The above particulars to be filled in for a rigid frame motor vehicle of two or of three axles, for a semi-trailer of an articulated vehicle of three axles or to the extent applicable, for a trailer (other than the trailer to be registered as part of an articulated vehicle), as the case may be. Where, a second trailer or additional trailers are to be registered with an articulated motor vehicle, the following particulars are to be furnished for each such trailer:- 17.   Type of body__________________________________________ 18.   Unladen weight________________________________________ 19.   Number, description and size of tyres or the axle______________ 20.   Maximum axle weight___________________________________ The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 58 of 85   6/2/2011 2:44 PM",
  "Date________________   19__   Signature of applicant Explanation – An articulated vehicle means a tractor to which a trailer is attached in such a manner that part of the trailer is superimposed on and part of the weight of the trailer is borne by the tractor.  Note –   The motor vehicle above described is held by the person to be registered as the registered owner, under a hire-purchase agreement with__ . __________________  Signature of owner  _______________________________  Signature of Hire-Purchase Company  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 59 of 85   6/2/2011 2:44 PM",
  "FORM G [S EE   SECTIONS 25(2) AND 41(2)] FORM OF CERTIFICATE OF REGISTRATION  Registered Number_________________ Brief description of vehicle________________________________ ( e.g. , Ford touring car, Chevrolet 32 seater bus, Albion lorry, trailer, etc). Name, name of father, and address of Registered owner________________________________________  Signature of Registering Authority  Transferred to   Signature of Registering Authority  Transferred to   Signature of Registering Authority  Detailed Description  1.   Class of vehicle___________________________________________ 2.   Maker’s name_____________________________________________ 3.   Type of body_____________________________________________ 4.   Year of manufacture_______________________________________ 5.   Number of cylinders_______________________________________ 6.   Chassis Number___________________________________________ 7.   Engine Number___________________________________________ 8.   Horse power______________________________________________ 9.   Maker’s classification or, if not known, wheel base_______________ 10.   Seating capacity (including driver)____________________________ 11.   Unladen weight___________________________________________  Additional particulars in the case of all transport vehicles other than motor cabs–  12.   Registered laden weight____________________________________ 13.   Number, description and size of tyres__________________________ ( a ) front axle_____________________________________________ ( b ) rear axle______________________________________________ ( c ) any other axle__________________________________________ 14.   Registered axle weight– ( a ) front axle__________________________________________ lbs. ( b ) rear axle___________________________________________ lbs. ( c ) any other axle_______________________________________ lbs.  Additional particulars of alternative or additional trailer or trailers registered with an articulated vehicle–  15.   Type of body_____________________________________________ 16.   Unladen weight___________________________________________ 17.   Number, description and size of tyres on the axle_________________ 18.   Registered axle weight___________ lbs.  Date________________   19__   Signature of Registering Authority Note–   The motor vehicle above described is held by the person registered as the registered owner under a hire-purchase agreement with _______.  Date________________   19__   Signature of  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 60 of 85   6/2/2011 2:44 PM",
  "Registering Authority  FORM H [S EE   SECTION 37] DOCUMENT TO BE FURNISHED BY THE MAKER OR AUTHORISED ASSEMBLER IN THE CASE OF TRANSPORT VEHICLES OTHER THAN MOTOR CABS  Certified that the vehicle Chassis No. ______________ and Engine No.________ manufactured by____________ in the year __________ has a wheel base of _________and is designed for maximum weights as follows when fitted with the tyre-equipment specified below:- Maximum laden weight_________________ lbs. Maximum weight front axle_____________ lbs. Maximum weight rear axle______________ lbs. Maximum weight any other axle__________ lbs. Tyres– Front wheels___________________________ Rear wheels____________________________ Other wheels___________________________  Date________________   19__   Signature of maker or authorised assembler  Special certificate to be furnished by an assembler–  Certified that I am authorised by the maker of the vehicle described above to issue this certificate.  Signature of authorized assembler  FORM I [S EE   SECTIONS 39(1) AND 40(2)] CERTIFICATE OF FITNESS (APPLICABLE IN THE CASE OF TRANSPORT VEHICLES ONLY)  Vehicle No_________________   is certified as complying with the provisions of Chapter VI of the  [194] [Provincial] Motor Vehicles Ordinance, 1965, and the rules made thereunder. The certificate will expire on  Date________________   19__   Signature and Designation of Inspecting Authority  The certificate of fitness is hereby renewed:- Upto _____________________   19____________________________  Signature of Inspecting Authority  Upto _____________________   19____________________________  Signature of Inspecting Authority  Upto _____________________   19____________________________  Signature of Inspecting Authority  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 61 of 85   6/2/2011 2:44 PM",
  "[195]   [PUNJAB TRAFFIC POLICE  Form “J”  District_______________  Ticket No.   Book No. Name of Traffic Sector____________   Date and time______________ Offender’s Name_____________________________________________ Address_____________________________________________________ Registration No. of Vehicle_________   Violation code_______________ Document seized______________________________________________ Signature of offender___________   Ticket Issuing Officer____________  1.   The offender is to deposit the prescribed fine at any notified branch of the Bank of Punjab of the town within 10 days failing which he shall be prosecuted in the court of _______________________________________ 2.   If the offender is found guilty by the court, he shall be convicted to fine double to that mentioned in this charge.  FOR BANK USE ONLY  Received Rs.________   (in words)___________________________ Signature  [196] [Form K]  [*   *   *   *   *   *   *   *   *   *   *   *   *   *]  SECOND SCHEDULE [( See   Section 7(5)] I.   Disease and disabilities absolutely disqualifying a person for obtaining a licence to drive a motor vehicle.  1.   Epilepsy. 2.   Lunacy. 3.   Heart disease likely to produce sudden attack of giddiness or fainting. 4.   Inability to distinguish with each eye at a distance of twenty-five yards in good daylight (with the aid of glasses, if worn) a series of seven letters and figures in white on a black ground of the same size and arrangement as those of the registration mark of a motor car. 5.   A degree of deafness which prevents the applicant from hearing, without hearing aids, the ordinary sound signals. 6.   Colour blindness or inability readily to distinguish the pigmentary colours red and green. 7.   Night blindness. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 62 of 85   6/2/2011 2:44 PM",
  "II.   Diseases and disabilities absolutely disqualifying a person for obtaining a licence to drive a public service vehicle.  1.   Leprosy. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 63 of 85   6/2/2011 2:44 PM",
  "THIRD SCHEDULE [S EE   SECTIONS 7(6) AND 18(5)] TEST OF COMPETENCE TO DRIVE PART I  The candidate shall satisfy the person conducting the test that he is able to– (1) start the engine of the vehicle; (2) move away straight ahead or at an angle; (3) overtake, meet or cover the path of other vehicle and take an appropriate course; (4) turn right and left corners correctly; (5)   stop the vehicle in an emergency and normally, and in the latter case bring to rest at an appropriate part of the road; (6) drive the vehicle backwards and whilst so doing enter a limited opening either to the right or left; (7) cause the vehicle to face in the opposite direction by means of forward and reverse gears; (8) give by hand and by mechanical means (if fitted to the vehicle) or in the case of a disabled driver for whom it is impracticable or undesirable to give signals by hand, by mechanical means in a clear and unmistakable manner, appropriate signals at appropriate times to indicate his intended actions; (9)   act correctly and promptly on all signals given by traffic signs and traffic controllers, and take appropriate action on signs given by other road users.  Note –   ( i ) Requirements 6 and 7 are not applicable in the case of a motor cycle or tricycle not equipped with means for reversing. ( ii ) Requirements 6, 7 and 8 are not applicable in the case of invalid carriages. A candidate shall be deemed to have failed in the test, if during a road test, he does any three or more of the following acts or any one of such acts more than once:-  A.   Starting–  (1) Fails to look around before starting. (2) Noisy and uncertain gear shifting. (3) Stays too long in low or second gear. (4) unnecessary fast get away. (5) Stalls motor. (6) Fails to signal.  B.   Stopping–  (1) Fails to signal. (2) Slows down too suddenly. (3) Fails to use rear-view mirror.  C. Turning–  (1) Fails to get into proper lane in time. (2) Fails to signal. (3) Fails to check traffic. (4) Swings wide to the right or cuts corners to the left. (5) Fails to complete turn in proper lane.  D. Backing–  (1) Fails to look behind before and while backing. (2) Uncertain steering when backing.  E.   Parking–  (1) Hits with a jolt other cars in parking. (2) Climbs curb in parking. (3) Parks too far from curb. (4) Forgets to set emergency brake. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 64 of 85   6/2/2011 2:44 PM",
  "(5) Parks too fast for proper control.  F.   Traffic Signals – (1) Fails to notice signals. (2) Runs through a stop signal.  G. Signs–  (1) Does not come to a stop on a signal or at a sign requiring him to do so. (2) Does not notice caution or warning signs. (3) Fails to observe direction signs.  H. Passing – (1) Does not await clear distance ahead. (2) Passes a vehicle in intersection when unlawful or dangerous to do so. (3) Passes vehicle on right where unlawful. (4) Fails to use born when necessary. (5) Too little speed in overtaking. (6) Cuts in too quickly ahead.  I.   Hills – (1) Cannot shift gears on an upgrade or when going down. (2) Cannot stop and start on hill without rolling backward. (3) Descends in neutral.  J.   Speed–  (1) Drives at speeds greater than ability warrants. (2) Too fast over rough roads, around corners, through blind intersections and in business districts. (3) Tendency to lag and catch up. (4) Slows down while passing through an intersection or around a curve, rather than before reaching. (5) hinders traffic by driving slowly in centre of street.  K. Attention–  (1) Looks down when shifting gears. (2) Turns his head when talking. (3) Fails to notice dangerous spots. (4) Does not give complete attention to all traffic intersection.  L.   Attitude towards others–  (1) Depends on others for safety. (2) Takes right of way at intersection when not entitled thereto. (3) Inconsiderate to pedestrians. (4) Fails to anticipate what others may do.  M. Miscellaneous–  (1) Stalls at intersections. (2) Fails to keep in correct lane. (3) Follows too closely other vehicles. (4) uses horn too much. (5) Shifts into wrong gear, such as reverse instead of second. (6) Passes standing street cars where unlawful. (7) Speeds up when being overtaken. (8) Reacts slowly in emergency. (9) Careless about using proper hand signals or does not make signals clearly. (10) Unduly nervous. (11) Over-cautious. (12) Reckless or careless. (13) General inexperience. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 65 of 85   6/2/2011 2:44 PM",
  "PART II (TEST OF TRAFFIC LAWS AND CORRECT ROAD BEHAVIOUR OF APPLICANT)  The candidate shall satisfy the Examiner that he is cognizant of the provisions of sections 85,86,87,88 and 89 and of the Tenth Schedule, that he knows the meaning of the traffic signs specified in the Ninth Schedule and the general provisions of the Highway Code.  PART III (TEST OF PHYSICAL FITNESS)  The candidate shall satisfy the Examiner that he is not subject to any disease or disability likely to cause his driving of a motor vehicle to be a source of danger to the public and particularly that– ( a ) he can read from a distance of twenty-five yards a registration plate bearing letters and figures three inches high or decipher other similar letters or figures of the same size from a distance of twenty-five yards with or without spectacles; ( b ) his field of vision is not less than 130 degree; ( c ) he can readily distinguish colours, red and green; ( d ) he can hear ordinary sound signals without the help of hearing aid; ( e ) he is not suffering from epilepsy, paralysis, serious heart disorders or mental disorders. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 66 of 85   6/2/2011 2:44 PM",
  "FOURTH SCHEDULE [S EE   SECTIONS 15(1) AND 40(1) AND (3)] AUTHORITIES ENTITLED TO GRANT LICENCE TO DRIVE AND TO REGISTER MOTOR VEHICLES, THE PROPERTY OR FOR THE TIME BEING UNDER THE EXCLUSIVE CONTROL OF THE   [197]   [FEDERAL] GOVERNMENT, AND REGISTRATION MARK FOR SUCH VEHICLES PART A  The authorities specified in the second column may grant licences in respect of Vehicles, the property or for the time being under the exclusive control of the Department of the   [198] [Federal] Government specified in the first column. Defence Department of the   1.   District Commanders.  [199] [Federal] Government.   2.   Commanders of independent brigades. 3.   Officers commanding units having mechanically propelled vehicles in their charge. 4.   Commanders, Pakistan Engineers.  PART B  The authorities specified in the second column may register motor vehicles the property or for the time being under the exclusive control of the Department of the   [200] [Federal] Government specified in the first column and may grant certificates of fitness in respect of such vehicles. Defence Department of the   The Master-General of the Ordinance  [201] [Federal] Government.   in Pakistan or any person authorized by him in this behalf.  PART C  Registration mark for vehicles registered under section 40  A broad arrow followed by not more than six figures, or a broad arrow followed by a single letter and not more than five figures. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 67 of 85   6/2/2011 2:44 PM",
  "FIFTH SCHEDULE [S EE   SECTIONS 20(2) AND (3) AND 116] OFFENCES ON CONVICTION OF WHICH AN ENDORSEMENT SHALL BE MADE ON THE LICENCE OF THE PERSON AFFECTED PART A  1.   Driving when disqualified (section 19). 2.   Failing to stop on the occurrence of an accident (section 92). 3.   Obtaining or applying for a licence without giving particulars of endorsement (section 97). 4.   Driving recklessly or dangerously (section 99). 5.   Driving while drunk or under the influence of any drug (section 100). 6.   Abetment of an offence under section 99 or section 100. 7.   Taking part in unauthorised race or trial or speed (section 103). 8.   Altering a licence or using an altered licence. 9.   Any offence punishable with imprisonment in the commission of which a motor vehicle was used.  PART B  1. Driving without a licence, or without a licence which is effective, or without a licence applicable to the vehicle driven (section 3). 2. Allowing a licence to be used by another person (section 6). 3. Driving at excessive speed (section 98). 4. Driving when mentally or physically unfit to drive (section 101). 5. Abetment of an offence punishable under section 98 or 101. 6. Refusing or failing within specified time to produce licence (section 90). 7. Failing to stop when required (section 92). 8. Driving an unregistered vehicle (section 23). 9. Driving a transport vehicle not covered by a certificate of fitness (section 39). 10. Driving in contravention of any rule made under section 74 (2) ( g ) relating to speed governors. 11. Driving a vehicle exceeding the permissible limit of weight (section 107). 12. Failure to comply with a requisition made under section 77. 13. Using a vehicle in unsafe condition (section 104). 14. Driving a transport vehicle in contravention of section 44. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 68 of 85   6/2/2011 2:44 PM",
  "SIXTH SCHEDULE REGULATION MARKS [ Omitted by Ordinance XXXVI of   1981] SEVENTH SCHEDULE [ See   Section 41] REGISTRATION MARKS FOR VEHICLES REGISTERED UNDER SECTION 41 [ Deleted by West Pakistan Ordinance XXXIX of   1965] [202]   [EIGHTH SCHEDULE [ See   Section 75] LIMITS OF SPEED FOR MOTOR VEHICLES  Class of vehicles   Maximum speed in kilometers per hour  1.   Passengers vehicles, that is to say, vehicles constructed solely for the carriage of passengers and their effects. ( a )   if all the wheels are fitted with pneumatic tyres and the vehicle is not drawing a trailer– ( i ) if the vehicle is a motor car   95 ( ii ) if the vehicle is a motor-cycle   70 ( iii ) if the vehicle is a motor-cab   80 ( iv )   if the vehicle is a public service vehicle, other than motor-cab, capable of carrying not more than 14 passengers excluding driver. 70 ( v )   if the vehicle is a public service vehicle capable of carrying more than 14 passengers excluding driver. 65 ( b )   if the vehicle, being motor-car or motor-cab, is drawing a two-wheeled trailer or a laden weight not exceeding 800 kilograms, and if all the wheels of the vehicle are fitted with pneumatic tyres. 50 ( c )   any other vehicle, including rickshaw and an invalid carriage.   30 2.   Goods vehicles, that is to say, vehicles constructed or adapted for use or used for the conveyance of goods– ( a )   if all the wheels are fitted with pneumatic tyres and the vehicle is a delivery van and is not drawing a trailer. 80 ( b )   if all the wheels are fitted with pneumatic tyres and the registered laden weight of the vehicle does not exceed 10200 kilograms and the vehicle is not drawing a trailer. 50 ( c )   in any other case   25 3.   Tractors– ( a )   if drawing not more than one trailer and all the wheels of the tractor and trailer are fitted with pneumatic tyres. 25 ( b )   in any other case   10 4.   Locomotives, whether drawing a trailer or not   10]  [203]   [NINTH SCHEDULE  See   Section 79, 81 & 82 TRAFFIC SIGNS  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 69 of 85   6/2/2011 2:44 PM",
  "WARNING SIGNS  1.   LEFT BEND. 2.   RIGHT BEND. 3.   DOUBLE BEND TO THE RIGHT. 4.   DOUBLE BEND TO THE LEFT. 5.   DANGEROUS DESCENT. 6.   STEEP ASCENT. 7.   CARRIAGEWAY NARROWS. 8.   SWING BRIDGE. 9.   ROAD LEADS ON TO QUAY OR RIVER BANK. 10.   UN-EVEN ROAD. 11.   HUMP/SPEED BREAKER. 12.   ROAD DIPS. 13.   SLIPPERY ROAD. 14.   LOOSE GRAVEL. 15.   FALLING ROCK. 16.   PEDESTRIAN CROSSING. 17.   CHILDREN CROSSING. 18.   CYCLISTS. 19.   CATTLE CROSSING. 20.   WILD ANIMAL CROSSING. 21.   ROAD WORKS. 22.   LIGHT SIGNALS. 23.   LOW FLYING AIRCRAFTS. 24.   STRONG CROSS WIND. 25.   TWO WAY TRAFFIC. 26.   OTHER DANGERS. 27.   YIELD TO THE TRAFFIC APPROACHING FROM THE RIGHT ON THE CROSS ROAD 28.   YIELD TO THE TRAFFIC APPROACHING FROM THE RIGHT ON ANY LEG OF THE INTERSECTION. 29.   MINOR CROSS ROAD. 30.   MINOR CROSS ROAD FROM LEFT. 31.   MINOR CROSS ROAD FROM RIGHT. 32.   MINOR CROSS ROADS FROM RIGHT & LEFT RESPECTIVELY . 33.   MINOR CROSS ROADS FROM LEFT & RIGHT RESPECTIVELY . 34.   MINOR CROSS JOINING FROM RIGHT. 35.   MINOR CROSS JOINING FROM LEFT. 36.   MINOR ROAD ON THE RIGHT. 37.   MINOR ROAD ON THE LEFT. 38.   MAJOR CROSS ROAD. 39.   NARROW BRIDGE. 40.   LEVEL CROSSING [NO GATE] 41.   LEVEL CROSSING (WITH GATE) 42.   ADVANCE DANGER SIGN. 43.   ROUND ABOUT AHEAD. 44.   U.TURN AHEAD.  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 70 of 85   6/2/2011 2:44 PM",
  "PART II REGULATORY SIGNS  45.   GIVE WAY SIGN. 46.   STOP SIGN. 47.   SLOW SIGN. 48.   ROAD CLOSED. 49.   NO ENTRY FOR MOTOR VEHICLE. 50.   NO ENTRY . 51.   NO ENTRY FOR CYCLES. 52.   NO ENTRY FOR MOTOR CYCLES. 53.   NO ENTRY FOR GOODS VEHICLES. 54.   NO ENTRY FOR PEDESTRIANS. 55.   NO ENTRY FOR ANIMAL DRAWN VEHICLES. 56.   NO ENTRY FOR HAND CARTS. 57.   NO ENTRY FOR AGRICULTURAL VEHICLES. 58.   NO ENTRY FOR VEHICLES EXCEEDING WIDTH MORE THAN 8-6\". 59.   NO ENTRY FOR VEHICLES EXCEEDING HEIGHT MORE THAN 16-6\". 60.   NO ENTRY FOR VEHICLES EXCEEDING 7 TON LADEN WEIGHT. 61.   NO ENTRY FOR VEHICLES EXCEEDING 6 TON ON ONE AXLE. 62.   NO ENTRY FOR VEHICLES EXCEEDING 30 FEET IN LENGTH. 63.   NO LEFT TURN. 64.   NO RIGHT TURN. 65.   NO U TURN. 66.   OVERTAKING PROHIBITED. 67.   OVERTAKING BY GOODS VEHICLES PROHIBITED. 68.   MAX SPEED LIMIT 50 KM. 69.   AUDIBLE WARNING DEVICES PROHIBITED. 70.   PASSING WITHOUT STOPPING PROHIBITED. 71.   PASSING WITHOUT STOPPING PORHIBITED. 72.   PARKING PROHIBITED. 73.   ONE OF ALL PROHIBITIONS IMPOSED. 74.   END OF SPEED LIMIT IMPOSED. 75.   END OF PROHIBITIONS OF OVERTAKING.  PART III MANDATORY SIGNS  76.   DIRECTION TO BE FOLLOWED. 77.   DIRECTION TO BE FOLLOWED. 78.   DIRECTION TO BE FOLLOWED. 79.   DIRECTION TO BE FOLLOWED. 80.   DIRECTION TO BE FOLLOWED. 81.   DIRECTION TO BE FOLLOWED. 82.   DIRECTION TO BE FOLLOWED. 83.   KEEP TO THE RIGHT. 84.   KEEP TO THE LEFT. 85.   COMPULSORY ROUND ABOUT. 86.   LANE CONTROL SIGN. 87.   LANE CONTROL SIGN. 88.   DUAL CARRIAGEWAY AHEAD. 89.   DUAL CARRIAGEWAY END. 90.   COMPULSORY CYCLE TRACK.  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 71 of 85   6/2/2011 2:44 PM",
  "PART IV INFORMATIVE SIGNS  91.   ADVANCE DIRECTION SIGN. 92.   NO THROUGH ROAD. 93.   NO THROUGH ROAD. 94.   NO THROUGH ROAD. 95.   DIRECTION OF PLACE. 96.   DIRECTION OF AIRFIELD. 97.   BEGINING OF BUILT UP AREA. 98.   END OF BUILT UP AREA. 99.   HOSPITAL. 100.   ONE WAY ROAD. 101.   ONE WAY ROAD. 102.   BUS STOP. 103.   TRAMWAY STOP. 104.   PARKING. 105.   PARKING PLACE INDICATED. 106.   PARKING PLACE INDICATED. 107.   PARKING PLACE INDICATED. 108.   PARKING PLACE INDICATED. 109.   PARKING PLACE INDICATED. 110.   FACILITY INDICATED. 111.   FIRST AID STATION. 112.   BREAKDOWN SERVICE. 113.   TELEPHONE. 114.   FILLING STATION. 115.   HOTEL OR MOTEL. 116.   RESTAURANT. 117.   CAFETERIA. 118.   PICNIC SITE. 119.   STARTING POINTS FOR WALK. 120.   CAMPING SITE. 121.   SAMPING SITE. 122.   CAMPING AND CARAWAN SITE. 123.   YOUTH HOSTEL. 124.   MOTOR WAY . 125.   END OF MOTOR WAY .  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 72 of 85   6/2/2011 2:44 PM",
  "ROAD MARKING  The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 73 of 85   6/2/2011 2:44 PM",
  "TENTH SCHEDULE Sections 81 and 82] DRIVING REGULATIONS  1.   The driver of a motor vehicle shall drive the vehicle as close to the left hand side of the road as may be expedient, and shall allow all traffic which is proceeding in the opposite direction to pass him on his right hand side. 2.   Except as provided in regulation 3, the driver of a motor vehicle shall pass to the right of all traffic proceeding in the same direction as himself. 3.   The driver of a motor vehicle may pass to the left of a vehicle the driver of which having indicated an intention to turn to the right has drawn to the centre of the road and may pass a tram-car or other vehicle running on fixed rails, whether travelling in the same direction as himself or otherwise, on either side: Provided that in no case shall he pass a tram-car at a time or in a manner likely to cause danger or inconvenience to other users of the road or pass on the left hand side of a tram-car, which, when in motion would be travelling in the same direction as himself, while the tram-car is at a rest for the purpose of setting down or taking up passengers. 4.   The driver of a motor vehicle shall not pass a vehicle travelling in the same direction as himself– ( a ) if his passing is likely to cause inconvenience or danger to other traffic proceeding in any direction; or ( b )   where a point or corner or a hill or an obstruction of any kind renders the road ahead not clearly visible. 5.   The driver of a motor vehicle shall not, when being overtaken or being passed by another vehicle, increase speed or do anything in any way to prevent the other vehicle from passing him. 6.   The driver of a motor vehicle shall slow down when approaching a road intersection, a road corner, and shall not enter any such intersection or junction until he has become aware that he may do so without endangering the safety of persons thereon. 7.   The driver of a motor vehicle shall on entering a road intersection if the road entered is a main road designated as such, give way to the vehicles proceeding along that road, and in any other case give way to all traffic approaching the intersection on his right hand. 8.   The driver of a motor vehicle shall, when passing or meeting a procession or a body of troops or police on the march or when passing workmen engaged on road repair, drive at a speed not greater than fifteen miles an hour. 9.   The driver of a motor vehicle shall– ( a )   when turning to the left, drive as close as may be to the left hand side of the road from which he is making the turn and of the road which he is entering; ( b ) when turning to the right, draw as near as may be to the centre of the road along which he is travelling and cause the vehicle to move in such a manner that– ( i ) as far as may be practicable, it passes beyond, and so to leave on the driver’s right hand, a point formed by the intersection of the centre lines of the intersection roads, and ( ii ) it arrives as near as may be at the left hand side of the road which the driver is entering. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 74 of 85   6/2/2011 2:44 PM",
  "ELEVENTH SCHEDULE [ See   Section 83] SIGNALS  1.   When about to turn to the right or to drive to the right hand side of the road in order to pass another vehicle or for any other purpose, a driver shall extend his right arm in a horizontal position outside of and to right of his vehicle with the palm of the hand turned to the front. 2.   When about to turn to the left or to drive to the left hand side of the road, a driver shall extend his right arm and rotate it in an anti-clockwise direction. 3.   When about to slow down, a driver shall extend his right arm with the palm downward and to the right of the vehicle and shall move the arm so extended up and down several times in such a manner that the signals can be seen by the driver of any vehicle which may be behind him. 4.   When about to stop, a driver shall raise his right forearm vertically outside of and to the right of the vehicle, palm to the front. 5.   When a driver wishes to indicate to the driver of a vehicle behind him that he desires that driver to overtake him, he shall extend his right arm and hand horizontally outside of and to the right of the vehicle and shall swing the arm backwards and forwards in a semi-circular motion. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 75 of 85   6/2/2011 2:44 PM",
  "[204]   [TWELFTH SCHEDULE VIOLATIONS AND PENALTIES CODE NO.   VIOLATIONS FINES Private Vehicles   Commercial/Public Service Vehicles Motor Cycle/ Scooter Motor Car/Jeep etc. Motorcab/Motorcycle Rickshaw & Tractor (Agri) All Other Vehicles  1.   Exceeding prescribed speed limit   Rs. 100   Rs. 300   Rs. 100   Rs. 300 2.   Carrying passengers in a public service vehicle exceeding permissible limit   –   –   Rs. 100   Rs. 300 3.   Violation of traffic signals (electronic or manual) Rs. 200   Rs. 300   Rs. 200   Rs. 400 4.   Overloading a goods vehicle   –   –   Rs. 100   Rs. 400 5.   Driving a motor vehicle at night without proper lights Rs. 100   Rs. 200   Rs. 200   Rs. 300 6.   Driving a motor vehicle on the wrong side of the road Rs. 100   Rs. 300   Rs. 100   Rs. 300 7.   Driving a motor vehicle with tinted/covered glasses   –   Rs. 300 and removal Rs. 300 and removal Rs. 300 and removal 8.   Violation of line/lane/ zebra crossing etc.   Rs. 100   Rs. 200   Rs. 100   Rs. 200 9.   Plying a motor vehicle where and when prohibited. Rs. 100   Rs. 200   Rs. 300   Rs. 300 10.   Obstructing traffic   Rs. 100   Rs. 200   Rs. 200   Rs. 300 11.   Reckless and negligent driving   Rs. 200   Rs. 300   Rs. 300   Rs. 400 12.   Driving a motor vehicle without a driving licence Rs. 100   Rs. 200   Rs. 200   Rs. 400 13.   Using a pressure horn, musical horn or using any other horn in a silence zone Rs. 100   Rs. 200   Rs. 100   Rs. 300 14.   Emitting excessive smoke   Rs. 100   Rs. 200   Rs. 200   Rs. 300 15.   Driving an unregistered motor vehicle   Rs. 200   Rs. 300   Rs. 300   Rs. 500 16.   Driving in violation of age limit   Rs. 200   Rs. 300   Rs. 300   Rs. 400 17.   Driving a motor vehicle without fitness certificate   –   –   Rs. 300   Rs. 400 and impounding of the Vehicle till the Production of fitness certificate. 18.   Driving without or in violation of conditions of route permit   –   –   Rs. 300   Rs. 500 and impounding of the Vehicle till the Production of route permit. 19.   Riding a two wheel motor cycle without crash helmet Rs. 100   –   –   – 20.   Pillion riding by more than two persons   Rs. 200   –   –   – 21.   Use of hand–held mobile phone while driving   Rs. 100   Rs. 300   Rs. 200   Rs. 400 22.   Non–fastening of seatbelt while driving on a notified road   –   Rs. 200   Rs. 200   Rs. 300 23.   Violation of parking rules   Rs. 100   Rs. 300   Rs. 200   Rs. 300 24.   Violation of any other provision of the Ordinance or the rules made thereunder punishable under section 112 Rs. 100   Rs. 200   Rs. 200   Rs. 300 Provincial Motor Vehicles Ordinance, 196   5   http://punjablaws.gov.pk/laws/189.html 76 of 85   6/2/2011 2:44 PM",
  "[205]   [THIRTEENTH SCHEDULE  [see sections 50, 53 and 67] Scale of compensation payable on death or injury to a passenger in a stage carriage or contract carriage  Sr. No.   Death or injury   Amount of compensation in rupees  1.   Death   2,50,000 2.   Loss of arm at or above the elbow   65,000 3.   Loss of arm below the elbow   50,000 4.   Loss of leg at or above the knee   65,000 5.   Loss of leg below the knee   60,000 6.   Loss of both legs   1,40,000 7.   Permanent loss of hearing   65,000 8.   Loss of one eye   75,000 9.   Loss of both eyes   1,40,000 10.   Loss of thumb   40,000 11.   Loss of all finger of one foot   50,000 12.   Loss of index finger   40,000 13.   Loss of great toe   38,000 14.   Loss of any finger other than index finger   38,000 15.   Permanent disfiguration of the face or head   50,000 16.   Fracture or dislocation of a bone   40,000 17.   Emasculation   50,000 18.   Loss of one tooth   12,500 19.   Loss of two or more teeth   25,000 20.   Any injury which endangers life or which causes the sufferer to be, during the space of twenty days, serve bodily pain, or renders him unable to follow his ordinary pursuits 25,000 21.   An injury not specified above   10,000 22.   Maximum limit of compensation payable for more than one injuries   1,40,000] The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 77 of 85   6/2/2011 2:44 PM",
  "[206]   [FOURTEENTH] SCHEDULE [ See   SECTION 122] ENACTMENTS REPEALED Serial No.   Short title   No. and year   Extent of repeal  1.   The Motor Vehicles Act, 1939   IV of 1939.   The whole, except Chapters VII and VIII and section 125. 2.   The Motor Vehicles (Sind Amendment) Act, 1948.   Sind XIV of 1948.   The whole. 3.   The Motor Vehicles (North-West Frontier Amendment) Act, 1950. N.W.F.P. XII of 1950.   The whole. 4.   The Motor Vehicles (Sind Amendment) Act, 1951.   Sind XVIII of 1951.   The whole 5.   The Motor Vehicles (North-West Frontier Province (Amendment) Act, 1953. N.W.F.P. VIII of 1953.   The whole 6.   The Motor Vehicles (West Pakistan Amendment) Act, 1958.   West Pakistan XIX of 1958. The whole 7.   The Motor Vehicles (West Pakistan Amendment) Ordinance, 1960. West Pakistan Ordinance XXX of 1960. The whole 8.   The Motor Vehicles (West Pakistan Amendment) Ordinance, 1963. West Pakistan Ordinance XI of 1963. The whole  [1] This Ordinance was promulgated by the Governor of West Pakistan on 8th June, 1965; approved by the Provincial Assembly of West Pakistan on 10th July, 1965, under clause (3) of Article 79 of the Constitution of the Islamic Republic of Pakistan (1962); and, published in the West Pakistan Gazette (Extraordinary), dated 10th July, 1965, pages 3721-3829.  [2] Substituted, for “West Pakistan”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [3] Ibid.  [4] Substituted   ibid. , for “the Province of West Pakistan, except the Tribal Areas”.  [5] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Corporation”.  [6] Substituted   ibid. , for “Road Transport Corporation”.  [7] Substituted for “Government of West Pakistan”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [8]  Inserted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [9] Inserted by the Punjab Finance Ordinance, 2002 (XXXVII of 2002). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution.  [10] VII of 1913.  [11] XXI of 1860.  [12] Inserted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1971 (XXII of 1971).  [13] XXI of 1860.  [14]  The words “other than a locomotive or tractor used solely for agricultural purposes”, deleted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [15] Re-numbered   ibid.  [16] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [17]  Substituted, for the words “as a paid employee and every application for a licence to drive a transport vehicle”, by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978). The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 78 of 85   6/2/2011 2:44 PM",
  "[18] Substituted   ibid. , for the words “a Class I Officer of Government”.  [19] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [20] The words “in the case of a licence to drive as a paid employee or to drive a transport vehicle”, deleted   ibid .  [21] Substituted, for the full-stop, by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [22] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978) .  [23] Substituted, for “Central”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [24] Ibid.  [25] Ibid.  [26] Inserted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [27] Substituted, for the words “public place or in any other place for the purpose of carrying passengers or goods”, by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [28] Substituted for the word “division” by the Provincial Motor Vehicles (Second Amendment) Ordinance, 2001 (XXXI of 2001). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution.  [29] Substituted for sub-sections (3) and (4), by the Provincial Motor Vehicles (Amendment) Ordinance, 1981 (XXXVI of 1981). Sub-section (3) was again substituted by the Provincial Motor Vehicles (Second Amendment) Ordinance 1999 (XXXVIII of 1999). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution.  [30] Substituted for the word “fee” by the Provincial Motor Vehicles (Second Amendment) Ordinance 1999 (XXXVIII of 1999). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution.  [31] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XVI of 2009). This Act was originally promulgated as Ordinance XXV of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XVI of 2009.  [32] Inserted   ibid .  [33] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XVI of 2009). This Act was originally promulgated as Ordinance XXV of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XVI of 2009.  [34] Section 30 “Assignment of fresh registration mark on removal to another Province” omitted   ibid .  [35] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [36] Now “Punjab”,   see   the Punjab Laws (Adaptation) Order, 1974 (Pb. A.O. 1 of 1974).  [37] West Pakistan XXXII of 1958.  [38] Substituted, for the words “prescribed authority”, by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [39] Substituted   ibid. , for the full-stop.  [40] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970) .  [41]  The words “issuing authority or other”, deleted   ibid.  [42] Substituted, for “Central”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [43] Ibid.  [44]  Ibid.  [45] Ibid . The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 79 of 85   6/2/2011 2:44 PM",
  "[46] Substituted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1965 (XXXIX of 1965).  [47] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [48] Substituted, for “Central”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [49] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1971 (XXII of 1971).  [50] Now “Punjab”,   see   the Punjab Laws (Adaptation) Order, 1974 (Pb. A.O. 1 of 1974).  [51] Inserted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [52] Substituted, for the words “number of [Government officers]”, by the Provincial Motor Vehicles (Amendment) Ordinance, 1999 (XLVI of 1999). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution. The words “Government Officers” had earlier been substituted for the words “officials and non-officials” by the West Pakistan Motor Vehicles (Amendment) Ordinance 1970 (W.P. Ordinance IX of 1970).  [53] Inserted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [54] Ibid .  [55] Ibid .  [56] Substituted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [57] The words “or the area within which” deleted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970).  [58] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [59] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ord. IX of 1970).  [60] Inserted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [61] Substituted first by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ord. IX of 1970) and then by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [62] Substituted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [63] Substituted by the Provincial Motor Vehicles (Amendment) Act 2011 (I of 2011).  [64] The words “or in specified areas”, deleted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970).  [65] Section 51 re-numbered as “51(1)” by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [66] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [67]  Clause ( a ), re-numbered as clause “( aa )”   ibid.  [68]  Deleted   ibid.  [69] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [70] Section 53, re-numbered as “53(1)” by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [71] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970) and substituted by the Provincial Motor Vehicles (Amendment) Act 2011 (I of 2011).  [72]  Section 54, re-numbered as “54(1)” by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance 1970 (Punjab Ordinance IX of 1970).  [73] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [74] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972), for the full-stop.  [75]  Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972) .  [76] Sub-section (1) substituted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970). The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 80 of 85   6/2/2011 2:44 PM",
  "[77] Deleted   ibid.  [78] Ibid.  [79] Ibid.  [80] Ibid.  [81] Ibid.  [82] Substituted   ibid .  [83] The words “without renewal”, omitted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [84] Inserted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [85] Substituted   ibid ., for the word “bus”.  [86] Substituted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005), for the “full-stop”.  [87] Inserted   ibid .  [88] Inserted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [89] Substituted for the “colon” by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [90] Inserted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [91] Ibid .  [92] Inserted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [93] Substituted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [94] Inserted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [95] Added by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [96] Inserted   ibid .  [97] Substituted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [98] Substituted by the Provincial Motor Vehicles (Amendment) Act 2011 (I of 2011).  [99] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [100]  Ibid .  [101]  Inserted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970).  [102] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970) .  [103] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ord. IX of 1970).  [104] Ibid .  [105] Ibid.  [106] Inserted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970).  [107]  Substituted   ibid. , for the full-stop.  [108] Added   ibid.  [109] Substituted by the Provincial Motor Vehicles (Amendment) Act 2011 (I of 2011).  [110]  Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970). The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 81 of 85   6/2/2011 2:44 PM",
  "[111] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1972 (XII of 1972).  [112] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [113] Inserted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [114] The word “and” deleted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [115] Clause ( xxxi ) re-numbered as clause ( xxxiv ) and clauses ( xxxi ) to ( xxxiii ) added   ibid ., clause ( xxxi ) so added was later substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970).  [116] Clause ( xxxi ) was re-numbered as clause ( xxxiv ) by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970).  [117] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1999 (XLVI of 1999), and omitted by the Provincial Motor Vehicles (Amendment) Act 2005 (VI of 2005).  [118] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Road Transport Corporation”.  [119] Ibid.  [120] Ibid.  [121] Substituted   ibid. , for “Corporation”.  [122] Substituted   ibid ., for “Road Transport Corporation”.  [123] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1975 (XXIII of 1975).  [124] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973).  [125] The words “Chairman or” deleted   ibid .  [126] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for the words “the Chairman or any”.  [127] Substituted   ibid. , for the words “the Chairman or each”.  [128] Substituted   ibid. , for the word “shall”.  [129] Substituted   ibid. , for the word “and”.  [130] The words “Chairman or” deleted   ibid.  [131] Substituted, for “Central”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [132]  Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Corporation”.  [133]  Ibid.  [134] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973).  [135] Inserted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [136] Inserted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ord. IX of 1970).  [137] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Corporation”.  [138] Ibid.  [139]  Re-numbered by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ord. IX of 1970).  [140] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Corporation”.  [141] Re-numbered by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ord. IX of 1970).  [142]  Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Corporation”. The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 82 of 85   6/2/2011 2:44 PM",
  "[143] Added by the Provincial Motor Vehicles (Amendment) Act, 1988 (Federal Act V of 1988).  [144] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Act, 1973 (III of 1973), for “Corporation”.  [145] Ibid.  [146] Ibid.  [147] Ibid.  [148] Ibid.  [149] Ibid .  [150] Ibid. , for “Road Transport Corporation”.  [151] Ibid ., for “Corporation”.  [152] X of 1940.  [153] Chapter V-A inserted by the Provincial Motor Vehicles (Amendment) Act, 2009 (I of 2009).  [154] V of 1938.  [155] Substituted by the Provincial Motor Vehicles (Amendment) Ordinance, 1979 (XXIV of 1979), for “Part A”.  [156] Ibid .  [157] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [158] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [159] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [160] Substituted by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ordinance IX of 1970), for the word “a”.  [161] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [162] Inserted   ibid .  [163] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [164] Added by the West Pakistan Motor Vehicles (Punjab Amendment) Ordinance, 1970 (Punjab Ord. IX of 1970).  [165] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [166] Inserted by the Provincial Motor Vehicles (Amendment) Act 2006 (II of 2006).  [167] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [168] Ibid .  [169] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [170]  Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978). The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 83 of 85   6/2/2011 2:44 PM",
  "[171] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [172] Ibid .  [173] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [174] Ibid .  [175] Ibid .  [176] Ibid .  [177] Ibid .  [178] XLV of 1860.  [179] Inserted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [180] Ibid .  [181] Ibid .  [182] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1969 (XXII of 1969), and substituted by the Provincial Motor Vehicles (Amendment) Ordinance, 2001 (XIX of 2001). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution.  [183] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [184] Ibid .  [185] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Act was originally promulgated as Ordinance XVII of 2007; was given permanent life by PCO I of 2007; however, consequent upon the judgment of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly; and was enacted as Act XV of 2009.  [186] Ibid .  [187] The words and figure “or section 100” omitted by the Provincial Motor Vehicles (Amendment) Ordinance 1983 (Federal Ordinance XL of 1983).  [188] Substituted by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1970 (W.P. Ordinance IX of 1970), for “[Thirteenth]”. The word in crotchets was earlier substituted by West Pakistan Motor Vehicles (Amendment) Ordinance, 1969 (XXII of 1969), for “Twelfth”.  * (Strike out whichever inapplicable) .  [189] Added by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [190] Substituted by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975), for “West Pakistan”.  [191] Substituted for “West Pakistan”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [192] Ibid.  [193] Substituted, for “West Pakistan”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [194]  Substituted, for “West Pakistan”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975).  [195] Added by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1969 (XXII of 1969) and substituted by the Provincial Motor Vehicles (Amendment) Ordinance, 2001 (XIX of 2001). Under Article 5A of the Provisional Constitution Order 1999 (I of 1999), as amended, read with Article 270AA of the Constitution of the Islamic Republic of Pakistan, 1973, it shall not be subject to any limitation as to duration prescribed in the Constitution.  [196]  Deleted   ibid .  [197] Substituted, for “Central”, by the Federal Adaptation of Laws Order, 1975 (P.O. 4 of 1975). The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 84 of 85   6/2/2011 2:44 PM",
  "[198] Ibid.  [199] Ibid.  [200] Ibid .  [201] Ibid.  [202] Substituted by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978).  [203] Substituted by the Provincial Motor Vehicles (Amendment) Ordinance, 1979 (XXIV of 1979). However, the previous Ninth Schedule remained in force for a period of three years from the commencement of the amending Ordinance i.e. 22nd April 1979.  [204] Substituted by the Provincial Motor Vehicles (Amendment) Act 2009 (XV of 2009). This Schedule was earlier substituted by Ordinance XVII of 2007, which Ordinance was given permanent life by PCO I of 2007; however, consequent upon the judgement of the Supreme Court of Pakistan dated 31 July 2009, this Ordinance was laid in the Assembly on 14 October 2009, and was referred to the concerned Standing Committee. In the meanwhile, another Ordinance No.I of 2009 was promulgated on 21 March 2009, which replaced the Twelfth Schedule and this Ordinance had also been laid in the Assembly and was referred to the concerned Standing Committee. The Committee replaced the Twelfth Schedule of Ordinance XVII of 2007 with that of Ordinance I of 2009 and thus the Act XV of 2009 was enacted.  [205] Inserted by the West Pakistan Motor Vehicles (Amendment) Ordinance 1970 (W.P. Ordinance IX of 1970); substituted first by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978) and then by the Provincial Motor Vehicles (Amendment) Act 2011 (I of 2011).  [206] Substituted for the word “[Thirteenth]” by the Provincial Motor Vehicles (Amendment) Ordinance, 1978 (VIII of 1978). The word in crotchets was earlier substituted, for “Twelfth” by the West Pakistan Motor Vehicles (Amendment) Ordinance, 1969 (XXII of 1969). The Provincial Motor Vehicles Ordinance, 1965   http://punjablaws.gov.pk/laws/189.html 85 of 85   6/2/2011 2:44 PM"
]