[
  "4/30/23, 9:12 PM HIRA MASOOD",
  "D) PPSC-8",
  "pS PUNJAB PUBLIC SERVICE COMMISSION",
  "= LDA Plaza, Edgerton Road, Near Aiwan-e-Igbal, Lahore.",
  "~~",
  "ADMISSION LETTER (M.C.Q TEST)",
  "UAN: 042-111-988-722",
  "Fax No: 042-99202766",
  "E-Mail: ppsc@punjab.gov.pk",
  "Website: www.ppsc.gop.pk",
  "CANDIDATE'S PF) i oy oT CY)",
  "NAME: HIRA MASOOD ] BANIETAN i:",
  "EN Masood",
  "FATHER'S NAME: MASOOD ELLAHI =g=) ald",
  "(2 LE) neti )",
  "Ee Gir",
  "ROLL NO: oo",
  "10605",
  "CNIC: 3740540159560 a  )",
  "whan |Wnow CL",
  "GENDER: Female |",
  "SUBJECT: RECRUITMENT TO THE POST (S) OF ASSISTANT DIRECTOR (LEGAL) - 10E2023",
  "1. Reference your application for the above noted post (s).",
  "2. You have been admitted provisionally to appear in the Test / Examination ( M.C.Q. ) type. You are being called for",
  "the subject written Test / Examination without scrutiny of your application.",
  "3. This admission letter does not mean that you have been found eligible for the subject post. Your eligibility will be",
  "determined during scrutiny of your documents on the day of your interview.",
  "4. You must bring this admission letter on the day of Test / Examination in order to secure your admission to",
  "the Test Centre. In case of non-compliance, you will not be allowed to appear in the Test / Examination.",
  "5. You should bring with you necessary writing material only required for the purpose. Blank Answer Sheets will be",
  "supplied by the Punjab Public Service Commission.",
  "Note: To avoid frustration, you are advised in your own interest to make sure before appearing in the",
  "written Test / Examination that you fulfill all the requirements/criteria as advertised for the post.",
  "EXAMINATION/TEST CENTRE & SCHEDULE",
  "CENTRE:",
  "CENTRE C-1, (HALL), (FEMALE), GOVT. ISLAMIA HIGH SCHOOL NO. 4. LIAQAT ROAD, RAWALPINDI.",
  "DATE ATTENDANCE TIME SUBJECT",
  "ASSISTANT DIRECTOR (LEGAL) -",
  "Saturd: 06-05-2023 10:00 AM",
  "| sews | seen | vows | 10E2023",
  "IMPORTANT NOTE:",
  "o Candidates are required to compulsorily produce Original and Valid Computerized National",
  "Identity Card (CNIC) for appearing in the Test / Examination. Without Original and Valid CNIC, No",
  "Candidate will be allowed to appear in the Test / Examination. In Case, your CNIC has expired or",
  "reported lost, you shall be allowed to appear in the written examination/test on production of",
  "Original Valid Passport or expired original CNIC. No other document will be acceptable.",
  "o Reporting Time at the Examination Centre is 30 MINUTES before attendance time.",
  "o No entry will be allowed in the Examination Centre after 20 minutes of attendance time and no",
  "excuse will be accepted.",
  "© You are instructed to bring COVID vaccination Certificate at the time of Test / Examination. In case",
  "you are exempted for COVID Vaccination, you have to produce letter from the concerned doctor,",
  "failing which you will not be allowed to appear in the Test / Examination.",
  "o You must bring face mask/sanitizer while coming to appear for Test / Examination failing which",
  "you will not be allowed to take the Test / Examination.",
  "hitps://www.ppsc.gop.pk/(S(cqvisaktymxcjwgk111wzebs))Exams/Letters/OnePaperMCQ.aspx 13",
  "4/30/23, 9:12 PM HIRA MASOOD",
  "o Keeping in view the COVID-19 SOPs, Drinking water will not be served to candidates in",
  "Examination Halls, so they are advised to bring their water bottles with them.",
  "o Strictly comply with Instructions given in the Question Paper / Answer Sheet.",
  "o Possession or use of Books, Bags, Electronic Gadgets including Cell Phones/Smart Watches etc.",
  "are Strictly Prohibited in the Examination Premises. Anyone found in the possession of these",
  "gadgets will liable to be disqualified.",
  "o You should NOT USE LEAD PENCIL to solve MCQ paper on OMR sheet. OMR Answer Sheet will",
  "be provided by the Punjab Public Service Commission.",
  "o This Admission Letter may consist of more than 2 pages, It is in favor of candidate to read all",
  "instructions given on this Admission Letter.",
  "o The duration of Test / Examination will be of 90 Minutes.",
  "1 oh! § 80 <",
  "SE LS AL FEAT bt BG FEAT Ia Lf oer #0",
  "SE Fel uni sister Mie Frfrefie brik Fe me Suid”",
  "Ere JA pan Me Fol fo",
  "& LE e302 hs PLE Po LIE Sgr Ris",
  "Oe REE ree En FYE 20 LS PLS fe",
  "P33 Te Led A VA EGA ISL nfo PVT %",
  "nese UY Th es fA sas",
  "E. Cb = LZ éovi oe pi 2 x",
  "- Gn TIS RE Tar 2 Bn WEL Pe LE En Po ff Est TT",
  "Seer EL 2c SHPPSC Lub Hogi», Fup $71 COVIDA9  #",
  "LAS Budde,",
  "untae Fra lS Sr dE Hasty frig ¥",
  "£3 ; For 5 sf wv rsd wr coe om Dap XE",
  "IF oe Fado So Abe lg nat TEL VB Euintl f Ss *",
  "Hebb Ine It SCs",
  "ce esp SEE Je FOMREE SL Fae #",
  "Lop apr ye Jose $5 oe En Sa Bie nF,",
  "6. If you are found ineligible later on in any respect under rules, your candidature will be cancelled regardless of the",
  "fact whether you appeared in the Test / Examination or qualified therein.",
  "7. Your attention is also invited to study the instructions carefully provided on the flyleaf of the answer sheet and",
  "question paper at the time of Test / Examination. Failure to observe these instructions shall render you liable to any",
  "of the following penalities:",
  "a. Cancellation of paper / candidature for the post you applied for.",
  "b. Registration of a criminal case if you are found indulging in cheating or any criminal act i.e. forgery,",
  "impersonation etc.",
  "c. Temporary or permanent disqualification from applying or appearing in any Test / Examination / Interview",
  "conducted or to be conducted.",
  "d. Any other action that the Commission deems fit.",
  "8. You must ensure before handing over your Answer Sheet to the Supervisory Staff that the same has been signed",
  "by the Supervisor of the Centre.",
  "9. Your Roll Number as mentioned above or Application Code already allocated to you at the time of submission of",
  "Online Application form should invariably be quoted while corresponding with the Commission in connection with",
  "this Test / Examination.",
  "10. The Test / Examination will be held on the scheduled date and time even if that day is declared holiday by the",
  "Government subsequently.",
  "hitps://www.ppsc.gop.pk/(S(cqvisaktymxcjwgk111wzebs))Exams/Letters/OnePaperMCQ.aspx 23",
  "4/30/23, 9:12 PM HIRA MASOOD",
  "11. If you have received a duplicate Roll Number, you should ignore it and should only use the Roll Number given to",
  "you initially. This fact must be intimated to PPSC immediately in writing.",
  "12. You will not be allowed to appear in the Test / Examination Centre other than the Test Centre mentioned in this",
  "letter.",
  "13. Smoking is strictly prohibited in the Test Centre.",
  "14. No T.A/D.A will be paid for appearing in the Test / Examination.",
  "15. If you are handicapped and require a writer/helper, you must forward your request to the Commission for the same",
  "well before the Test / Examination.",
  "16. Employees of Federal Government or Semi Government and Autonomous Bodies of Federal Government or",
  "Autonomous Bodies of Provincial Government and those of Local Bodies are not entitled to age concession for the",
  "period of their service in such organizations.",
  "17. You will be disqualified for the exam and an FIR will also be lodged against you if:",
  "a. You are found making any changes, additions, deletions or otherwise marking, erasing or writing on \"wy",
  "MCQ Question Paper or Answer Sheet after the time for the Test / Examination has expired.",
  "b. Consulting or taking help from other person (s) or resource (s) from outside the examination centre during",
  "the Test / Examination.",
  "c. Copying questions or answers either on paper or otherwise and taking them outside the exam room.",
  "d. Taking out MCQ Question Paper or Answer Sheet from the examination centre.",
  "e. Found impersonating.",
  "f. Threatening / Misbehaving with the examination staff.",
  "IMPORTANT NOTICE!",
  "+ PPSC only uses the email addresses given at below mentioned link to correspond with the candidates:-",
  "Location: http://ppsc.gop.pk/ContactUs.aspx- Click on \"Official Emails of PPSC\"",
  "« Official SMS are only sent to candidates by \"PPSCINFO / PPSC\" (Sender).",
  "« All potential candidates must make a note of the above and should not be mislead by any fake email addresses or",
  "SMS.",
  "https://www.ppsc.gop.pk/(S(cqvibaktymxcjwgk111wzebs))/Exams/Letters/OnePaperMCQ.aspx 3/3"
]