[
  "IN THE COURT OF MR. ADNAN MUSHTAQ, PRESIDING OFFICER, DISTRICT CONSUMER COURT, LAHORE",
  "In re:",
  "Nouman",
  "v",
  "Samsung Customer Service Centre etc.",
  "APPLICATION UNDER SECTION 28 OF THE PUNJAB CONSUMER PROTECTION ACT 2005 ON BEHALF OF THE APPLICANT/DEFENDANT NO.6 FOR DISMISSAL OF THE PLAINT",
  "Respectfully Sheweth:",
  "1. That the above titled case is pending adjudication before this learned court, in which date of hearing is fixed for 10.07.2023.",
  "2. That the learned court vide its previous order dated 17.06.2023, has fixed the proceedings for cross examination of the plaintiff by the defendant no.6.",
  "3. That however, it is submit that after the perusal of the plaint, it emits that the original date for institution of the suit was 02.06.2021, however, the notice of the claim was sent to service on 17.05.2022 as per TCS Receipt record.",
  "4. That the perusal of the TCS receipt record shows that it is not an urgent mail therefore, assumption can be made that by enlarge the notice were not reasonably served on applicant/defendant no.6 until 20.05.22.",
  "5. That section 28 (2) & (4) of The Punjab Consumer Protection Act, 2005 provides that the manufacturer or service provider shall within 15 days of the receipt of the notice reply, thereto; a claim by the consumer or authority shall be filed within 30 days of the arising of the cause of action.",
  "6. That application of the sub-sections ibid on the material facts related to applicant /defendant no,6 provides that respondent/complainant must have waited reasonably until 05.06.22 for reply from applicant/respondent no.6 and institute his case reasonably after 06.06.2022, when the cause of action may have arisen after no reply would have been sent by the applicant/respondent no.6. However, the respondent/complainant instituted the case earlier on 02.06.2023, which shows his mala fide intentions to obtain unfair advantage.",
  "7. That the preceding argument are based on the authority of 2018 CLD 1064, which provides that Consumer Court had power to extend the time limit for filing of complaint for up to 1 year but such extension could only be made, when sufficient cause was disclosed for not filing complaint within 30-days, by filing proper application. Complaint, under the Punjab Consumer Protection Act. 2005, if hit by time limitation, then framing of issues and recording of evidence was of no consequence and such complaint was liable to be dismissed.",
  "8. That it is pertinent that respondent/complainant has not produce any evidence related to the defect in his mobile phone under contention in form, other than oral aversion in the complaint.",
  "PRAYER",
  "In the above circumstances, it is therefore respectfully prayed that respondent/complainant’s complaint may be dismissed due to not following the procedure given in Section 28 of The Punjab Consumer Protect Act, 2005 for institution of the suit in the interest of justice, equity and fair play.",
  "Applicant",
  "Through",
  "Barrister Muhammad Zaman Malik",
  "Advocate High Court",
  "9-Farid Kot, Lahore",
  "IN THE COURT OF MR. ADNAN MUSHTAQ, PRESIDING OFFICER, DISTRICT CONSUMER COURT, LAHORE",
  "In re:",
  "Nouman",
  "v",
  "Samsung Customer Service Centre etc.",
  "APPLICATION UNDER SECTION 28 OF THE PUNJAB CONSUMER PROTECTION ACT 2005 ON BEHALF OF THE APPLICANT/DEFENDANT NO.6 FOR DISMISSAL OF THE PLAINT",
  "AFFIDAVIT OF: Respondent No.6, Younis Mobile through its Owner, operating at 29, Main Hall Road, Lahore.",
  "I, the above named deponent do hereby solemnly declare and affirm as under:-",
  "1. That the appended application must be read as an integral part of this affidavit.",
  "2. That nothing has been concealed.",
  "DEPONENT",
  "VERIFICATION:",
  "Verified on oath at Lahore on this 10th day of July, 2023 that the contents of the above affidavit are correct and true to the best of my knowledge and nothing has been concealed therefrom.",
  "DEPONENT"
]