[
  "IN THE COURT OF NADEEM AHMAD CIVIL JUDGE, KHANPUR",
  "In re:",
  "Anila v Sher Zaman etc.",
  "APPLICATION UNDER ORDER 3 RULE 4, READ WITH RULE 1 & 2 AND 151 OF THE CPC, ON BEHALF OF THE APPLICANT/RESPONDENT NO.6",
  "Respectfully Sheweth:",
  "1. That the above titled case is pending adjudication in this honourable court and is fixed for 20.06.2023.",
  "2. That the court vide order dated 15/05/2023, issued summons for attendance of the respondent nos.1-5 excluding respondent No.6, due to her attendance.",
  "3. That on the same date a power-of-attorney annexed to a written statement (‘the documents’) depicting reply in the case was purportedly submitted by Ch. Adeel Ahmed Gujjar (Advocate High Court), Sami Ullah Malik (Advocate High Court), and Muhammad Akhram MOJ (Advocate), (collectively referred hereinafter as “the ex-counsels”), on the behalf of respondent no.6.",
  "That reliance for above averments was placed on 1992 SCMR 876 & 2008 SCMR 896, respectively. The reading of two authorities reveal that the admission of facts will be binding upon the client unless it is based upon mis-apprehension of facts, or it is contrary to the instructions.",
  "that further, reliance was placed on 2004 CLC 359, which provides that the vakalatnama has to be strictly interpreted.",
  "The ex-Counsels’s mala fide act mentioned above shows their non-observance or violation of Art. 144 & 145 of the canons of professional conduct and etiquette provided under Legal Practitioners & Bar Council Rules, 1976 and for their professional misconduct the honourable court may refer them to the Disciplinary committee of the concerned Bar Council as per S.41 of Legal Practitioner & Bar Councils Act, 1973 to initiate disciplinary enquiry under  Art. 175A of Legal Practitioners & Bar Council Rules, 1976.",
  "PRAYER",
  "In view of the above and in the best interest of justice, it is prayed that the applicant/respondent no.6, may be granted a leave to submit anew power-of-attorney and afresh written statement in the above titled case. Otherwise, she will suffer an irreparable loss by losing her right to defendant based on true version of facts and it will also result in a gross miscarriage of justice in terms of respondent nos.1-5.",
  "Refer the ex-counsels viz., Ch. Adeel Ahmed Gujjar (Advocate High Court), Sami Ullah Malik (Advocate High Court), and Muhammad Akhram MOJ (Advocate) to Bar Council for disciplinary action.",
  "Any other relief which this Honourable court deems fit may also be awarded to the applicant.",
  "Applicant",
  "AFFIDAVIT",
  "IN THE COURT OF NADEEM AHMAD CIVIL JUDGE, KHANPUR",
  "Anila Bibi.",
  "versus",
  "Sher Zaman etc.",
  "APPLICATION UNDER ORDER 3 RULE 4, SUB-RULES 1 & 2 OF THE CPC 1908 ALONG WITH 151 OF THE SAME, ON BEHALF OF THE APPLICANT/RESPONDENT NO.6 FOR THE LEAVE OF THE COURT TO PRESENT ANEW DULY AUTHORIZED POWER-OF-ATTORNEY AND AFRESH WRITTEN STATEMENT IN THE ABOVE TITLED CASE BASED ON THE CORRECT INSTRUCTIONS & ACCURATE/TRUE FACTS.",
  "AFFIDAVIT OF: Shugufta W/o Anwar Khan, resident of D.H.A, Lahore.",
  "I, the above named deponent do hereby solemnly declare and affirm as under:-",
  "1. That the above titled case (‘the case’) is pending adjudication in this honourable court and is fixed for 20.06.2023.",
  "2. That the court vide order dated 15/05/2023, issued summons for attendance of the respondent nos.1-5 excluding respondent No.6, due to her attendance.",
  "3. That on the same date a power-of-attorney annexed to a written statement (‘the documents’) depicting reply in the case was purportedly submitted by Ch. Adeel Ahmed Gujjar (Advocate High Court), Sami Ullah Malik (Advocate High Court), and Muhammad Akhram MOJ (Advocate), (collectively referred hereinafter as “the ex-counsels”), on the behalf of respondent no.6.",
  "4. That the matter of the fact is that respondent no.6 had only verbally agreed with ex-counsels to acquire their service for pleading in the above titled case, no written agreement related to fees or of any kind was made. However, to err on the side of caution, she impressed her thumb on a white paper and power attorney (‘the papers’), on the basis of assurance given by the ex-counsels that they will only use the papers in contingency of the matter.",
  "5. that it is submitted that respondent No.6 had intimated above-mentioned ex-counsels vide letter dates 05.05.23 about the termination of their service/pleadership in the case due to appointment of fresh counsel (Mr. Amir- Advocate High Court) to plead on her behalf.",
  "7. That however, contrary to her instructions present in the said letter and assurance given by the ex-counsels along with mala fide intentions, the ex-counsels, presented the documents to sabotage respondent no.6’s defence in the case. It is important to explore on the fact that all the facts, given in the purported written statement, submitted on her behalf, in reply to the case, are false, misapprehension of facts, inaccurate, contrary to her instructions and does not have any bearing on her conscience.",
  "8. That it is pertinent to note that no date was scribed under the hand of respondent no.6, either below her signature, in the documents, or under her thumb impression because she had never scribed the date nor signed the said documents as the matter of fact. The signature present are fake.",
  "9. that the further scrutiny of the documents revealed that written statement neither verified by respondent no.6 nor an effort was made to attain the stamp from oath commission in verification of the document. The reason can only be that ex-counsel in connivance acted malafidely to bring injury to her by usurping her right to defend the case as per her version of facts.",
  "5. That the perusal of written statement purportedly submitted in reply of the case, remits a false and infirm stance of the respondent no.6, which was neither based on true facts nor on accurate description of the events and the whole substance of the reply is contrary to her instructions.",
  "7. That hence the application was made in this honourable court for leave to submit anew power-of-attorney and afresh written statement based on accurate/true facts according to the correct instructions of respondent no.6.",
  "8. That reliance was placed on 1992 SCMR 876 & 2008 SCMR 896, respectively. The reading of two authorities reveal that the admission of facts will be binding upon the client unless it is based upon mis-apprehension of facts, or it is contrary to the instructions.",
  "9. That further, reliance was placed on 2004 CLC 359, which provides that the vakalatnama has to be strictly interpreted.8. That nothing has been concealed.",
  "10. The ex-Counsels’s mala fide act mentioned above shows their non-observance or violation of Art. 144 & 145 of the canons of professional conduct and etiquette provided under Legal Practitioners & Bar Council Rules, 1976 and for their professional misconduct the honourable court may refer them to the Disciplinary committee of the concerned Bar Council as per S.41 of Legal Practitioner & Bar Councils Act, 1973 to initiate disciplinary enquiry under  Art. 175A of Legal Practitioners & Bar Council Rules, 1976.",
  "DEPONENT",
  "VERIFICATION:",
  "Verified on oath at Lahore on this 17th day of May, 2023 that the contents of the above affidavit are correct and true to the best of my knowledge and nothing has been concealed therefrom.",
  "DEPONENT",
  "LETTER OF INTIMATION",
  "To,",
  "Ch. Adeel Ahmed Gujjar (Advocate High Court),",
  "Sami Ullah Malik (Advocate High Court),",
  "Muhammad Akhram MOJ (Advocate)",
  "Subject: intimating the termination of representation by above three named counsels in the court of Nadeem Ahmad Civil Judge, Khanpur related to the case of Anila v Sher etc. by Shugufta Khan (respondent no.6 in the said case).",
  "Respected Sirs,",
  "It is intimated vide this letter to Ch. Adeel Ahmed Gujjar (Advocate High Court), Sami Ullah Malik (Advocate High Court), and Muhammad Akhram MOJ (Advocate) that their recognized pleadership (appearing, applying, or acting, as the case maybe) on behalf of respondent No.6 in the case of Anila v Sher etc. is hereby terminated and anew counsel by the name of Amir Advocate High Court has been appointed to represent her, in the said case.",
  "Hence, all the above-named advocates are restricted from submitting any written material or oral advocacy in the above-mentioned court related to the case. Alternatively, a legal action may be taken in contravention of these instructions.",
  "Yours Sincerely,",
  "Shugufta Khan",
  "Dated: 16.05.23"
]