[
  "IN THE COURT OF MR TARIQ RASHEED QAMAR JUDICIAL MAGISTRATE SEC.30 PS MAZANG, LAHORE",
  "In re:",
  "STATE vs SHEIKH SALAHUDIN",
  "CASE FIR NO. 184/2020 DATED: 13.03.2020",
  "OFFENCE U/S 406 PPC",
  "PS- MAZANG, LAHORE",
  "APPLICATION FOR CANCELLATION OF NON BAILABLE WARRANT OF THE COMPLAINANT NAMELY- MALIK GUL ZAMAN, ORDER DATED: 23.05.2022",
  "Respectfully Sheweth:",
  "1. That the above titled suit is fixed before this Honourable Court on 17.07.2023.",
  "2. That Non-Bailable Warrants were issued against Prosecution witnesses namely- Applicant/PW1/Malik Gul Zaman, and others, for attendance before the Honourable Court to give evidence.",
  "3. That the reason for non-compliance with the requirements of issued Warrants over a period was that Applicant/PW1/Malik Gul Zaman did not receive any notice of the issued warrants either at home or through the principal counsel in the case. Therefore, a new counsel is appointed in this case due to necessity to curb any further non-compliance of the orders.",
  "3. That Applicant/PW1/ Malik Gul Zaman is ready to surrender before the Honourable Court as per the warrants. Therefore, it is humbly requested that the non-bailable warrants may be cancelled against the Applicant/PW1/Malik Gul Zaman and next date may be fixed for his appearance due to his ill health.",
  "Prayer",
  "In the above-mentioned circumstances, it is prayed that Non-Bailable Warrants may be cancelled against Applicant/PW1/Malik Gul Zaman and a new date may be fixed for his presentation in the interest of justice, fair play, and equity.",
  "Applicant",
  "Through Counsel",
  "ABDUL RAHIM KHAN (A.H.C.)",
  "-&-",
  "BARRISTER MUHAMMAD ZAMAN MALIK (A.H.C)",
  "IN THE COURT OF MR TARIQ RASHEED QAMAR JUDICIAL MAGISTRATE SEC.30 PS MAZANG, LAHORE",
  "In re:",
  "STATE vs SHEIKH SALAHUDIN",
  "CASE FIR NO. 184/2020 DATED: 13.03.2020",
  "OFFENCE U/S 406 PPC",
  "PS- MAZANG, LAHORE",
  "APPLICATION FOR CANCELLATION OF NON BAILABLE WARRANT OF THE COMPLAINANT NAMELY- MALIK GUL ZAMAN, ISSUED VIDE ORDER DATED: 23.05.2022",
  "AFFIDAVIT OF: MALIK GUL ZAMAN S/o Malik Mumtaz Ali, Resident of 786/A, Block F, Street 1, Rana Market, Ali Park, Lahore Cantt, Lahore.",
  "I, the above-named deponent does hereby solemnly declare and affirm as under: -",
  "That the appended application may be read as an integral part of the affidavit.",
  "That nothing has been concealed.",
  "DEPONENT",
  "VERIFICATION:",
  "Verified on oath at Lahore on this 17th day of July, 2023 that the contents of the above affidavit are correct and true to the best of my knowledge and nothing has been concealed therefrom.",
  "DEPONENT"
]