[
  "BEFORE THE COURT OF MUHAMMAD YAR WALANA, COMPENSATION COMMISSIONER , LDA COMPLEX, LAHORE.",
  "In re:",
  "Javed Iqbal v The Government Of Punjab etc.",
  "APPLICATION UNDER ORDER 9, RULE 9 OF THE CPC 1908 FOR RESTORATION OF THE CASE, DISMISSED DUE TO NON-PROSECUTION.",
  "Respectfully Sheweth:",
  "1. That the above titled case was dismissed due to non-prosecution on 21.06.2023.",
  "2. That it is submitted that the substantial and/or reasonable explanation for late arrival in the learned court was that the counsel arrived at 3:30 in the learned court, and came to know about the dismissal of the instant case for the want of non-prosecution. It is imminent to mention herein that the distance between the honourable Lahore High Court Lahore, and the learned court is quite considerable, and the counsel had been stuck in traffic on the way due to rush hours of the day.",
  "3. That counsel for the plaintiff is following the proceedings in the instant suit with vigilance and due care.",
  "PRAYER",
  "In the above circumstances, it is therefore respectfully prayed that the learned court may restore the instant suit to the before dismissal stage of proceedings in the interest of justice and equity.",
  "Applicant",
  "SHAH IJAZ-UL-HASSAN",
  "Advocate High Court",
  "BARRISTER MUHAMMAD ZAMAN MALIK",
  "Advocate",
  "BEFORE THE COURT OF MUHAMMAD YAR WALANA, COMPENSATION COMMISSIONER, LDA COMPLEX, LAHORE.",
  "In re:",
  "Javed Iqbal v The Government of Punjab etc.",
  "APPLICATION UNDER ORDER 9, RULE 9 OF THE CPC 1908 FOR RESTORATION OF THE CASE, DISMISSED DUE TO NON-PROSECUTION.",
  "AFFIDAVIT OF: Sheikh Muhammad Umar appointed counsel in the titled suit.",
  "I, the above-named deponent does hereby solemnly declare and affirm as under: -",
  "1. That the attached plain, must be read as an integral part of the instant affidavit.",
  "2. That nothing has been concealed.",
  "DEPONENT",
  "VERIFICATION:",
  "Verified on oath at Lahore on this 18th day of July, 2023 that the contents of the above affidavit are correct and true to the best of my knowledge and nothing has been concealed therefrom.",
  "DEPONENT"
]