[
  "IN THE LAHORE HIGH COURT LAHORE",
  "In re:",
  "Ali Amir Hussain v Director General of Immigration & Passport etc.",
  "APPLICATION UNDER ARTICLE 204 OF THE CONSTITUTION OF ISLAMIC REPUBLIC OF PAKISTAN, 1973 READ WITH SECTIONS 3 & 12 OF THE CONTEMPT OF COURT ORDINANCE 2003 TO INITIATE CONTEMPT OF COURT PROCEEDINGS.",
  "Respectfully Sheweth:",
  "1. That the Honourable High Court Lahore, passed an order in the above titled writ petition on 10.06.2021.",
  "2. That the Honourable High Court Lahore directed Respondent No. 2 namely- Assistant Director Passport Officer, Garden Town, Lahore via the said order to decide, applicant’s/petitioner’s application related to the issue of the passport, if pending before the said authority, as per law and after providing him an opportunity to explain his concerns; pass a well-reasoned, speaking order expeditiously. Further directed applicant/petitioner to appear before the said authority on 17.06.2021.",
  "3. That as per the said direction, petitioner did appear before the respondent no.2, on 17.06.2021 but he refused to see him, listen to him rather did not even make any decision on the pending application before him.",
  "4. That petitioner after waiting all day at the premises, returned unheard and feeling agitated. Respondent No.2’s bare contumacy to follow the directions of the learned High Court Lahore, which he was legally bound to follow, brings him under the contempt of the learned High Court because of deliberate flouting and/or disobedience of the said direction.",
  "5. That, Respondent No.2 committed a Civil contempt by wilful flouting and/or disregarding of direction issued via order dated 10.06.2021 by the learned High Court Lahore, hence the application related to contempt of court was made by the petitioner, after exhausting all other remedies.",
  "6. That the learned High Court has the jurisdiction to take cognizance of this matter at once and initiate proceedings against Respondent No. 2.",
  "PRAYER",
  "In view of the above, in the best interest of justice & public policy, it is prayed that a procedure related to contempt of court may be initiated against the Respondent No. 2 for contumaciously disobeying and/or disregarding the direction via order dated 10.06.21, promulgated by the learned High Court Lahore, which he is legally bound to obey.",
  "Any other relief which this Honourable court deems fit may also be awarded to the applicant.",
  "Applicant",
  "AFFIDAVIT",
  "IN THE LAHORE HIGH COURT LAHORE",
  "In re:",
  "Ali Amir Hussain v Director General of Immigration & Passport etc.",
  "APPLICATION UNDER ARTICLE 204 OF THE CONSTITUTION OF ISLAMIC REPUBLIC OF PAKISTAN, 1973 READ WITH SECTIONS 3 & 12 OF THE CONTEMPT OF COURT ORDINANCE 2003 TO INITIATE CONTEMPT OF COURT PROCEEDINGS.",
  "AFFIDAVIT OF: Ali Amir Hussain, S/o Rana Hussain Khan, Resident of House No. 305-A, Mohallah Gulshan Ravi, Lahore.",
  "I, the above named deponent do hereby solemnly declare and affirm as under:-",
  "1. That the accompanying application must be read as an integral part of this affidavit.",
  "2. That nothing has been concealed.",
  "DEPONENT",
  "VERIFICATION:",
  "Verified on oath at Lahore on this 18th day of July, 2023 that the contents of the above affidavit are correct and true to the best of my knowledge and nothing has been concealed therefrom.",
  "DEPONENT"
]