[
  ", Leds",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020",
  "PAPER- «~----—-CIVIL LAW-|",
  "TIME ALLOWED: 03 HOURS TOTAL MARKS: 100",
  "NOTE: (i) Attempt ONE question from each PART",
  "(ii) All questions carry equal marks",
  "PART",
  "Q. Examine what is the legal position, as to the following:",
  "A holding company “\"AZU Limited Company” executed a guarantee of worth Five Hundred",
  "Thousand Rupees on behalf of its subsidiary company “AUB Limited Company” via written",
  "contract in favor of AKL Bank promising thereby that in case of default by AUB, AZU will",
  "discharge the liability. Bank demanded the compliance of the guarantee executed and",
  "subsidiary refused to execute it therefore, Bank asked the guarantor i.e. holding company to",
  "fulfill its promise. AZU Company also declined to execute the guarantee demanded.",
  "Q.No.1 In your opinion, explain whether there is a valid contract of guarantee between the parties. Also",
  "explain the importance of the essential elements required for the formation of a valid contract of",
  "guarantee.",
  "Q.No.2 Write an opinion advising Bank on the various possible option(s) available for the enforcement",
  "of contract of guarantee along with the liability of the guarantor,",
  "PART-II",
  "Q.No.3 According to the principles of established Muslim jurisprudence and relevant law of the land ,",
  "father is the natural guardian (waf)of the person and property of a minor child , whereas custody",
  "(hidhanat) is not a matter of right for the parents or any other person claiming for them. The",
  "basic consideration is the welfare of the child in matters of custody i.e. to provide to the child",
  "most natural, most considerate and most compassionate atmosphere to grow up as a better",
  "member of the society. Discuss the concept of appointment of guardian and highlight the",
  "difference between the notions of “guardianship” and “custody” in light of the relevant provisions",
  "of law.",
  "Q.No.4 Discuss the grounds for the removal of a guardian and the: cessation of the authority of a",
  "guardian,",
  "PART-II",
  "Q.No.5 Explain the following statement in light of the relevant provisions of law and judgments laid down",
  "by the supericr courts of Pakistan :",
  "“Where once time has begun to run, no subsequent disability or inability to institute a suit or",
  "make an application can stop it .\"",
  "Q.No.6 Write down the limitation period prescribed in the relevant law , for the following suits/appeal.",
  "1. Suit for compensation of false imprisonment.",
  "2. Suit for compensation for malacious prosecution.",
  "3. Suit for compensation for infringing copyright etc.",
  "4. Suit under order .37 CPC.",
  "5. Suit to declare the forgery of an instrument issued or registered.",
  "8. Suit to set aside a decree obtained by fraud etc.",
  "7. Suit for arrears of rent.",
  "8. Suit for specific performance of a contract.",
  "9.Suit for possession of immovable property when plaintiff has been dispossessed .",
  "10. Appeal under the Arbitration Act, 1240 to set aside an award.",
  "PART-IV",
  "Q.No.7 Critically discuss and analyze the concept, procedure of Talaq laid down in the relevant law and",
  "consequences of failure to give notice of Talaq to the Chairman of a Union Council, meaning",
  "thereby what would be the effect if the husband while divorcing failed to give any notice of Talaq",
  "to the Chairman in light of the rulings of the Superior courts.",
  "Q.No.8 Define and discuss the following provision of West Pakistan Family Courts Act, 1964:",
  "{i) Sec.9 (6) (ii) Sec .14 (iii) Sec.10 and Sec.12 (iv) Sec. 17-A",
  "PART-V",
  "Q.No.9 Write an order while determining the rights of the parties and disposing of the suit on the basis of",
  "the following facts in light of the relevant provisions of law.",
  "Ahmad purchased a shop No.F-426, which was owned by Noor Begum and others through a",
  "sale deed dated 02.09.2020 in lieu of Rs.500,000/-, however allegedly ostensible sale price",
  "was shown as Rs.725,000/-, only to the Faisal from exercising right of pre-emption . Faisal",
  "allegedly gained knowledge about the transaction in question on 22.09.2020 through",
  "Muhammad Shakil in presence of Ameer Hamza and Muhammad Shahbaz, there and then he",
  "made a jumping demand , where after on the same day he sent the notice of Talb-e-Ishhad to",
  "Ahmad but on refusal , he instituted for possession on the basis of pre-emption being Shafi",
  "Shareek.",
  "Q.No.10 Ahmad and Bilal (resondents No.1&2) preferred an ejectment petition in terms of Section15 of",
  "The Punjab Rented Premises Act, 2009 of relevant laws seeking eviction of the pefitioner(Ali)",
  "from the suit property on multiple grounds including expiry of tenancy agreement. Ali moved an",
  "application for leave to contest wherein he asserted that he paid Rs.30,00,000/- to the original",
  "landlord/owner as a “pagri” and no notice in terms of Section 30 of “The Act,2009\" has been",
  "issued to him by Ahmad and Bilal.",
  "In fight of the above —mentioned facts read with relevant provisions of law and judgments laid",
  "down by superior courts, Can Ali claim the tenancy in perpetuity merely as a premium on",
  "account of alleged payment of \"pagri”.",
  "nM wok AL",
  "LAHORE HIGH COURT, LAHORE : ‘",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020 i",
  "PAPER ------——-- CIVIL LAW {",
  "NOTE: )",
  "i) Attempt ONE question from each PART.",
  "ii) All questions carry equal marks.",
  "PART-i",
  "Q.1. Discuss the obligations, duties and limitations of an agent. Also, state as to",
  "whether principal is bound by agent's act performed beyond his authority.",
  "Q.2. Define and talk about contingent contracts with reference to the relevant provisions",
  "of the Contract Act, 1872.",
  "PART-II",
  "Q.3. Debate over the duties of guardian of the person and guardian of property.",
  "Q.4. Marriage between A and B was dissolved through a suit for Dissolution of Marriage",
  "filed by A against B. A retains custody of the minor daughter born out of the wedlock, )",
  "After six months, A marries D. B on attaining knowledge of the said fact files a guardian",
  "petition for obtaining custody of his minor daughter. During the proceedings, B proves )",
  "before the court that A has contracted marriage with a person not related to the minor.",
  "(Note: B has not contracted his second marriage).",
  "Talk through and discuss the fate of this guardian petition of B under the relevant law.",
  "PART-II",
  "Q.5. Write down the limitation period prescribed in the relevant law for the",
  "following suits/appeals.",
  "1. Suit under sec.9 of the Specific Relief Act, 1877. '",
  "2. Suit under summary procedure (sec. 128 (2)(f) C.P.C)",
  "3. Suit for rescission of a contract.",
  "4. Suit upon a foreign judgment.",
  "5. Suit for which no period of limitation is provided elsewhere in this schedule.",
  "6. Suit by a person excluded from joint family property to enforce a right to share",
  "therein. .",
  "7. Appeal from a decree or order of a High Court in the exercise of its original",
  "R jurisdiction.",
  "8. Appeal under C.P.C 1908 to the court of a District Judge.",
  "9. Appeal under the Arbitration Act 1940 to set aside an award.",
  "10. Appeal under the Cr. P.C 1898 {rom an order of acquittal.",
  "Q.6. Discuss in detail the provision of sec.5 of the Limitation Act, 1908.",
  "PARTHV",
  "Q.7. Elaborate ail tne grounds available under the law for Dissolution of Marriage.",
  "Q.8. What factors are tc he considered by the court in a suit for recovery of",
  "maintenance allowance filed by the wife and children? Also, narrate the period of past",
  "maintenance they are entitled to under the law of the land.",
  "PART-V",
  "Q.9. Talk about the provisions of section 6 and section 13 of the Punjab Pre-emption",
  "Act, 1981. .",
  "Q.10. Define and zlaboerate the following.",
  "1. Obligation: ¢¢ ‘andlord",
  "2. Obligation of tenant",
  "3. Grounds of eviction",
  "4. Leave to contest",
  "Lain Ong",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020",
  "PAPER-|l -~---CIVIL LAW-{l",
  "TIME ALLOWED: 03 HOURS TOTAL MARKS: 100",
  "NOTE (i) Attempt FIVE questions selecting TWO questions from PART-l and ONE each from",
  "PART-{l, lif &IV. |",
  "(ii) All questions carry equal marks.",
  "PART.",
  "Q.No.1. A widow namely Kiran and her son Salman filed a suit for partition of property. The property is",
  "situated at Pakpattan and Salman resides in Multan. The suit is filed in Civil Court , Multan.",
  "Kiran challenged the Jurisdiction of the court asking the court to return the plaint . The court",
  "however passes an order refusing the return and proceeds ahead to entertain the suit. Now",
  "Kiran is aggrieved, what will be her possible remedies? Discuss.",
  "a. Can file a review in the same court?",
  "b. Can directly appeal in the Supreme Court?",
  "c. Can file a revision in the High Court?",
  "d. Can prefer an appeal ?",
  "Q.No.2. Write short notes on :",
  "1. Production of documentary evidence.",
  "2. Miscellaneous proceedings",
  "3. Necessary and proper party",
  "4. Judgement on admission and parties not at issue.",
  "5. Procedure of Christian Family Cases in Suit for Dissolution of Marriage and for recovery of",
  "dowery articles.",
  "Q.No.3 Discuss all specific provisions of C.P.C for setting aside ex-parte orders, Judgements and",
  "Decrees, Dismissal of suit in presence or absence of defendant(s).",
  "PART-lI}",
  "Q.No.4 Under the Registration Act ,1908, there are certain documents Jthe registration of which is",
  "compulsory and the effect of their non-registration is also given . Discuss all categories of",
  "documents in light of the relevant provisions of law.",
  "Q.No.5 Discuss the duties and powers of registering officers in light of the relevant provisions of the",
  "Registration Act, 1908. -",
  "PART-II",
  "Q.No.6 Differentiate between perpetual and mandatory injunction. What are the pre-requisite conditions",
  "for the grant or refusal of the same ? Discuss in detail with reference to the relevant provisions",
  "of law,",
  "Q.No.7 Discuss all aspects of Sec.7(iv)(c) of The Court Fees Act 1870 .",
  "PART-IV",
  "Q.No.8 Define the term “Arrears of Land Revenue’ who determines the said amount and what is the",
  "procedure for recovery of the said arrears. Discuss the relevant provisions of law.",
  "Q.No.9 Write Short notes on:",
  "1. Classes of Revenue officers",
  "2. Record of Rights .",
  "3. Khasra Girdawari",
  "4 Mutalim of Inheritarice ~~",
  "5. Gift ’",
  "Downe fxn di",
  "LAHORE HIGH COURT, LAHORE :",
  "ADDITIONAL DISTRICT AND SESSIONS JUDGES",
  ") COMPETITIVE EXAMINATION, 2020",
  "PAPER II : CIVIL LAW. .",
  "TIME ALLOWED: 03 HOURS : TOTAL MARKS: 100",
  "NOTE: -",
  "(i) Attempt FIVE questions selecting TWO guesticns “om PART and GNE each",
  "from PART-II, Ill and IV. ’",
  "{ii} Ali questions carry equal marks.",
  "PARTY E",
  "Q.No.1. During the pendency of a suit for Declaration with consequential relief ie. declaration of",
  "title of the disputed property along with permanent injuncticr “ied by A against B , B",
  "apprehends that A js intending and trying tc part with the possession of the disputed",
  "property. B in his defence given in the written statement claims owrizrship of the",
  "disputed property on the basis of a registered saie desd. in “his situation , discuss and",
  "explain the jawfui remedy available to B .",
  "Q.No.Z Write short notes on: .",
  "1. Subsequent pleadings",
  "2. Alternate Dispute Resolution",
  "3. Attachment before Judgement",
  "4. Issues of Law and issues of facis",
  "5. Grounds for rejection and return of plaint",
  "Q.No.3 Narrate the procedure of execution of a maney decres bv arrest and detenticr of the",
  "judgement debtor. ’",
  "PARTI ’",
  "Q.No.4 Elaborate the duties and powers of a registering officer under t@e Registration Act, 1908.",
  "Q.No.5 Discuss the remedy or remedies avaiable ic # zersor’in case £-sub registrar refuses to",
  "register a document. .",
  "© PART};",
  "Q.No.6 Explain in detail the categories of cases where injunction cen ke refuzed by the court.",
  "|",
  "Q.No.7 Desuiitz all category oF sxses giver nn Sector 7 of the Court fee Act, i870 along with",
  "the mode of levying coun Tes.",
  "EART-V",
  "Q.No.8 Exclusion of Juiiszicticn of Civil courts in matters within the jurisdiction of Revenue",
  "officers. Discuss.",
  "Q.Nc.9 Write short notes on:",
  "1. Periodical reccrds",
  "2. Assessment of _aind revenue",
  "3. Appeal, Review. ana Ravision",
  "4. Villages officers",
  "5. Arbitration",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020",
  "PAPER —ill --—--—-CRIMINAL LAW",
  "TIME ALLOWED: 3 HOURS TOTAL MARKS: 100",
  "NOTE: (i) Attempt FIVE questions selecting TWO each from PART-I & PART-",
  "Il and ONE from PART-II",
  "{ii) All questions carry equal marks",
  "PARTI",
  "Q. No.1 Write short notes on the following:",
  "fous",
  "(i) Falsus in uno falsus in omnibus (ii) Actus rea & mens rea",
  "(ii) Accused a favourite child of law (iv) Wrongful gain and wrongful loss",
  "{v) Solitary confinement",
  "Q. No.2 How and under which provisions of law a previously convicted accused can",
  "be punished with enhanced sentence, whether section 75 of Pakistan Penal Code",
  "1860 is applicable in cases of control of narcotic substances Act 1997?",
  "Q. No. 3 Discuss;",
  "(i) The acts against which there is no right of private defence",
  "(if) When the right of the private defence of the body extends to causing death and",
  "any harm other than death.",
  "(ii)Commencement and continuance of the right of private defence of: (i) body & (ii)",
  "property",
  "PART-II",
  "Q. No 4 How proclamation for a person absconding is made? When and how",
  "property of person absconding is attached? How the attached property can be",
  "restored? What is the remedy provided if application for restoration of attached",
  "property is rejected?",
  "Q. No. 5 Can a person required to execute a bond be permitted to deposit a sum of",
  "money fixed by the court, in lieu of executing such bond if yes, in which cases and",
  "under what provision of law? What procedure on forfeiture of bond is provided under",
  "the law? To whom appeal lies against the orders passed by a magistrate under",
  "section 514 of The Code of Criminal Procedure, can such order be revised?",
  "Q. No 8 In which cases no appeal against conviction and sentence lies under the",
  "Criminal Procedure Code 1898. Also discuss section 415 of the said code.",
  "PART lll",
  "Q. No.7 Discuss report of probation officer, powers of Juvenile Court to order for",
  "release of a juvenile. and the orders that cannot be passed with respect to a juvenile",
  "in the light of sections 14, 15 & 16 of The Juvenile Justice System Act 2018.",
  "Q. No. 8 Define the following terms as provided in the Juvenile Justice System Act",
  "2018",
  "(a) “Guardian” (b) “heinous offence” (c) “Major offence”",
  "(d) “Minor offence” (e) “Juvenile” (f) “Observation Home”",
  "(9) “Best interest of the child” (n) “Suitable person”",
  "(i) “Juvenile Justice Committee”  (j) “Juvenile rehabilitation Centre”",
  "«>",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020",
  "PAPERV ----——— GENERAL LAW",
  "NOTE:",
  "i) Attempt FIVE questions, selecting TWO questions from PART-l and ONE each from",
  "PART-II, Il and IV.",
  "if) All questions carry equal marks.",
  "PART-|",
  "Q.No.1. Define hostile witness. What happens if somecne is declared a hostile witness? Also,",
  "describe modes of impeaching one’s own witness.",
  "Q.No.2. The usage of technology in judicial proceedings can yield better results. Discuss, with ~~",
  "reference to provision of Qancon-e-Shahadat 1984, if any.",
  "Q.No.3. Is it a valid excuse for a witness to make, when refusing to answer a question that such",
  "answer will criminate him? Is there any exception to this rule, if yes, then how that protection is",
  "to be claimed?",
  "PART",
  "Q.No.4. Critically evaluate the role of the head of the government under the constitution of",
  "Islamic Republic of Pakistan, 1973.",
  "fiovincial, ) » Co",
  "Q.No.5. utonomy is the long persisting demand of the smaller provinces in",
  "Pakistan. In your opinion to what extent did the Constitutional (18th Amendment) Act, 2010,",
  "satisfy the said demand",
  "PART-II",
  "Q.No.8. Is a court obliged to award enhanced punishment to habitual offender, if not then",
  "describe the exception{s). What is the procedure for magistrates not competent to award",
  "enhanced punishment and when the magistrate cannot punish adequately? oT",
  "aN",
  "Q.No.7. Give an account of rules/regulations prescribed by chapters 7-A, 7-B vel-4#of RULES",
  "and ORDERS OF THE LAHORE HIGH COURT, LAHORE, regarding preservation of wills and",
  "keys of safes.",
  "PART:IV",
  "Q.No.8. Enumerate classes of courts as well as their pecuniary and local jurisdiction under the",
  "Punjab Civil Courts Ordinance, 1962. '",
  "Q.No.9. Which is the principal court of original jurisdiction? And which court has the prerogative",
  "for the distribution of judicial work? Discuss. .",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020",
  "PAPER —V ---—---— ENGLISH —",
  "130",
  "TIME ALLOWED: 03 HOURS TOTAL MARKS: 160°",
  "Q.No.1 Discuss the three possibilities for the world narrated by Bertrand Russell in his essay {25)",
  "“The Future of Mankind”.",
  "OR",
  "According to Bacon “Studies serve for delight, for ornament and for ability”. Discuss.",
  "Q.No.2 Write an essay on ONE of the following topics. (30)",
  "{a) Islam a code of life {b) Gender equality is a myth",
  "(c) Truth is lived ,not taught (d) Expanding Information Technology ; a curse or blessing",
  "(e) Democracy and illiteracy do not move together .",
  "Q.No.3 Write a letter to your pen friend living abroad explaining him the Legal /Judicial System of",
  "Pakistan. (Please make sure that Name, Roll No. etc is not given in the letter). (25)",
  "Q.No.4 Read the following passage and answer the questions given at the end :",
  "Of all the characteristics of ordinary human nature envy is the most unfortunate ; not only does",
  "the envious person wish to inflict misfortune and do so whenever he can with impunity, but he is",
  "also himself rendered unhappy by envy . Instead of deriving pleasure from what he has , he",
  "derives pain from what others have . if he can , he deprives others of their advantages ,which to",
  "him is as desirable as it would be to secure the same advantages himself. If this passion is",
  "allowed to run riot it becomes fatal to all excellence , and even the most useful exercise of",
  "exceptional skill. Why should a medical man go to see his patients in a car when the labourer",
  "has to walk to jt€ Work? Why should the scientific investigator be allowed to spend his time in a",
  "warm room when others have to face the inclemency of the elements? Why should a man who",
  "possesses some rare talent of great importance to the world be saved from the drudgery of his",
  "own housework ? To such questions envy finds no answer. Fortunately , however, there is in",
  "human nature a compensating passion , namely that of admiration . Whosoever wishes to",
  "increase human happiness must wish to increase admiration and to diminish envy.",
  "What cure is there for envy ? For the saint there is the cure of selflessness , sien in the",
  "case of saints envy of other saints is by no means impossible. But, leaving saints out of",
  "account, the only cure of envy in the case of ordinary men and women is happiness , and the",
  "difficulty is that envy is itself a terrible obstacle to happiness ?",
  "Gé J",
  "na",
  "—",
  "74",
  "But the envious man may say: ‘What is the good of telling me that the cure of envy is happiness.",
  "| cannot find happiness while | continue to feel envy ,and you tell me that | cannot cease to be",
  "envious until | find happiness’. But real life is never so logical as this. Merely to realize the cause",
  "of one’s own envious feeling is to take a long step towards curing them .",
  "(a) Write a précis of the above passage and also suggest a suitable title. (18)",
  "(b) Translate the above passage into Urdu . 18)",
  "{Q.No.5 Rewrite the following dialogues in continuous narrative in reported speech (indirect) throughout:",
  "(10)",
  "‘Really, what has got into you all today?’ said Professor McGonagall, turning back into herself",
  "with a faint pop , and staring around at them all. ‘Not that it matters, but that's the first time my",
  "transformation’s not got applause from a class’. Everybody's heads turned towards Harry again,",
  "but nobody spoke. Then Hermione raised her hand. ‘Please, Professor, we've just had our first",
  "Divination class, and we were reading the tea leaves, and-' ‘Ah, of course’, said professor",
  "McGonagall, suddenly frowning. ‘There is no need to say any more, Miss Granger. Tell me,",
  "which of you will be dying this year?\" .",
  "Q.No.6 Insert commas, semi-colons, colons and any other marks of punctuation , where necessary, in",
  "any five of the following sentences: {10)",
  "(a) nor should the hindus fear that the creation of autonomous muslim states will mean the",
  "introduction of a kind of a religious rule in such state | have already indicated to you the",
  "meaning the word religion as applied to islam.",
  "(b) man is neither impotent nor omnipotent he has powers and his powers are surprisingly great but",
  "they are not so great as he might wish.",
  "(c) where they all come from these people i cannot imagine but there they are and more and more",
  "of them | find the very trains up to town uncomfortably crowded these days",
  "(d) twenty four years ago he writes i left an england sedate complacent and very well to do i have",
  "returned to find that she is poor harassed and continually taking herself to task.",
  "(e) well i must say the farmer took the whole thing like a gentleman gentleman farmer i suppose",
  "youd call him and he said well look we had better go in and have a drink and wait until the",
  "missis turns up.",
  "f) the object of writing is to say something we want to say in other words to convey meaning this",
  "which should be an easy task is considered by most people to be fraught with difficulty.",
  "(g) there is no reason why we should not hope to see free ample and lovely exercise in the open air",
  "brought within the reach of every human being there can be no limit to the beneficial extension",
  "of athletics.",
  "Q.No.7 Construct sentences to distinguish between the meanings of any FIVE of the following pair (10)",
  "of words { No credit will be given for single correct sentence).",
  "(a) Ingenious, Ingenuous (b) Placable, placeable (c) Virtuous , virtual",
  "(d) Corporal, corporeal (e) Altar , Alter (f) Bear, bare",
  "2",
  "{g) Confident, confidant {h) Pour, pore (i) Appraise, apprise",
  "Q.No.8 Write sentences illustrating the use of FIVE of the following idiomatic phrases: (10)",
  "(i) A blue stocking (ii) Apple pie order {iii) A fresh water sailor",
  "{iv) Alpha and Omega (v) Be cast down (vi) Call names",
  "{vif) Holdjoref {viii} Through thick and thin",
  "3",
  "EE",
  "$3",
  "EN",
  "EAN",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES )",
  "COMPETITIVE EXAMINATION, 2020",
  "Vira",
  "PET J JP% 33 VB puai",
  "*) EH pain gg i (pul mi gop Elks J £00 Yad Jl pa",
  "Sb ugh culpa (1) adh 3383 193 23) oie (i)",
  "Cah 8 sake sly Guy £5 04 (iv) har 3 clad sh Cons (1)",
  "8 on 8 8 (aS esl og) al SE fal 5 8 Yad Js",
  "[ARV ARE AN SS fa oS BU (Se",
  "dire dt fF",
  "FE LEfA di,",
  ", IAL fer Lud",
  "uF Ep VIA ig",
  ". we dtlda",
  ") GEpwd Add",
  "[RCE ERI]",
  "wzewfdivie",
  "LL Spurl 587",
  "gy udr bd :",
  ": BUUREN",
  "Gb oJaiv dpe poli PT JO",
  "Stas gdth x maja) .ix Ge viii vail sa sayi",
  "PTO ©",
  "mn 5 3d 1) 0 5 «in USAT 50 08 9 os Jism",
  "(0) +0110",
  "LEASE 405 PV) gif es ot Io S”",
  "’ Fit Se Geers iS drcni¥ ting -¢- 3 Sud",
  "Sep pS LW AL len ShiT an Ent Jy f",
  "nn fg ia Liaise Our 2 LS he Le",
  "og gd Lrg 2 Ff Gia Patt Ln",
  "We EES en Latics ff —y Fn",
  "Shodidn iy af -¢ dng/ oF rite fxs",
  "<b WL mtes ub —e Cyt nag f Se Jo",
  "jep-uALuie AFL bk Tey -¢ SOFYY",
  "vif uo —eb FE ep Loh sai 2 fii",
  "oo Seplnf MBS Te",
  "(10) 5 pork us) const 5g oa (A a JBN gf Gl uglaa dS Et ad Glas",
  "Aigg meme 1 5308 6308 1 Mig ween WS Lp GE ID (meee SR",
  "PEPE SUE PT SUPE? IRC FAPPORIY. Jr 35 FP J J CH PEW",
  "et HSS meme 58 oad] la il 28 Ty DM (8 meme JE Ay (Sg B0 il",
  "BESTT PEP PITS. PO JF ¥+ [CSTPRE PL UL JP JUNI J FYE JPL SOR",
  "(Xepette ZA Eg pala 5 93 (us on 3a Lr US E00 +8 ad J) ges",
  "dl fla hs 4p 215400",
  "vad salads sig",
  "-—>",
  "LAHORE HIGH COURT, LAHORE",
  "CIVIL JUDGES CUM JUDICIAL MAGISTRATES",
  "COMPETITIVE EXAMINATION, 2020",
  "PAPER-VI| --—-—----- GENERAL KNOWLEDGE )",
  "TIME ALLOWED: 03 HOURS TOTAL MARKS: 100",
  "NOTE:",
  "(i) Question No. 1 and 2 are compulsory.",
  "(ii) Attempt ONE question from each part.",
  "(iii) All questions carry equal marks.",
  "Q.No.1. Choose the correct answers. Do not reproduce the question.",
  "a) What is viticulture?",
  "(i) Cultivation of spices (iii) Cultivation of small plants",
  "(ii) Cultivation of grapes (iv) Cultivation of tobacco",
  "b} Which cloud is likely to cause heavy rainfall?",
  "(i) ~~ Nimbo-stratus (iii) Strato cumulus",
  "(iy  Cirrocumulus (iv) Stratus",
  "¢) Anemometer is an instrument used to:",
  "(i) Find the wind direction (iii) Measure pollution",
  "(il) Measure wind speed (iv) Low pressure",
  "d) Name the device that is used to measure humidity",
  "(i) Hydrometer (iii) Hygrometer",
  "(i) ~~ Galvanometer (iv) Hexameter",
  "e) The brightest star in the sky is:",
  "(i) Hayes (iii) Praesepe",
  "(ii) Sirius (iv) Sun",
  "f) ‘Parsec’ is the unit of measurement of:",
  "(i) Astronomical distance (iii) Orbital velocity of stars",
  "(ii) Density of stars (iv) None of these",
  "g) The doldrums is an area of:",
  "{) Low temperature (iii) Low rainfall",
  "(iy Low pressure (iv) Low humidity",
  "h) Beaufort scale is used to measure:",
  "(i) Air pressure (iii) Wind direction",
  "(ii) Wind velocity (iv) Humidity",
  "i) The dry wind ‘Santa ana’ blows in:",
  "(i) Siberia (iii) California",
  "(ii) Argentina (iv) Switzerland",
  "j) One fathom is equal to:",
  "{) 08 metre (iit) 60 feet",
  "(ii) 08 feet (iv)100 centimetres",
  "1",
  "k) How many litres are there in one dekalitre?",
  "MH 10 (iii) 15",
  "i 12 (iv) 18",
  "1) At the core of the Earth, the temperature is estimated to be around:",
  "(i) 1000-degree Celsius (iii) 2000 degree Celsius",
  "(ii) ~~ 1500-degree Celsius (iv) 2500 degree Celsius",
  "m) Which of the following is a dormant volcano?",
  "(i) Etna in Sicily (iii) Vesuvius in aly",
  "(i) Stromboli in Sicily (iv) Mount Popa in Myanmar",
  "n} The weight of an average human male brain is about",
  "(i) 1kg (iii) 1350 grams",
  "(i) 1200 grams (iv) 1500 grams",
  "0). The total number of bones in human skull is:",
  "(iy 08 (iii) 30",
  "(i 12 (iv) 34",
  "p} A reptile with a four chambered heart is:",
  "(iy Snake (iii) Crocodile",
  "(iy Turtle (iv) Lizard",
  "q) The element found on the surface of the moon is:",
  "(i Tin (iii) Titanium",
  "(iy Tantalum (iv) Tungsten",
  "r) Burkina Faso is the new name of:",
  "(iy Greenland (iii) Upper volta",
  "(iy Folk land (iv) Lower voita",
  "s) Which country is called ‘cockpit of Europe’?",
  "(i) Switzerland (iii) Austria",
  "(ify West Germany (iv) Belgium",
  "t) Trypanophobia is fear of:",
  "(i) Heights (iii) Injections",
  "(ify Dogs (iv)Spiders",
  "Q.No.2. Choose the word or phrase you consider nearest in meaning to the keywords.",
  "a) Parry",
  "i) Return (iii) delay",
  "ii) Discuss (iv) ward off",
  "b) Apathetic",
  "i) Not interested (iii} Emotional",
  "ii) Indifferent (iv)thorough",
  "¢) Anathematize .",
  "i) Locate (iii) Deceive",
  "ii) Regulate (iv) radiate",
  "d) Ascetic",
  "i) Agood natured (iii) Simpleton",
  "ii) Self-induigent (iv) Puritan",
  "2",
  "e) Permeable",
  "i) Perishable (iii) Plodding",
  "iy Effective (iv) penetrable",
  "f) Pejorative",
  "iy Causing to inundate (iii) Causing to deteriorate",
  "iy ~~ Declaiming (iv)delighting",
  "g) Euphuist",
  "i) Abusive language (ii)Graceful language",
  "ii) Sober language (iv) High-flown language",
  "h) Charlatanism",
  "(iy Commerce (ily knavery",
  "(iy  Quackery (iv) charity",
  "i} Equanimity",
  "i) Luxury : (iii) Placidity",
  "ii)  Joyousness (iv) enchantment",
  "j) Coquetry",
  "i) Hatred (iii) Deceitfulness in order to attract others",
  "iy Jealousy (iv) Manifestation of love in open",
  "k} Effervescence",
  "i) Readiness (iii) Extreme excitement",
  "ii) Immortality (iv) glory",
  "1) Chagrin",
  "i) Annoyance (iii) Affliction",
  "ii) Delight (iv)grief",
  "m) Mendacity",
  "i) Tendency to lie (iii) Tendency to hoodwink",
  "ii) Tendency to overlook (iv) Tendency to act spontaneously",
  "nj Prevarication",
  "iy Concealment of true character (iit) Evasion from truthfulness",
  "ii)  Dogmatism (iv) Drunkenness",
  "o} Knavery",
  "iy  Distinctness (iii) Dishonesty",
  "ii) Honesty (iv)Disillusionment",
  "p) Bovine",
  "i) Pertaining to rats (iii) Pertaining to cattle",
  "ii) Pertaining fo dogs (iv) Pertaining to man",
  "q) Slothfuf",
  "i) Angry (iii) Quist",
  "iy Lazy (iv)peaceful",
  "r} Mite",
  "i) ~ Happy (iii) Small",
  "iy Strong (iv)quote",
  "s} Inclement",
  "i) Deny (iii) Increase",
  "ii) Dispose (iv)rough",
  "t) Impetuosity",
  "i) Talking politely (iii) Talking excitedly",
  "3",
  "ii) Rushing upon violence (iv) Attacking unmindfully",
  "PART-l",
  "Q.No.3. Population explosion in Pakistan is constant threat to its economy. Discuss.",
  "Q.No.4. Choose the correct answers:",
  ". i) Inwhich year, the religious scholars gave verdict that India was ‘Dar-ul-Harab'?",
  "(a) 1918 (€)1920",
  "(b) 1930 (d)1928",
  "ily Give the date of bloodshed in Jallianwala Bagh, Amritsar.",
  "(a) April 13, 1919 (c) June 10, 1917",
  "(0) May 15, 1918 (dy July 25,1920",
  "ili) After the event of Chauri Chaura, which party left the Muslims?",
  "(a) Congress (c) Muslim league",
  "(b) Suraj (d) Arya samaj",
  "lv)  Sangthan movement was started by:",
  "(a) Dr. Moonje (c) Swami Shardanandh",
  "(b) Hargopal {d) none of these",
  "Vv)  Mopia Revolt was made in the year:",
  "(a) 1910 (c) 1916",
  "(b) 1912 {d) none of these",
  "vi) Lucknow Pact was made in the year:",
  "(a) 1914 (c) 1912 .",
  "(vb) 1916 (d) 1920",
  "vii) When Lord Dalhousie proclaimed the annexation of the Punjab?",
  "(a) 1852 {c) 1849",
  "(b) 1851 {d) 1845",
  "viii) When Radcliffe Award was pronounced?",
  "(a) June 14, 1946 (c) August 15, 1947",
  "(b) April 14, 1947 {d) July 10, 1948",
  "ix) Mr. Jinnah left congress in the year:",
  "(a) 1818 (c) 1922",
  "(b) 1820 (d) 1923",
  "x) The Third Round Table Conference was held in:",
  "(a) 1830 {c) 1932",
  "(b) 1831 (d) 1933",
  "xi) When Pakistan day was celebrated in Quetta?",
  "(a) March 23,1941 (c) Aprif 20, 1939",
  "(b) March 20, 1940 (d) August 20, 1942",
  "xii) When first session of Muslim student's federation was held?",
  "(a) 1930 (c) 1937",
  "(b) 1934 (d) 1940",
  "xiii) How many rivers flow in Baluchistan?",
  "(a) 08 {c) 10",
  "{b) 12 (13",
  "4",
  "xiv) Which range of Pakistan is called Roof of the world?",
  "(a) Pamir (c) Himalayas",
  "{b) Kara Kurum {d) none of these",
  "xv) What is meant by word Karakorum?",
  "(a) Valley (c) mountain pass",
  "(b) Pass (d) crumbling rock",
  "xvi) The longest tunnel of Pakistan is:",
  "(a) Khojak (c) Kalabagh",
  "(b) Tarbela (d) Khyber",
  "xvi) How many peaks are in the area of Pakistan?",
  "(a) 62 (c) 82",
  "(0) 72 (d) 92",
  "xviii) How many airports are there for public use in Pakistan?",
  "(a) 45 (c) 42",
  "(b) 47 (d) 44",
  "xix} The height of Tirch Mir is:",
  "(a) 6500 meters (c) 7708 meters",
  "(b) 8600 meters (d) 8000 meters",
  "xx) How many rivers flow in province KPK?",
  "(a) 08 (cy 12",
  "(b) 10 (13",
  "PART-il",
  "Q.No.5. Define cold war. is there any difference between cold war and détente? Also comment",
  "on origin and causes of cold war.",
  "Q.No.6. what does ‘Diplomacy’ mean? Describe the stages, functions of diplomacy and",
  "difference between diplomacy and foreign policy. -",
  "PART-Iil",
  "Q.No.7. Describe the importance and philosophy of Fasting (SAUM). Also, explain its individual",
  "and collective benefits.",
  "Q.No.8. Four possible answers a, b, ¢ and d are given against each statement. Choose the right",
  "option.",
  "i} The number of the prophets whose names are in Holy Quran is:",
  "(a) 10 (©) 35",
  "(b) 25 (d) 45",
  "ii} Identify the number of surahs in the Holy Quran which are on the names of",
  "various prophets",
  "(a) 04 (c) 08",
  "(b) 06 (d) 10",
  "iii) How many sahaif were revealed to Hazrat Ibrahim (A.S)?",
  "(a) 10 (c) 07 .",
  "(b) 03 (d) 06",
  "iv) How many sahaif were revealed to Hazrat Idrees (A.S)?",
  "(a) 10 (¢) 30",
  "5",
  "(0) 20 (d) 40",
  "v) Who was called Abul Bashir Sani?",
  "(a) Hazrat Adam (A.8) (c) Hazrat torahim (A.S)",
  "(b) Hazrat Nuh (A.S) (d) Hazrat Musa (A.S)",
  "vi) The mountains would break by the miracle of:",
  "(a) Hazrat Yousaf (A.S) (c) Hazrat Yagoob (A.S)",
  ": (b) Hazrat Ishaque (A.S) (d) Hazrat Yahya (A.S)",
  "vii} Who woke up again after sleeping for 100 years?",
  "(a) Hazrat Uzair (A.S) (c) Hazrat Musa (A.S})",
  "{b) Hazrat Saleh (A.S) {d) Hazrat Imran (A.S}",
  "viii} The first biography of the life of Prophet (PBUH) was written by:",
  "a) lbne Ishaque (c) lbne Hisham",
  "b) Al Zargali (d)Al Wargidi",
  ". ix} Who was the spoken son of Holy Prophet (PBUH)?",
  "a) Ibne Hisham (c) Zaid bin Harisa",
  "b) Saad bin Abi Wagas (d)Ugba bin Nafah",
  "x} The word ‘Khatmun Nabiyeen’ is mentioned in Surah:",
  "a) lkhlaas (c) Al-Maidah",
  "b) Al-Baqgarah {d) Al-Ahzab",
  "xi) The method of ‘Ablution’ is in Surah:",
  "a) Al-Bagarah (c) Al-Maidah",
  "b) Al-Noor (d) A-Nisa",
  "xii) The episode of Hijrat is mentioned in Surah:",
  "a) At-Tauba {c) Yasin",
  "b) At-Tarig {d) Al-e-Imran",
  "xiii) During the orthodox caliphate, who had the longest tenure?",
  "a) Hazrat Ali (R.A) (¢) Hazrat Usman (R.A)",
  "b) Hazrat Umar (R:A) (d) Hazrat Abu Bakr Siddique (R.A)",
  "xiv) Hazrat Ali (RA) was martyred in:",
  "a) 35 Hijri (c) 40 Hijri",
  "b) 45 Hijri (d) 50 Hijri",
  "xv) The commander of Muslim Army in battle of Qadisiya was:",
  "a) Hazrat Amr bin Al-Aas (c) Hazrat Muavia",
  "b) Hazrat Saad bin Abi Waqas (d) Hazrat Khalid bin Waleed",
  "xvi) Which of the following wives of the Holy Prophet (PBUH) gained the title of ‘The",
  "Mother of poor’?",
  "a) Hazrat Khadija (R.A) (c) Hazrat Ayesha (R.A)",
  "b} Hazrat Mamoocna (R.A) (d) Hazrat Zinab Bint-e-Khuzaima (R.A)",
  "xvii) Who is called ‘Muslim Alexander’?",
  "(a) Hazrat Khalid bin Waleed (¢) Hazrat Saad bin Abi Wagas",
  "(b) Hazrat Ugba bin Nafah (d)Hazrat Amar bin Al-aas",
  "xviii) Heads of Zakat are mentioned in surah:",
  "(a) Al- Quraish {c) Al-e-Imran",
  "(b) At-Tauba (d) Al Baqarah",
  "xix) The total number of Makki surahs are:",
  "(2) 80 {c) 86",
  "(b) 88 (d) 92",
  "6",
  "xx) What is the significance of 27\" Rajab?",
  "(a) Holy Prophet's visit to Taif (c) Migration from Makka to Madina",
  "(b) Hazrat Hamza embraced Islam (d) Mairaj shareef",
  "For Non-Muslim Candidates",
  "s Does family contribute in the promotion of moral values?",
  "+ Do you think that the culture of tolerance can help bring/develop interfaith harmony?",
  "7"
]