[
  "Cross Examination",
  "Nauman v Samsung Electronics etc.",
  "Theme No. 1: Professional loss/ other loss due to virus",
  "1. you are a prudent, busy, and reputed lawyer, correct?",
  "2. you are reasonably busy with work and other activities, correct?",
  "3. your mobile usage is for work and other activities as well, correct?",
  "4. you manage your own work schedule, correct?",
  "5. you proactively manage any issues related to your client or yourself, correct?",
  "6. you found minor defects with your phone, correct?",
  "7. you ignored them and kept on using your phone, correct?",
  "8. the reason for your ignorance was that it does not affect your usage, correct?",
  "Al ternate theory: it is a possibility that you downloaded a file or accessed website, which inadvertently downloaded a virus on your phone, correct?",
  "Put Case: …………. You knew that a virus or bug may have been downloaded on your phone, which is causing you trouble, isn’t?",
  "Theme No. 2: Defects in uses",
  "1. issue at contention occurred in your phone on 13.05.23, correct?",
  "2. the issue was related to talking and listening to radio, and music, correct?",
  "3. therefore, issue was with range of the volume, correct?",
  "4. you are an active person, correct?",
  "5. you always keep your phone with you, correct?",
  "6.  you use hand-free with wire, correct?",
  "Alternate theory: it is a possibility that at certain occasions while running or walking quick to reach a destination may have inadvertently drop the phone, which caused the issue?",
  "Put Case: …… Now you are claiming it through warranty to have it fixed for free, isn’t?",
  "Theme No. 3: Legal notices,",
  "1. on 15.05.2022, you contact Samsung helpline, correct?",
  "2. you were directed to contact Samsung helpline, correct?",
  "3. however, you visited Samsung customer service shop in Hassan Tower, correct?",
  "4. they charged you Rs. 2000/- for re installing a new software, correct?",
  "5. after that you visited Younis Mobile for replacement of the handset, correct?",
  "6. you were told that they are not the official or recognized dealers of the Samsung mobile, correct?",
  "7. Once your grievance was not address, it naturally made you frustrated and angry, correct?",
  "8. you realised that your phone’s warranty will be over by 19.06.2023, correct?",
  "9. you quickly issued three legal notices to appropriate authorities, correct?",
  "10. you institute the suit as quick as after 2 days of last legal notice sent on 16.062022, correct?",
  "11. In haste you missed some points in your plaint, correct?",
  "12. for which you applied vied application under order 6, rule 17, correct?",
  "13. You also missed to plead certain authorities in your plaint, correct?",
  "Alternate theory: it is a possibility that you have paid Rs. 2000 to fix a bug in your phone, and now in order to claim that, you have instituted a frivolous case against the defendant, correct?",
  "Put Case: ……. You were frustrated and angry due to less than expected performance of the phone and having to extra amount to fix some issues with your phone you instituted this frivolous suit to black mail",
  "Final Shot: ………..and extract a new phone and some money out of it, to buy a new expensive phone."
]