[
  "Re:-",
  "MD Foysal Khan",
  "Subject matter: letter in response to request for termination of renewed lease agreement and/or eviction from the rented unit.",
  "Dear Michael Lynch,",
  "I am writing this email in response to your request to terminate the renewed lease early and/or eviction from the rented unit. It is unfortunate that our communications/negotiations fell apart related to delivery of renewed lease agreement. However, I raise a dispute related to the above cited matter on the following grounds-",
  "1. that via email dated 04.05.2023, you made the demand for increase in rent amount to €800, from 01.06.2023, which was the explicit term of negotiation in the renewal of the lease agreement. However, the email exchanged on 11.05.2023 shows that as per negotiations with Mr. Williams first rent payment with the new rent amount will be paid from 01.07.2023, which is the explicit term in the renewed lease agreement. In the same email, I further requested for drawing and delivering of the renewed lease agreement with the similar terms as were scribed in the previous lease agreement except the rent amount. I also demanded maintenance of certain fixtures and fittings before renewed lease agreement could be effective from 01.07.2023, which is also the explicit term of the renewed lease agreement.",
  "2. That you assured me via email dated 21.05.2023 that I will receive the renewed lease agreement as soon as it is ready, which will be enforced from 01.07.2023. It is clearly inferable from the email that I am sure to receive the renewed agreement within reasonable time. In response to the latter email, I wrote via email dated 21.05.2023, requesting your visit, for inspection of any maintenance that was your responsibility as a landlord to complete before the renewed lease will take effect. In response to the latter email, you wrote via email dated 31.05.2023, that one of the people from your business/company will visit the shop for inspection of the required maintenance and you asked for the address that your solicitor(s) needed to scribe on the new lease agreement. Which solidify your assurance to me that I have secured the renewed lease agreement. In response to the latter email, I sent an email dated 31.05.2023, providing information related to my new business venture and address that needed to be scribed on the lease agreement. In the following emails dated 01.06.2023 respectively, you again reassured me that the renewed lease agreement is secured and I must carry on building up the new business venture, intended to be ran from the rented unit.",
  "3. That however, after many requests for updates on delivery of renewed lease agreement, you sent the email dated 13.06.2023, which cited your solicitor’s fault for delay in sending/providing renewed lease agreement, which was not reasonable/sufficient reason but I ignored it, given our long landlord and tenant relationship. Further in the same email, you cautioned me against making any changes in the unit until the lease is signed, which was not feasible for my new business. As you are professional, you must understand I have made an investment in the new venture, including paying the rent on the unit. The longer the unit is shut and/or non-operational, the greater the loss that I would have suffered. If I can’t fulfil the purpose of renting the unit on higher rent, then why should I even have it. Therefore, as any reasonable prudent business man would do, I started renovating the unit as per my new venture’s requirement.",
  "4. That further emails exchange dated 06.07.2023, 07.07.2023, 08.07.2023 and 10.07.2023 respectively, provided that your solicitors even on your command, after more than 2 months of email communications, did not send/provided me and/or you the renewed lease agreement, which is completely unreasonable, unprofessional, and unethical as a business professional.",
  "5. That currently, you have threatened me with the eviction and/or termination of the renewed lease on the unit, ostensibly citing change in ownership. It is to remind you that you have orally and/or in writing assured me that renewal of my lease is inevitable/definite and signing the renewed lease agreement was just a formality to form enforceable legal relations, therefore, relying on the assurance provided I paid the new rent according to the renewed lease agreement and invested substantial amount of my capital on renovating the unit, therefore, eviction and/or termination of the renewed lease, this early, will bring me irreparable loss, injury & detriment (monetary and/or non-monetary), which I cannot afford to suffer given my family and social status.",
  "Therefore, I reserve the right to claim relief from the Honourable Circuit Court as per Landlord and Tenant (Amendment) Act 1980 but I am open to any reasonable alternate resolution to the current dispute.",
  "Regards,",
  "MD Foysal Khan"
]