[
  "The Pakistan Arms Ordinance, 1965 CONTENTS  CHAPTER I PRELIMINARY  Sections 1. Short title, extent and commencement 2. Exception 3. Definitions CHAPTER II SALE AND REPAIR 4. Unlicensed sale and repair prohibited  CHAPTER III TRANSPORT  5. Power to prohibit transport 6. Power to establish searching posts 7. Arrest of persons conveying arms, etc. under suspicious circumstances  CHAPTER IV GOING ARMED AND POSSESSING ARMS, ETC.  8. Prohibition of going armed without licence 9. Unlicensed possession of arms etc. 10. In certain cases arms to be deposited at police station or with licensed dealers  CHAPTER V LICENCES  11. Power to make rules as to licences 11 -A. Power of the Federal Government",
  "11 -B. Prohibition of keeping, carrying, or displaying 12. Cancellation and suspension of licences  CHAPTER VI PENALTIES  13. Penalty for breach of Sections 4, 5. 8 to 11 13-A. Penalty for breach of Section 4 in respect of cannon or automatic weapon, etc. 13-B. Penalty for breach of Section 8 or Sec. 9 in respect of cannon or automatic weapon, etc. 14. Certain breaches of Sections 4. 5, 9 and 21 14-A. Certain offences triable by Magistrates 15. Breach of licence 16. Knowingly purchasing arms, etc., from unlicensed persons 17. Penalty for breach of rules 18. Penalty for failure to give information under Section 23 19. Penalty for refusing or neglecting to produce arms 20. Power to confiscate  CHAPTER VII MISCELLANEOUS  21. Search and seizure by Magistrate 22. Seizure and detention by Government 23. Information be given regarding offences 24. Searches in the case of offences how conducted 25. Operation of other laws not barred 26. Power to take census of arms 27. Power to exempt 28. Notice and limitation of proceedings",
  "29. Repeal  The Pakistan Arms Ordinance  (XX OF 1965)  [8th June, 1965}  An Ordinance to consolidate and amend the law relating to the sale, transport; bearing or possession of arms, ammunition or military stores  Preamble:   Whereas it is expedient to consolidate the law relating to the sale, transport, bearing or possession of arms, ammunition or military stores, in the manner hereinafter appearing; And whereas the Provincial Assembly of West Pakistan is not in session and the Governor of West Pakistan is satisfied that circumstances exist which render immediate legislation necessary ; Now therefore in exercise of the powers conferred on him by clause (1)of Article 79 of the Constitution, the Governor of West Pakistan is pleased to make and promulgate the following Ordinance :—  CHAPTER 1 PRELIMINARY  1. Short title, extent and commencement:   (1) This Ordinance may be called the Pakistan Arms Ordinance, 1965. (2) It extends to the whole of Pakistan except the Tribal Areas, (3) It shall come into force at once.  2. Exception   : Nothing contained in this Ordinance shall apply to— (a) arms, ammunition or military stores on board any sea-going vessel and forming part of her ordinary armament or equipment; or (b) the sale/transport, bearing or possession of arms, ammunition or military stores by order of the Federal Government or a Provincial Government, as the case may be, or by a public servant or a member of any of the non-regular forces raised or maintained by or under the authority of the Federal Government or a Provincial Government, in the course of his duty as such public servant or member.  3. Definitions:   (1) In this Ordinance, unless the context otherwise requires, the following expressions shall have the meanings hereby respectively assigned to them, that is to say—",
  "(a)\" ammunition\"   includes- (i) ammunition of all types or light and heavy automatic weapons, revolvers, pistols, rifles, carbines, muskets and shotguns; (ii) ammunition constructed and modified for firing projectiles or gas or smoke containers; (iii) gun wads, gun flints, percussion caps, fuses, friction tubes and detonators; (iv) all types of grenades, bombs, rockets, mines and fuels for flame throwers ; (v) all types of explosives, fulminating material and propellants, including all articles specially designed for torpedo operation and charges ; (vi) all parts of ammunition, but does not include lead, sulphur or saltpeter; (b) \" arms\"   includes— (i) cannon; (ii) fire-arms of all types, such as light and heavy automatic and semiautomatic weapons, rifles, carbines, muskets, shotguns (whether single or double barreled), revolvers, pistols and appliances the object of which is the silencing of fire-arms; (iii) air pistols, bayonets, swords, sword-sticks daggers, knives with blades of four inches or more (but not kitchen knives or knives used in good faith for the carrying on of a profession and flick- knives irrespective of the blade ; (iv) knuckle-dusters, spears, spear-heads, bows and arrows and parts of arms ; (c)   \"cannon\"   includes— (i) all types of artillery, mortars, machine and sub-machine guns; (ii) silencers for all machines and sub-machine guns (iii) anti-tank rifles and recoil-less guns or rifles and bazookas; (iv) revolvers or pistols over 46 inches bore ; (v) nuclear weapons of all types ; (vi) projectors, guided missiles, and dischargers for grenades, rockets, bombs and gas or smoke containers; (vii) flame throwers of all types ;",
  "(viii) all carriages, platforms and appliances for mounting or transporting cannon ; and (ix) parts of cannon ; and (d)   “Government\"   means the \"Federal Government for the whole of Pakistan and the \"Provincial Government\" in the case of a Province; (dd)   \"flick-knife\"   means a knife which has a blade which opens automatically by hand pressure applied to a button spring or other device in, or attached to the handle of the knife, and includes any knife which has a blade which is released from the handle or sheath thereof by the force of gravity or by the application of centrifugal force and which when released, is locked in place by means of a button, spring lever or other device ; (e)   \"licence\"   means a licence granted under this Ordinance ; (f)   \"military stores\"   means any stores which the Federal Government may, by notification in the official Gazette, declare to be military stores; (g)   \"rules\"   mean rules made under this Ordinance. (2) Government may, by notification in the official Gazette, declare any article or substance not specified in clause (a) or clause (b) or clause (c) of sub-section (1), to be as the case may be, ammunition, arms or cannon for the purposes of this Ordinance, and on the publication of such notification, such article or substance shall be deemed to be specified in the said clause (a) or clause (b) or clause (c), as may be notified.  CHAPTER II SALE AND REPAIR  4. Unlicensed sale and repair prohibited:   (1) No person shall sell or keep, offer or expose for sale, an arms, ammunition, or military stores, or undertake the repairs of any arms, except under a licence and in the manner and to the extent permitted thereby. (2) Nothing herein contained shall prevent any person from selling any arms or ammunition which he lawfully possesses for his own private use to any person who is not by any enactment for the time being in force prohibited from possessing the same, but every person so selling arms or ammunition to any person shall, without unnecessary delay, give to the Magistrate of the district or to the officer, incharge of the nearest police station notice of the sale and of the purchaser's name and address  CHAPTER III TRANSPORT 5. Power to prohibit transport :   Government may, from time to time, by notification in the official Gazette, regulate or prohibit the transport of any description of arms, ammunition or",
  "military stores over the whole of the Province or any part thereof either altogether or except under a licence and to the extent and in the manner permitted by such licence.  Explanation:   Arms ammunition or military stores transhipped at a port in the Province are transported within the meaning of this section.  6. Power to establish searching posts:   Government may, at any place along the boundary line between the Province and an Acceding State and at such distance within such line as it deems expedient, or at any place in the Province that it may deem proper, establish searching posts at which any person, vessel, vehicle or any other type of transport or any type of package or container in transit may be stopped and searched for arms, ammunition and military stores by any officer empowered by Government in this behalf by name or in virtue of his office.  7. Arrest of persons conveying arms, etc., under suspicious circumstances:   (1) When any person found carrying or conveying any arms, ammunition, military stores, whether covered by a licence or not, such manner or under such circumstances as to afford just grounds of suspicion that the same are being carried or conveyed by him with intent to use them, or that the same may be used for any unlawful purpose any person may without warrant apprehend him and take such arm ammunition or military stores from him. (2) Any person so apprehended him and take such arms, ammunition or military stores so taken by a person not being a Magistrate or a police officer, shall be delivered over as soon as possible to a police officer. (3) All persons apprehended by or delivered to, police officer and all arms, ammunition and military store seized by or delivered to any such officer under the section shall be taken without unnecessary delay before Magistrate.  CHAPTER IV GOING ARMED AND POSSESSING ARMS, ETC   .  8. Prohibition of going armed without licence:   (1) No person shall go armed with any arms except under a licence and to the extent and in the manner permitted thereby. (2) Any person so going armed without a licence or in contravention of its provision maybe disarmed by any Magistrate, police officer or other person empowered by Government in this behalf by name or by virtue of his office. (3) Nothing in sub-sections (1) and (2) shall apply to a person carrying arms under a written authority issued in accordance with the rules.  9. Unlicensed possession of arms etc.:   No person shall have in his possession or under his control any arms, or any ammunition or military stores, except under a license and in a manner and to the extent permitted thereby.",
  "10. In certain cases arms to be deposited at police station or with licensed dealers:   (1) Any person possessing arms, ammunition or military stores the possession whereof, has, in consequence of the cancellation or expiry of a licence or of an exemption or the death of the licensee or otherwise, become unlawful, shall without unnecessary delay deposit the same either with the officer incharge of the nearest police station or, at his option and subject to such conditions as Government may by rule prescribe, with a licensed dealer: provided that where, within one month of the expiry of a licence an application for its renewal has been made by registered post or by hand the retention by the holder of such licence of the arms, ammunition or military stores covered by the licence shall be deemed to be lawful until such time as the licence has been renewed or its renewal refused. (2) When arms, ammunition or military stores have been deposited under sub-section (1), the depositor, or in case of his demise, his legal heir, shall, at any time before the expiry of such period as Government may by rules prescribe, be entitled— (a) to receive back anything so deposited the possession of which by him or his legal heirs has become lawful; and (b) to dispose, or authorise the disposal, of anything so deposited by sale or otherwise to any person whose possession of the same would be lawful, and to receive the proceeds of any such sale: Provided that nothing in this sub-section shall be deemed to authorise the return or disposal of anything the confiscation of which has been directed under Sec. 20. (3) All things deposited under sub-section (1) and not returned or disposed of under sub-section (2) Within the prescribed period therein referred to, shall be forfeited to Government. (4) (a) Government may make rules consistent with this Ordinance for carrying into effect the provisions of this section. (b) In particular and without prejudice to the generality of the foregoing provision. Government may by rules prescribe— (i) the conditions subject to which arms, ammunition or military stores may be deposited with a licensed dealer ; and (ii) the period after the expiry of which things deposited as aforesaid shall be forfeited under sub- section (3).  CHAPTER V LICENCES  11. Power to make rules as to licences:   Government may, from time to time, by notification in the Official Gazette, make rules to determine the officers by",
  "whom the form in which and the terms and conditions on and subject to which any licence shall be granted, or renewed, and may by such rules among other matters— (a) fix the period for which such licences shall continue in force; (b) fix a fee payable by stamp or otherwise in respect of any such licence; (c) Deleted by the West Pakistan Arms {Amendment) Act. XXXVIII of 1974, Section 4; (d) direct that the holder of any such licence shall keep a record or account, in such form as Government may prescribe, of anything done under such licence, and exhibit such record on account when called upon to do so by an officer of Government authorized in this behalf; (e) empower any officer of Government to enter and inspect any premises in which arms, ammunition or military stores are kept by any person holding a licence of the description referred to in Sec. 4 ; (f) direct that any such person shall exhibit the entire stock of arms, ammunition and military stores in his possession or under his control to any officer of Government so empowered ; and (g) require the person holding any licence or acting under any licence to produce the same and to produce or account for the arms/ ammunition or military stores covered by the same when called upon to do so by an officer of Government so empowered.  (11–A). Power of the Federal Government:   (1) The Federal Government may by notification in the official Gazette, specify the description, caliber or bore of arms and ammunition which are to be prohibited bores for the purpose of this Ordinance. (2) No licence for the arms and ammunition notified under sub-section (1) shall be issued except by the Federal Government. (3) The Federal Government shall have the power to issue licences for non-prohibited bore weapons valid for the whole or any part of Pakistan. (4) The Provincial Government shall have the power to issue licences for non-prohibited weapons only which power shall be exercised by the said Government subject to Section 11.  11-B. Prohibition of keeping, carrying, or displaying arms:   (1) The Federal Government may, and if so directed by the Federal Government, the Provincial Government shall, by general or special order, prohibit the keeping, carrying or display of arms at such places or times or on such occasions as may be specified in the order. (2) In particular, and without prejudice to the generality of sub-section (1), an order issued thereunder may prohibit-—",
  "(a) the keeping of arms within the premises of educational institutions and the premises of the hostels or boarding and lodging houses relating or affiliated thereto; and (b) the carrying or display of arms at fairs or in gatherings or processions of a political, religious, ceremonial or sectarian character or in the premises of Courts of law or public offices. (3) Any person keeping, carrying or displaying any arms in contravention of an order issued under sub-section (1) may be disarmed by the Magistrate, police officer or other person empowered by Government in this behalf.  12. Cancellation and suspension of licences:   (1) Any licence may be cancelled or suspended— (a) by the officer by whom the same was granted or by any authority to which he may be subordinate, or any District Magistrate within the local limits of whose jurisdiction the holder of such licence may be, when for reasons to be recorded in writing and after giving the holder of the licence an opportunity of showing cause against the proposed cancellation or suspension, such officer, authority or Magistrate deems it necessary for the security of the public peace to cancel or suspend such licence ; or (b) by any Judge or Magistrate before whom the holder of such licence is convicted of an offence against this Ordinance or against the rules and Government may by a notification in the official Gazette, cancel or suspend all or any licences throughout the Province or any part thereof, (2) An appeal against an order of cancellation or suspension under clause (a) of sub-section (1) may be made by the person whose licence has been cancelled or suspended to the immediate official superior to the authority making the order, within sixty days of the receipt by him of a copy of the order where appeal lies to Government, and where appeal lies to any other authority, within thirty days of the receipt by him of a copy of the order.  CHAPTER VI PENALTIES  13. Penalty for breach of Sections 4, 5, 8 to 11:   Subject to the provisions of Sees. 13-A and 13-B, who ever commits any of the following offences, namely:-— (a) sells, or keeps, offers or exposes for sale, any arms, ammunition or military stores, or under takes the repairs of any arms in contravention of the provisions of Section 4 ; (b) fails to give notice of the sale of arms and ammunition and of the purchaser's name and address as required by Section 4 ; (c) transports any arms, ammunition or military stores in contravention of a regulation or prohibition issued under Section 5 ;",
  "(d) goes armed in contravention of the provisions of Section 8 ; (e) has in his possession or under his control any arms, ammunition or military stores in contravention of the provisions of Section 9 ; (f) fails to deposit arms, ammunition or military stores as required by Section 10 ; (g) intentionally makes any false entry in a record or account which by a rule make under clause (d) of Section 11 he is required to keep ; (h) intentionally fails to exhibit anything which by a rule made under clause (f) of Section 11 he is required to exhibit ; or (i) keeps, carries or displays any arms in contravention of an order issued under Section 11-B ; shall be punished with imprisonment for a term which may extend to seven years or with fine, or with both : Provided that the punishment for an offence committed in respect of any rifle of .303 bore or over, musket of .410 bore or over. pistol or revolver of .441 bore or over or ammunition which, can be fired from such musket, pistol or revolver, shall be imprisonment for a term which is not less than three years, shall be imprisonment for a term Which is not less than three years.  13-A. Penalty for, breach of Section 4 in respect of cannon or automatic weapon, etc.:   Who ever sells, or keeps, offers or exposes for sale a cannon, grenade, bomb, rocket or a light or heavy automatic or semi-automatic weapon, such as klashnikov, a G-lll rifle or any other type of assault rifle, or ammunition which can be fired from such weapon, in contravention of the provisions of Section 4, shall be punishable with imprisonment for a term which may extend to fourteen years and shall not be less than seven years, fine and forfeiture of property.  13-B. Penalty for breach of Section 8 or Section 9 in respect of cannon or automatic weapon, etc.:   Whoever: — {a) goes armed with a cannon, grenade, bomb, rocket or a light or heavy automatic weapon, such as a klashinkov, a G-lll rifle or any other type of assault rifle, in contravention of the provisions of Section 8; or (b} has in his possession or under his control any of the arms or weapons referred to in clause (a), or ammunition which can be fired from such weapon, in contravention of Section 9 ; shall be punishable with imprisonment for a term which may extend to ten years and shall not be less than three years and fine.  14. Certain breaches of Sections 4, 6, 9 and 21:   Whoever—",
  "(a) [Deleted by the West Pakistan Arms {Amendment) Act. LII of 1973, S.3}; (b) on any search being made under Section 21, conceals or attempts to conceal any arms, ammunition or military stores, shall be punished with imprisonment for a term which may extend to seven years, or with fine. or with both : Provided that the punishment for an offence committed of any— (a) cannon, grenade, bomb or rocket; or (b) light or heavy automatic weapon, rifle of .303 bore or over musket of .410 bore or over or paid or revolver of .441 bore or ammunition which can be fired from such weapon, rifle, musket, pistol or revolver, shall be imprisonment for a term which is not less than two years.  14-A Certain offences triable by Magistrates:   (1) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of 1898), an offence punishable under Section 13 or Section 14 shall unless it has been committed in respect of any of the arms, ammunition or military stores referred to in the proviso to the said Section 13, be triable by a Magistrate of the First Class. (2) All cases relating to offences triable by a Magistrate of the First Class under sub-section (1) and pending in a Court of Sessions immediately before the commencement of the Pakistan Arms (Amendment) Ordinance, 1976 (XXI of 1976), in which the charges had not been framed shall, on such commencement, stand transferred to the Court of the Magistrate of the First Class having Jurisdiction over such cases.  15. Breach of licence:   Whoever, in violation of a condition subject to which a licence has been granted, does or omits to do any act shall, when the doing or omitting to do such act is not punishable under Sec. 13 or Section 14, be punished with fine which may extend to five hundred rupees.  16. Knowingly purchasing arms, etc. from unauthorized persons:   Whoever:- (a)   Knowingly purchases any arms, ammunition or military stores from any person not licenced or authorized under Subsection(2) of Section 4 to sell the same; or (b)   Delivers any arms ammunition or Military stores into the possession of any person without previously ascertaining that such person is legally authorized to possess the same, Shall be punished with imprisonment for a term which may extend to three years or with fine or with both: Provided that the punishment for an offence committed in respect of any –",
  "(a)   Canon, grenade, bomb or rocket; or (b)   Light or heavy automatic weapon, rifle of .303 bore or over musket of .410 bore or over a pistol or revolver of .441 bore or over, or ammunition which can be from such weapons, rifle, musket, pistol or revolver, Shall be imprisonment for a term which is not less than one year.  17. Penalty for breach of rules:   Any person violating any provision of any rule made under this Ordinance for the violation of which no penalty is provided by this Ordinance, shall be punished with fine, which may extend to two hundred rupees.  18. Penalty for failure to give information under Section 23:   Any person who in the absence of reason able excuse, the burden of proving which shall lie upon such person, fails to give information to the nearest police officer or Magistrate in respect of any offence under sub-section (I) or sub-section (2) of Section 23 of which he becomes aware or which he has reason to suspect, shall be punished with imprisonment for a term which may extend to six months, or with fine which may extend to Rs. 500 or with both.  19. Penalty for refusing or neglecting to produce arms:   Any person refusing or neglecting to produce any arms when so required under Section 26 shall be punished with imprisonment for a term, which may extend to one month or with fine, which may extend to two hundred rupees, or with both.  20. Power to confiscate:   When any person is convicted of any offence punishable under this Ordinance, committed by him in respect of any arms, ammunition or Military stores, it shall be in the discretion of the committing Court or Magistrate further to direct that the whole or any portion of such arms, ammunition or military stores and any vessel, vehicle or any other type of transport used to convey the same, and any type of package or container in which the same may have been concealed, together with the other contents of such package or container shall be confiscated : Provided that where such conviction is in respect of an offence punishable under this Ordinance with imprisonment for not less than twelve months, the Court or the Magistrate convicting such person shall direct that the whole or any portion of such arms, ammunition or military stores shall be confiscated.  CHAPTER VII MISCELLANEOUS  21. Search and seizure by Magistrate:   When ever any Magistrate or an officer incharge of a police station has reason to believe that any person residing within the local limits of his jurisdiction: (a) has in his possession any arms, ammunition or military stores for any unlawful purpose ; or (b) that such person cannot be left in the possession of any such arms, ammunition or military stores without danger to the public peace;",
  "such Magistrate or such police officer having first corded the grounds of his belief, may cause a search to made of the house or premises occupied by such person or in which such Magistrate or such police officer is reason to believe such arms, ammunition or military stores are or is to be found, and may seize and detain the same, although covered by licence or exemption, in safe custody for such time as he thinks necessary.  22. Seizure end detention by Government:   Government may at any time order or cause to seize any arms, ammunition or military stores in the possession of any person, notwithstanding that such person is lawfully entitled to possess the same, and may detain the same for such time as it thinks necessary for the public safety.  23. Information be given regarding offences:   (1) Every person aware of the commission of any offence punishable under this Ordinance shall in the absence or reasonable excuse, the burden of proving which shall lie upon such person, give information of the same to the nearest police officer or Magistrate. (2) Every person employed upon any railway or by any public carrier shall, in the absence of reasonable excuse, the burden of proving which shall lie upon such person, give information to the nearest police officer or Magistrate regarding any package or container in transit which he may have reason to suspect contains arms, ammunition or military stores in respect of which an offence against the Ordinance has been or is being committed.  24. Searches In the case of offences how conducted:   When a search is to be made for any of the purposes of this Ordinance, such search shall be made under the provisions of the Code of Criminal Procedure 1898 (Act V of 1898).  25. Operation of other laws not barred:   Nothing in this Ordinance shall be deemed to prevent any person from being prosecuted under any other law for any act or omission which constitutes an offence against this Ordinance or the rules or from being liable under such other law to any higher punishment or penalty than that provided by this Ordinance: Provided that no person shall be punished twice for the same offence.  26. Power to take census Of arms:   (1) Government may, from time to time, by notification in the official Gazette, direct a census to be taken of any arms in any area, and empower any person by name or in virtue of his office or take such census. (2) On the issue of any such notification, all persons possessing any such arms in such area shall furnish to the person so empowered such information as he may require in reference thereto, and shall produce such arms to him, if he so requires.  27. Power to exempt:   Federal Government may, from time to time, by notification in the official Gazette, or in exceptional circumstances by a written order, exempt any person by name or in virtue of his office, or any class of persons, or exclude any description of arms, ammunition or military",
  "stores, or withdraw any part of the Province from the operation of any prohibition or direction contained in this Ordinance.  28. Notice and limitation of proceedings:   No suit, prosecution or other proceeding shall lie against any person for anything which is in good faith done or intended to be done in pursuance of this Ordinance.  29. Repeal:   The Arms Act 1878 (XI of 1878), as in force in the Province of West Pakistan, together with all enactments amending or modifying the same, except the provisions thereof relating to manufacture (including conversion), export or import of arms, ammunition and military stores, is hereby repealed."
]