[
  "UTE RE eee es GEER sen ss",
  "Som Te ete",
  "| CVILJUDGES:CUM-JUDICIAL MAGISTRATES ~~ ©",
  "Co PAPERI(CIVILLAW) oe",
  "Time allowed:- (Three Hours) CU Tot Markss1000",
  ": CEE Fn aE eT",
  "Attempt any five questions. All questions carry equal(20) marks, iar ‘i =",
  "LL “Ts: there jany différence ‘between Actual RessTudicata and Constructive Res: H",
  "Judicatain the light of Section 11 0f CPC? vy oie he",
  "2. Give d defiled account of the kinds of injunctions and indicate cases which ©",
  "injunetion cannot be granted? Coe",
  "NEE Je What are esschtials of a valid marriage? Draw a distinction befiween a void and an a = :",
  "“Hmegliamarage ETE a",
  "4 Write ashortnote onthe following it ie",
  "CL Rapersut m=",
  "rE... ==",
  "interrogatories - cs",
  "iv. - substiied Service I...",
  "ee. \"aw",
  "5. Explain and comment oni the inherent posers of Civil Coutts with special",
  ". reference to the powers of the Court to amend judgments; decrees or orders? - Shinai",
  "PEE a; tn",
  "6. What are the supplemental proceedings that Court is empowered tortake fo secre",
  "ie ends ofjustice? Gla Sm Se",
  "7. Th what cireutnstances, a Civil Court can issue Commission? Can Court issue ©",
  ". Commission only on the move of a Party to the Suit? aE Shoe",
  "8 What matters dre tobe considered by a Court thc appointment of a Guardian? o Goa",
  "9. What do you understand by Tulabs’ prescribed by Punjab Pre-empiion Act, 19912",
  "“ol State the effect of monzperformance of Talabs a Sno dy",
  "10. ‘Name the Suits ihiwhich preliminary decree sits be passed? Also explain in detail + o oo",
  "the necessary steps needed for finalization of Partition Suit Proceedings, 00",
  "Cereb - ae",
  "BEARS RRO he oF Ea HREM a te |",
  "ae",
  "Fr ~",
  "EE ‘ aR Meine HE",
  "a - LAHORE HIGH:GOURT, LAHORE Co",
  "v er El Cie ge op akg za fustiiol arf king wil if 50 SE !",
  "J Civil Judges-cumJudjcl NEES FAtey ec Lo",
  "/ N dy eg Kp A 0 wl [SI | |",
  "Fal Buy Reécruifinentt Shiinaion i 106, Sg .",
  "CTT dsp LOUBSTION'PAPER Weber vhs gi oe",
  "CL Cong leg el ed gsi i ia et BET Ra : ct",
  "R i : . . td Co",
  ". : Sade a adept eg AEE . a",
  "Instructions; YF SHES Cr VERE Ymgalige. od",
  "rE Cx . sl ITI : so {",
  ". Cb conver fivaguestions from dachsection. | 1 a",
  ". wy Till questions.canm equal marks, le ie. Co",
  "* Time: 3 hours. . Co bo EE",
  "- EA . WER ged EST",
  "EE . a ANE sae",
  ". : Co . © Criminal Fopioiisistas 20d a vn Lr :",
  "' co Bection-1: Criminal Leid\"'y ste: iy cai. : Co",
  "’ . Bw ad L Boma ool - Co",
  "Co WR ba as JER",
  "L Whether a criminal court has any jurisdiction to decide the matter. telating to. + - RE",
  "’ immovablecproperty, and, if 80 nndor, syhat glcumstances .can.the person we",
  "+ dispossessed be restored: he posseBsion®.. ny o. cw Yo",
  "’ ) i . RL Ey Ney Te Col",
  "2.\" \"Discuss in detail the procedure to be followed by a Magistrate for the trial of a . i",
  "case. nol panishable. with death or, imprisonment for life and irregularitios , © |",
  "which vitiat the trial? ‘ Sie TU a, EE",
  "J CRS i Be ask RET A TR Ck",
  "+ 3 What formalities must be obscrugd, by, 3, Magisiate, jbl, ceiprding the |",
  "confession -of an accused person? Algo, discuss the legal value of a. “ Ro N",
  "confessional stalement. © pu ce cos a C aE",
  "OTA a wi AIRY ah Ss Spl a EY",
  "4) Whatis he ditfousnce, bohweey. prepasation. fo, somuit an Stferice and an Cl",
  "Co attempt fo sommitan offence? , 5 bagi of igi Li an 'B",
  "+b). What is fhe; difference betwecry common intention aad common, objet ds -",
  "given in Pakistan Penal Codg? ' . . TB",
  "R Lc BEL i nS ile panies ah ne |",
  "© Whileplaving vith arevolieti A! pyll ths riggs witholit observing that ihe §",
  "revolver i, not empty and; hereby, Causes; the, death of 1B who wag standing. i",
  "- moby, Whether \\A\" has comme any ffeyce ands so, what would bo the ~~ ol",
  "nature of the offence? Discuss in detail. &.. ee, : :",
  "6. What do'vou understand. tie ard Pardon, who oamigrant thogamoand 71 Lf",
  "under what girpumstances Also tefer, to, the, relevant. provisions, 1 Pakistan i",
  "’ Penal Code as well as Criminal Procedure Codecs ru, 10 0 a",
  "ne Ca de LE a ron ph cA ) ’ H",
  "7.\" . Define,and distinguish, ‘examination-in;chief?,; “orops-examination” and “ro-- RE",
  "examination” of witndsses. Also:narsate the: circumstances in which a person",
  "summoned to producela document may be cross-examined. . - ] i |",
  "Goma rl latsiabony Loe gaa EN",
  "3. Who, iscanjfaccomplice??. Whether his stateghsnt isworth reliance and, if so, Co",
  "\" undor WhaLeiToumSanGEs th iy, ait gs re ve, eit ps p CH",
  ". A mune wide da, santos tg go -",
  "9. Draw a line of distinction betwee: primary evidence and secondary evidence . EAN",
  ". in the context of a criminal case: Refer fo case-law fo illustrate the difference LEBEN",
  "© between the two,” - : . Le re BREE",
  "10. When is an opinion of an expert relevant as evidence in criminal cases? Also ; ‘ y",
  "quote the specific provisions of the relevant law. R ) : i",
  "LEE RR wa",
  "o- 'R |",
  "Section:=H: Civil Law ' £ |",
  "IL (i) Who should be joined. 4, parties to a suit? Draw distinction between i",
  "necessary, and, DRO hatha sige eu fT it",
  "(ii) How cay, 2,minor sue or e sticd? . i",
  "Explain the sb6VE wit Rfeteal et thetrdrevini iibviions of law. E",
  "2. (ON Under what proyiipa af,CRC pony injunctions arc granted? State i",
  "the principles 10 be kept in view by the court while granting/refusing temporary . i",
  "injunction. - | R . 4)",
  "G3). What do yoo underiond py afachment berojudgment? §",
  "3 What ace’ TH dient EEGs of-d nlbney decree, a decree for i",
  "partition, 2 dectee FONE desice foltapébific performance? FEAT",
  ". rch Tone TT A :",
  "4. - Write short nofss on: . . . ii",
  "[6] Res judicata, A oo i i",
  "L (fH) Res sub JUdiGe, + (voids of ee l",
  ": Gly Expire doce riily RELL \" Ca",
  "+ (v) Dismissal indefauli and . . . -",
  "(vy Local commission. Te . ) TE",
  "SIT hi ta oan Rl vt ded rT en - ’ i",
  "5. éCril court Re\" {he Eoiifts SE ltitfiatt' furisdiStion fot frying casos of civil B i",
  "nature”. Discuss briefly with nace) tthe elevant livisions of law. Give . i",
  ") ingtances of suits of civil'nature, : : CTR h",
  "cae dent ed byacBet od Sok a diilmbede oe TT : Cl |",
  "6 Whi 86 YESH tn® bP sooiisent ~ defend Is such 4 doers EE",
  "appealable under the nw? © Cen eier . 2",
  "_ (i)\" What are the different mioidés of service provided by CPC? ‘What do you ) ie",
  "’ Findégstiid by TabStfed dedviigininles «of et dere . ER |",
  "Ces . SB pa la Gg Bon aE | ci i",
  "7. [6] What do you understand by *“gufficierit ‘cause” “fyitliin ‘the meanings of JRE i",
  "Section 5 of the Limitation’ Att, 1908 fot extending the period of limitation for an : . gd",
  ": “pon, Ap BiEHON Or FVII HCH posiiblelcausds. wo :",
  "(i) “The court is obliged to seo Hilictior thet 4tit 18 ‘within limitation”. EVEN :",
  "CP HabEate theo RRR IBYARE pf ovision othe iritation Act, 1908. © : :",
  ". . BE DE Sh Re EH i ) i",
  "8 i What are the essentials of a valid gift under the Muslim Law? ; . :",
  "Ay TH hdl hg RAY Coit ebecides excltftve Turisdiotion?",
  "EE Gi) Whit hn GORE fufisaibtioiof a! Clvil Tudo. 1\" Class, Civil wet",
  "bine ott pt CREO CMH EgEo™ Clair WHICH Ti prescribes such © EY",
  "} jurisdictional limits? Liisel: pd Basie sont nih [RE . : ¢",
  "9, oy WARES Te nN SOURSER ET HE lac Taw: (07 on © : :",
  "ES gy RD dR Bnd eERERY dul ons ER atid the court can grant B",
  "2 deoree of KHUIAT auRbinl [PI ITTORET (HURST Ea . ;",
  "(iii). What are the principlos governing the grint.of cusiody of 2 minor? i",
  "EE © a Yd HURRAY rofl nk Egsost-tiial © conciliation |",
  "EEE Aacsumpy bY Ra CGE? [ERR SLO : . if",
  ". Sota atest) 8 HAY Sond EPRI GRC 2 . i:",
  "10. () What do you understand, by. “Talabs” prescribed by the Punjab Pre- - E",
  "Sn “iegticE AR TOO1 STRAY EEEREERUL Der obinron Gi alabi: . \\",
  "Gi) A landlord wants to ge 15s rontod pratniseasisatetrbgathie tenant. What |",
  "ceriedy is open to him and befiowhoim? Lo R ic",
  "Cr ER Mn fi nah ER Genta aon To oa . . iE",
  "Cte eel a gested ofall owas Henite B Eel ’ . |e",
  "NE : - herd ale pe? ’ iE",
  "vl = SES RN Co - i - |",
  "La ] ‘",
  ": LAHORE HIGH COURT, LAHORE.",
  "Civil Judges-cum-Judicial Magistrates . ’",
  ". Recruitment Examination, 2009.5 + ’",
  "QUESTION PAPER Lo",
  "Instructions: *All answers are {o be written in;Bnglish language.",
  "# Answer any five questions, fio. oY",
  "* All questions carry equal marks,\" 7\" ' ‘",
  ": * Time 3 hours. A :",
  "CIVILLAW 3% Lo",
  "~L Explain the following remedies. with reference to, the relevant . -. *",
  "provisions of CPC stating circumstances in-which these. are to be :",
  "availed:- : Es alpen gl IEE J",
  "(i). Regular Second Appeal. SLT o Lo",
  "(i) . Revision. : RE ; CL -",
  "(iii) Review. . : . Cd i",
  "2. Dxplain the following .concepls with. reference to the relevant :",
  "provisions of CPC and the West Paldstan Civil Courts Ordinance, '",
  "1962: En EI . RE",
  "()  Termitorial jurisdiction. : +. Sih os x",
  "(ii) Pecuniary jurisdiction with reference tothe courts of Civil =",
  ". Judges. | : : ’ EE",
  "3. How will you proceed to execute the following decrees:-",
  "(i) For recovery of possession of immovable property. R ;",
  "(i). For specific performance of an agreement to sell. | : } i",
  "(iil) Recovery of money. . ’ : =",
  "4. (i) Bxplain the term “Tegal Disability” with reference to the A :",
  "relevant provisions of the Limitation Act, 1908 end state the manner -",
  "of computation of limitation in such cases. ’ .",
  "(i) Explain the terms “Acknowledgment” and “Promise to Pay” Co",
  "with reference to the relevant provisions of the Lirgitation Act, 1908,",
  "and their legal effect vis-a-vis limitation for filing of relevant suits.",
  "5. (i) What contracts cannot be specifically enforced? ‘Explain with ~~",
  ": reference to the relevant provisions of the Specific relief Act, 1877.",
  "(ii) State the conditions enabling .a Court to cancel -a- written",
  "instrument. BE - -",
  "i (iif) State the cases in which an injunction shall not be isstied by a,",
  "Court. = . * : ol",
  "6. (i) Whatis4 negative agreement and: how it is to be enforced? “i.",
  "Explain with referehce to the relevant provisions of the Specific Relief",
  "Act, 1877. : : EE A",
  "(ii) Against whom specific performance: of a contract may be’",
  "enforced? . .",
  "Feds SRR RE Fo ROR EERE",
  "Shy (68) Txplain the rule underlying Section 9 of the Specific Relief Act, \\ :",
  "a 18777 : . -",
  "’ 7. (i) - Which suits are exclusively triable by’ a Family. Court %",
  "established under the Family Courts Act, 19647 Co A",
  "’ \"+ (ii) In which cases an appeal shall not lie against a judgment and %",
  ", decree passed by a Family Court? y",
  "(iii) “Explain thé duty of a guardian of a person and property of a \\",
  "minor appointed with reference to the provisions of the Guardian and :",
  "Wards Act, 1890. : i",
  ", 8. Bxplain the following with reference to the relevant provisions of the",
  ") Contract Act, 1872:- - ’ :",
  ": () Doctrine of Frustration of Contract..",
  ". Gi) Novation.of Contract. : .",
  "(iit) A Contract of Guarantee. ’",
  "A © 9. (i) State the pre-requisites of an application to be filed end",
  "Ky proceeded with under the Punjab Rented Premises Ordinance, 20077",
  "IN A (ii) In a case falling wnder the Punjab Urban Rent Restriction",
  "\" ) ordinance, 1959, alleging default in payment of rent at the rate of",
  "Rs.1,000/- per month for a period of five months prior to the",
  ". institution of the application, how will you frame an order in terms of",
  "sectioni13(6) of the said Ordinance? ‘ : :",
  "‘ “10. (i) How will you proceed to deal with an objection raised to the",
  "Co . admissibility of a document on the ground of its being under stamped :",
  "and finding the same to be so? Explain with reference to the relevant )",
  ". ‘ provisions of he Stamp Act,1899. ’",
  "(if) Under what circumstances an unregistered dociment will take",
  "| effect as against a registered document? Explain with reference to the",
  "| relevant provisions of the Registration Act, 1908.\"",
  "i i . Co",
  "A i 0 COUR i",
  "i EXAMINATION FOR THE POSTS OF CT JUD -CUM-J :",
  "MAGISTRATE, 2009 : .",
  "TIME ALLOWED: THREE HOURS MAXI] H )",
  "NOTES: 1) Attempt in English Language only. .",
  "ii) Attempt seven questions only, selecting two questions each from",
  "Part], II, TI and one from Part.IV",
  "PART-I )",
  "Ql. Discuss Section 302 PPC in full detail and the sentences provided in murder cases ©",
  "and illustrate in what circumstances each sentence can be ewarded? 15. .",
  "Q2. What is difference between cheating, misappropriation and theft? Discuss in detail. nN",
  ") 15 :",
  "- - 1",
  "Q.3. Define and explain \"Qisas', \"Badl-i-Sulah\", Diyat, \"Arsh\" and \"Daman\" 15",
  "Q.4. . Give salient features of Juvenile Justice System Ordinance, 2000, who can and under R",
  "what circumstances declare an accused as juvenile? 15 , ’",
  "Q.1 ‘What is remand? Under what circumstances custody of an accused cai be given to ’ a B",
  "Police? H a5 i",
  "Q2. What order can be passed by a Magistrate if any apprehension of breach of peace so",
  "brought to his notice regarding immoveable property? - . 15",
  "Q3. What doyou understand the word ‘case property'? Discuss Provisions regarding its B",
  "disposal during the trial and at the conclusion of trial? 15",
  "’ Q4. What is confession? How it can be recorded? Whether the statement under Section",
  "164 Cr.P.C can be used against an accused and under what circumstances? 15",
  "PART-II",
  "QJ. Dlustrate what precautions can be taken by a Magistrate at the time of holding to",
  "Identification Parade and also discuss evidentiary value of the Identification Parade.",
  "Q2. What are public and private documents, differentiate them and explain the mode of .",
  "proof of said documents? . RE 10 :",
  "Q3. Discuss with illustrations the value of evidence that aay have become available I",
  "because of modern devices and techniques. : 10 :",
  "Q4. Write a short note on examination-in-chief, cross-examination and roemisation?, i",
  "PART-IV i Ce",
  "Ql. ‘'Hadd\"as punishment, introduction, implication and consequence in Pakistan? » oo",
  "Q2. Whatis Terrorism’? Illustrate its root causes. Give suggestions for its eradication. 2 :",
  "Q3.. \"Power failure’, who is chiefly responsible and give suggestions for improvement. % f",
  "EE  ————————",
  "Geipdane nD aia aie a",
  "of LAHORE HIGH COURT.LAHORE . ~~}",
  "oo Snein EREE CT he ee",
  "? oF. RECRUITMENT EXAMINATION013 0 vf noo",
  "| PAPER-J(ENGLISH FSSAVAND CRIMINAL LAW) ~~~ a",
  "in ALE Sel - hy pi oH ; CE PTL i [TE Tin",
  "Time allowed:= (Three Hours) - Coe So Markse oo coi",
  "cml Cie Cohen a 300 ee",
  "Sham ee SO Co Partll 1000 cc",
  "ome ee TORINO.",
  "Notes (1) ‘Attempt six questions mall go Sa SE",
  "(i); Attempt one question from Part-I (question carries 30. marks) and ©",
  "i Aivequestions from Part-IT (each question carries 20 marks):",
  "Waite an essay on any’ one of the following:- i Renee al al",
  "® © Loadshedding Loa",
  "CB Peaceivthemodemivord © oo chon",
  "CG) Forelpnaidablessingoracume?. Lo 0",
  "©) Problems of ovér population in Pakistan © eo Goo wo",
  "© QNo When right of private defence ofa person and property commences end till",
  "- what time it continues? BRE",
  "© QNe2: i Define and fllustrate extortion ang distinguish between extortion and theft?",
  "QNo.3. + Write delailed note\"on “Defamation” iichiding exceptions/to the charge of © © ©",
  "Co Deamon ps",
  "QNoid' Ai ‘adored plidds Certain circumstances brining his case within general 1",
  "exceptions of BPC. On whom the burden of proof lies. to, prove the =",
  "| existence of such cireimstances?s © ET ET En TL",
  "QNos. What are thc condition precedent for recording confession? Ei S Sr : EE",
  "QNo6: I there any provision of law under which a cryin] Cour can putan cod",
  "“7s he proceedings even witholt concluding’ Hal and’ can acquit the",
  "+L Paceused? Please distuss. EE a an Ee",
  "QNo:7. | Whats chirge? What is its objective? Wat particulars are required to be + 1",
  "<i stated:in the Charge? BE ae",
  "CQUNoB. Waa i Tides power to ask quétions 10.any witriess ot parties fo discover",
  "QNo9: ;  Whittare the various ways of proving handwilting of a person? ora . g Se nF",
  "QNo10, : Ao ay testify’ ‘asia witness: and Bow a Court: Gan determine fhe 0",
  "ii, competence of a witness? ae",
  "Se EE"
]