[
  "THE PUNJAB MAINTENANCE OF PUBLIC ORDER  (AMENDMENT) ORDINANCE 2022  (II of 2022)  CONTENTS  1.   Short title and commencement.  2.   Amendment of section 2 of Ordinance XXXI of 1960.  3.   Amendment of section 3 of Ordinance XXXI of 1960.  4.   Amendment of section 4 of Ordinance XXXI of 1960.  5.   Amendment of section 5 of Ordinance XXXI of 1960.  6.   Amendment of section 6 of Ordinance XXXI of 1960.  7.   Amendment of section 7 of Ordinance XXXI of 1960.  8.   Amendment of section 8 - A of Ordinance XXXI of 1960.  9.   Amendment of section 12 of Ordinance XXXI of 1960.  10.   Amendment of section 18 of Ordinance XXXI of 1960.  11.   Amendment of section 18 - A of Ordinance XXXI of 1960.  12.   Amendment of section 20 - A of Ordinance XXXI of 1960.  13.   Amendment of section 21 of Ordinance XXXI of 1960.  14.   Amendment section 21 - A of Ordinance XXXI of 1960.  15.   Amendment of section 26 of Ordinance XXXI of 1960.",
  "TEXT  1  THE PUNJAB MAINTENANCE OF PUBLIC ORDER (AMENDMENT)  ORDINANCE 2022  ( I I   of   202 2 )  [ 1 3 th   January, 2022 ]  An  Ordinance  to amend the Punjab Maintenance of Public Order Ordinance, 1960 .  It is necessary to amend the Punjab Maintenance of Public Order Ordinance, 1960  (XXXI of 1960) for the purposes hereinafter appearing.  Provincial   Assembly of the Punjab is not in session and Governor of the Punjab is  satisfied   that   circumstances exist which   render it necessary to   take   immediate  action.  In exercise of the powers conferred under clause (1) of Article 128 of the Constitution  of the Isl amic Republic of Pakistan, Governor of the Punjab is pleased to make and  promulgate the following Ordinance:  1.   Short title and commencement . –   (1) This Ordinance may be cited as the  Punjab Maintenance of Public Order (Amendment) Ordinance 2022.  (2)   This Ordinanc e shall come into force at once.  2.   Amendment of section 2 of Ordinance XXXI of 1960 . –   In the Punjab  Maintenance of Public Order Ordinance, 1960 (XXXI of 1960), for brevity referred to  as ‘the Ordinance’, in section 2:  (a)   after clause (d), the following clause ( dd) shall be inserted:  “(dd)   “Secretary”   means   Secretary   to   the   Government,   Home  Department;”;  (b)   in clause (e), for the word “Government”, appearing for the third time,  the word “Secretary” shall be substituted.  3.   Amendment of section 3 of Ordinance XXXI o f 1960 . –   In the Ordinance, in  section 3, for the word “Government”, wherever appearing, the word “Secretary”  shall be substituted.  4.   Amendment of section 4 of Ordinance XXXI of 1960 . –   In the Ordinance, in  section 4, for the word “Government”, the word “Secr etary” shall be substituted.  5.   Amendment of section 5 of Ordinance XXXI of 1960 . –   In the Ordinance, in  section 5, for the word “Government”, wherever appearing, the word “Secretary”  shall be substituted.  6.   Amendment of section 6 of Ordinance XXXI of 1960 . –   I n the Ordinance, in  1 This Ordinance was Promulgated by Governor of the Punjab on 1 0   January 2022; and was published in the Punjab Gazette  (Extraordinary), dated: 1 3   January 2022, pp. 3455 - 3457;   and was repealed on   12.04 .2022   at the expiration of its period in terms of Article  128 of the Constitution of Islamic Republic of Pakistan.",
  "section 6, for the word “Government”, wherever appearing, the word “Secretary”  shall be substituted.  7.   Amendment of section 7 of Ordinance XXXI of 1960 . –   In the Ordinance, in  section 7, for the word “Government”, wherever appearing, the   word “Secretary”  shall be substituted.  8.   Amendment of section 8 - A of Ordinance XXXI of 1960 . –   In the Ordinance,  in section 8 - A, for the word “Government”, the word “Secretary” shall be substituted.  9.   Amendment of section 12 of Ordinance XXXI of 1960 . –   In the Ordinance,  in section 12, for the word “Government”, wherever appearing, the word “Secretary”  shall be substituted.  10.   Amendment of section 18 of Ordinance XXXI of 1960 . –   In the Ordinance,  in section 18, for the word “Government”, wherever appearin g, the word “Secretary”  shall be substituted.  11.   Amendment   of   section   18 - A   of   Ordinance   XXXI   of   1960 . –   In   the  Ordinance, in section 18 - A, in subsection (1), for the word “Government”, the word  “Secretary” shall be substituted.  12.   Amendment   of   section   20 - A   of   Or dinance   XXXI   of   1960 . –   In   the  Ordinance, in section 20 - A, for the word “Government”, wherever appearing, the  word “Secretary” shall be substituted.  13.   Amendment of section 21 of Ordinance XXXI of 1960 . –   In the Ordinance,  in section 21, for the word “Governmen t”, the word “Secretary” shall be substituted.  14.   Amendment section 21 - A of Ordinance XXXI of 1960 . –   In the Ordinance, in  section 21 - A:  (a)   in   subsection (1), for the words “Government   or an officer of   the  Government specifically authorized”, the words “Secre tary or an officer  authorized by the Secretary” shall be substituted; and  (b)   in subsection (2), for the words “Government or an officer authorized  by the Government”, the words “Secretary or an officer authorized by  the Secretary” shall be substituted.  1 5.   Amendment of section 26 of Ordinance XXXI of 1960 . –   In the Ordinance,  in section 26, for the word “Government”, wherever appearing, the word “Secretary”  shall be substituted."
]