[
  "IN THE COURT OF SENIOR CIVIL JUDGE LAHORE",
  "Civil Suit No.__________________/2021",
  "Abdul Nadeem Khan",
  "Shabbir Ahmad Khan",
  "Abdul Waseem Khan",
  "Raheela Asad",
  "Saleha Khan",
  "Iqra Aleem Khan",
  "All sons and daughters of Abdul Aleem Khan deceased All R/o House No.263, Street No.7, Block-E, Mohallah PCHC Ghazi Road, Lahore Cantt Lahore.",
  "Plaintiffs",
  "VERSUS",
  "Public at Large",
  "Defendant",
  "SUIT FOR DECLARATION OF LEGAL HEIRS.",
  "Respectfully Sheweth;-",
  "That brief facts giving rise to the filing of the instant suit are that father of the Plaintiffs No.1 to 6 namely Abdul Aleem Khan son of Abdul Hakeem Khan died on 14.07.2000, leaving behind the Plaintiffs as his absolute legal heirs. Copy of death certificate is attached herewith.",
  "That the mother of the plaintiffs namely Mst. Razia Sultana No.1 to 6 also died on 06.05.2008.",
  "That the deceased predecessor-in-interest of the plaintiffs left behind the plot No.107 land measuring 5-Marlas bearing Khewat No.103, Khatooni No.380 vide sale deed document No.25348, Book No.1, Volume No.1563 dated 28.09.2005 registered with sub Registrar Nishtar Town, Lahore situated at Mushtaq Colony Had Bast Mouza Dulu Khurd Tehsil Cantt District Lahore. Copy of the same is attached for the kind perusal of this Honourable Court.",
  "That the plaintiffs are absolute legal heirs of deceased and they are entitled to inherit the suit property left by deceased mother.",
  "That the plaintiffs approached the concerned authorities and requested to incorporate the names of the plaintiffs in the relevant record being legal heirs of deceased Mst. Razia Sultana but the concerned authorities flatly refused to do so and demanded a declaratory decree from the competent court of law, hence this suit.",
  "That the cause of action arose in favour of the Plaintiffs and against the concerned authorities due to aforesaid facts and circumstances and it is still continuing.",
  "That since the cause of action arose at Lahore the parties to the suit reside at Lahore, hence this Honorable court has jurisdiction in the matter.",
  "That the value of the suit for purposes of court fee and jurisdiction is fixed at Rs.400/- which is exempted from payment of court fee.",
  "PRAYER:",
  "It is respectfully prayed that a decree for declaration to the effect that the Plaintiffs are the only legal heirs of deceased Mst. Razia Sultana and they are entitled to inherit the estate left by deceased mother.",
  "Any other relief which this Hon’able Court deems fit may also be awarded.",
  "Plaintiffs",
  "Through",
  "MUHAMMAD ZEESHAN AMIR",
  "L.L.M Commercial Law (Ireland)",
  "Advocate High Court",
  "VERIFICATION:",
  "Verified on Oath at Lahore this 25th day of  September 2021 that the contents of paras 1 to 5 are true to the best of my knowledge and belief and those of paras 6 to 8 are true to the best of my information and belief.",
  "Plaintiffs"
]