[
  "THE CHILD MARRIAGE RESTRAINT ACT 1929",
  "(Act XIX of 1929)",
  "C O N T E N T S",
  "SECTION                                HEADING",
  "1.      Short title, extent and commencement.",
  "2.      Definitions.",
  "3.      [Omitted]",
  "4.      Punishment for marrying a child.",
  "5.      Punishment for solemnizing a child marriage.",
  "6.      Punishment for parent or guardian concerned in a child marriage.",
  "7.      Imprisonment not to be awarded for offence under section 3.",
  "8.      Jurisdiction under this Act.",
  "9.      Cognizance of offence and trial.",
  "10.    Preliminary inquiries into offences under this Act.",
  "11.    [Omitted]",
  "12.    Power to issue injunction prohibiting marriage in contravention of this Act.",
  "[1]THE CHILD MARRIAGE RESTRAINT ACT 1929",
  "(Act XIX of 1929)",
  "[1st October 1929]",
  "An Act to restraint the solemnization of child marriages.",
  "Whereas it is expedient to restrain the solemnization of child marriages:",
  "It is hereby enacted as follows:",
  "1. Short title, extent and commencement.– (1) This Act may be called the Child Marriage Restraint Act [2][1929].",
  "[3][(2) It extends to the whole of [4][the Punjab] and applies to all citizens of Pakistan wherever they may be.]",
  "(3) It shall come into force on the 1st day of April, 1930.",
  "[5][2. Definitions.– In this Act:",
  "(a)  \"child\" means a person who, if a male, is under eighteen years of age, and if a female, is under sixteen years of age;",
  "(b)  \"child marriage” means a marriage to which either of the contracting parties is a child;",
  "(c)  “Government” means Government of the Punjab;",
  "(d) \"minor” means person of either sex who is under eighteen years of age; and",
  "(e)  “Union Council” means a Union Council, Municipal Committee, Cantonment Board, a Union Administration or, in case of absence of any of these local governments in a local area, any other comparable body constituted under any law relatings to the local governments or local authorities.]",
  "[6][3. * * * * *]",
  "[7][4. Punishment for marrying a child.– If a person, not being a minor, contracts child marriage, he shall be liable to punishment of simple imprisonment which may extend to six months and fine of fifty thousand rupees.]",
  "5. Punishment for solemnizing a child marriage.– Whoever performs, conducts or directs any child marriage shall be punishable with simple imprisonment which may extend to [8][six months and fine of fifty thousand rupees], unless he proves that he had reason to believe that the marriage was not a child marriage.",
  "6. Punishment for parent or guardian concerned in a child marriage.– (1) Where a minor contracts a child marriage, any person having charge of the minor, whether as parent or guardian or in any other capacity, lawful or unlawful, who does any act to promote the marriage or permits it to be solemnized, or negligently fails to prevent it from being solemnized, shall be punishable with simple imprisonment which may extend to [9][six months and fine of fifty thousand rupees]:",
  "Provided that no woman shall be punishable with imprisonment.",
  "(2) For the purposes of this section, it shall be presumed, unless and until the contrary is proved, that where a minor has contracted a child marriage, the person having charge of such minor has negligently failed to prevent the marriage from being solemnized.",
  "7. Imprisonment not to be awarded for offences under section 3.– Notwithstanding anything contained in section 25 of the General Clauses Act, 1897[10], or section 64 of the Pakistan Penal Code[11], a Court sentencing an offender under section 3 shall not be competent to direct that, in default of payment of the fine imposed, he shall undergo any term of imprisonment.",
  "8. Jurisdiction under this Act.– Notwithstanding anything contained in section 190 of the Code of Criminal Procedure, 1898[12], no Court other than that of [13][* * *] a [14][Magistrate of the first class] shall take cognizance of, or try, any offence under this Act.",
  "[15][9. Cognizance of offence and trial.– (1) A Family Court shall not take cognizance of any offence under this Act except on a complaint made by the Union Council.",
  "(2)  A Family Court exercising the powers of a Judicial Magistrate of the first class shall conduct the trial of an offence under this Act in accordance with the provisions of Family Court Act, 1964 (XXXV of 1964).]",
  "10. Preliminary inquiries into offences under this Act.– The Court taking cognizance of an offence under this Act shall, unless it dismisses the complaint under section 203 of the Code of Criminal Procedure, 1898[16], either itself make an inquiry under section 202 of that Code, or direct a Magistrate of the first class subordinate to it to make such inquiry.",
  "[17][11. * * * * *]",
  "[18][12. Power to issue injunction prohibiting marriage in contravention of this Act.– (1) Notwithstanding anything to the contrary contained in this Act, the Court may, if satisfied from information laid before it through a complaint or otherwise that a child marriage in contravention of this Act has been arranged or is about to be solemnized, issue an injunction against any of the persons mentioned in sections 3, 4, 5 and 6 of this Act prohibiting such marriage.",
  "(2) No injunction under sub-section (1) shall be issued against any person unless the Court has previously given notice to such person, and has afforded him an opportunity to show cause against the issue of the injunction.",
  "(3) The Court may either on its own motion or on the application of any person aggrieved, rescind or alter any order made under sub-section (1).",
  "(4) Where such an application is received, the Court shall afford the applicant an early opportunity of appearing before it either in person or by pleader; and if the Court rejects the application wholly or in part, it shall record in writing its reasons for so doing.",
  "(5) Whoever, knowing that an injunction has been issued against him under sub-section (1) of this section disobeys such injunction shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to one thousand rupees, or with both:",
  "Provided that no woman shall be punishable with imprisonment.]",
  "[1]For Statement of Objects and Reasons, see, Gazette of India, 1927, Part V, p.28; and for Report of the Select Committees, see Gazette of India, 1928, Part V, pp.111-165.",
  "This Act was originally in the Federal ambit, however, the subject on which this law was enacted, devolved to the provinces by virtue of 18th Amendment in the Constitution, hence it was adapted, with amendments, for the province of the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015).",
  "[2]Substituted for “1928” by the Repealing and Amending Act 1930 (VIII of 1930), s.2 and 1st Sch.",
  "[3]Substituted by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s.3 and 2nd Sch (w.e.f. 14th October 1955), for the original sub-section (2), as amended by the Child Marriage Restraint (Amendment) Act 1938 (VII of 1938), s.2, the Adaptation of Central Acts and Ordinances Order, 1949 (G.G.O. 4 of 1949), and the Federal Laws (Revision and Declaration) Act 1951 (XXVI of 1951), s.8.",
  "[4]Substituted for the word “Pakistan” by the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015).",
  "[5]Substituted by the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015) for the following:",
  "“2. Definitions.– In this Act, unless there is anything repugnant in the subject or context,",
  "(a)    \"child\" means a person who, if a male, is under eighteen years of age, and if a female, is under sixteen years of age;",
  "(b)   \"child marriage” means a marriage to which either of the contracting parties is a child;",
  "(c)    “contracting party” to a marriage means either of the parties whose marriage is or is about to be thereby solemnized; and",
  "(d)   \"minor” means person of either sex who is under eighteen years of age.”",
  "Earlier, the following clause (e) had been omitted by the Child Marriage Restraint (Punjab Amendment) Ordinance, 1971 (XXIII of 1971):",
  "“(e)  \"Union Council” means the Union Council or the Town Committee constituted under the Law relating to Local Government for the time being in force.”",
  "[6]Section 3 “Punishment of male adult below twenty-one years of age marrying a child” omitted by the Muslim Family Laws Ordinance, 1961 (VIII of 1961).",
  "[7]Substituted by the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015) for the following:",
  "“4. Punishment for male adult above eighteen years of age marrying a child.– Whoever, being a male above eighteen years of age, contracts child marriage shall be punishable with simple imprisonment which may extend to one month, or with fine which may extend to one thousand rupees, or with both.”",
  "[8]Substituted by the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015) for “one month, or with fine which may extend to one thousand rupees, or with both”.",
  "[9]Substituted by the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015) for “one month, or with fine which may extend to one thousand rupees, or with both”.",
  "[10]X of 1897",
  "[11]XLV of 1860",
  "[12]V of 1898",
  "[13]The words “a Presidency Magistrate or” omitted by the Adaptation of Central Acts and Ordinances Order, 1949 (G.G.O. 4 of 1949).",
  "[14]Substituted by the Child Marriage Restraint (Second Amendment) Act 1938 (XIX of 1938) for “District Magistrate”.",
  "[15]Substituted by the Punjab Child Marriage Restraint (Amendment) Act 2015 (XII of 2015) for the following:",
  "“9. Mode of taking cognizance of offence.– No Court shall take cognizance of any offence under this Act [* * * *] after the expiry of one year from the date on which the offence is alleged to have been committed.”",
  "The words “except on a complaint made by the Union Council, or if there is no Union Council in the area, by such authority as the Provincial Government may in this behalf prescribe, and such cognizance shall in no case be taken” had been omitted by the Child Marriage Restraint (Punjab Amendment) Ordinance, 1971 (XXIII of 1971).",
  "[16]V of 1898",
  "[17]Section 11 “Power to take security from Complainant” omitted by the Muslim Family Laws Ordinance 1961 (VIII of 1961).",
  "[18]New section added by the Child Marriage Restraint (Second Amendment) Act 1938 (XIX of 1938)."
]