[
  "THE LIMITATION ACT, 1908  CONTENTS  SECTIONS:  PART I PRELEMINARY  1   Short title, extent and commencement. 2   Definitions.  PART II LIMITATION OF SUITS, APPEALS AND APPLICATIONS  3   Dismissal of suits, etc., instituted, etc., after period of limitation. 4   Where Court is closed when period expires. 5   Extension of period in certain cases. 6   Legal disability. 7   Disability of one of several plaintiffs or applicants. 8   Special exceptions. 9   Continuous running of time. 10   Suits against express trustees and their representatives. 11   Suits on foreign contracts.  PART III COMPUTATION OF PERIOD OF LIMITATION  12   Exclusion of time in legal proceedings. 13   Exclusion of time of defendants, absence from Pakistan and certain other territories. 14   Exclusion of time of proceeding   bona fide   in Court without jurisdiction. 15   Exclusion of time during which proceedings are suspended. 16   Exclusion of time during which proceedings to set aside execution sale are pending. 17   Effect of death before right to sue accrues. 18   Effect of fraud. 19   Effect of acknowledgment in writing. 20   Effect of payment on account of debt or of interest on legacy. Effect of receipt of produce of mortgaged land. 21   Agent of person under disability. Acknowledgement or payment by one of several joint contractors, etc. Page 1 of 50",
  "22   Effect of substituting or adding new plaintiff or defendant. 23   Continuing breaches and wrongs. 24   Suit for compensation for act not actionable without special damage. 25   Computation of time mentioned in instruments.  PART IV ACQUISITION OF OWNERSHIP BY POSSESSION  26   Acquisition of right to easements. 27   Exclusion in favour of reversioner of servient tenement. 28   [Omitted.]  Part V SAVING AND REPEALS  29   Savings. 30 to 32   [Repealed.]  THE FIRST SCHEDULE LIMITATION THE SECOND AND THIRD SCHEDULES [Repealed.] Page 2 of 50",
  "THE LIMITATION ACT, 1908  1 ACT NO. IX OF 1908  [7 th   August, 1908]  An Act to consolidate and amend the law for the Limitation of Suits, and for other purposes.  WHEREAS it is expedient to consolidate and amend the law relating to the limitation of suits, appeals and certain applications to Courts; and whereas it is also expedient to provide rules for acquiring by possession the ownership of easements and other property; It is hereby enacted as follows :  PART I PRELIMINARY 1. Short title, extent and commencement. ___ (1) This Act may be called the   2 *Limitation Act, 1908.  3 [(2) It extends to the whole of Pakistan.] (3) This section and section 31 shall come into force at once. The rest of this Act shall come into force on the first day of Jan uary, 1909.  1   For Statement of Objects and Reasons, see Gazette of India, 1908, Pt. V , p. 22 ; for Report of the Select Committee, see ibid., 1908, Pt. V , p. 223 ; and for Proceedings in Council, see ibid., 1908, Pt. VI, pp. 2, 13, 37 and 145. The Act has been declared to be in force in Baluchistan by the British Baluchistan Laws Regulation, 1913 (2 of 1913), s. 3. It has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950), and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499. It has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. It has also been extended to the Excluded Area of Upper Tanawal other than Phulera by the N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950 and declared to be in force in that area with effect from the 1st June, 1951, see N.W.F.P. Gazette, Ext., dated the 1st June, 1951. The Act, as inforce in the North West Frontier Province immediately before the commencement of N.W.F.P. Regulation No. II of 1974, has been applied to the Provincially Administered Tribal Areas of Chitral, Dir, Kalam, Swat, and Malakand Protected Area, by N.W.F.P. Regulation No. II of 1974, s. 3.  2 The word “Indian” omitted by A. O., 1949.  3 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3. and 2 nd   Sch. (with effect from the 14 th   October 1955), for the original sub section (2) as amended by A. O., 1949 . Page 3 of 50",
  "2. Definitions.   In this Act, unless there is anything repugnant in the subject or context, ___  (1) “applicant” includes any person from or through whom an applicant derives his right to apply:  1 [(2) “bill of exchange” has the same meaning as in section 5 of the Negotiable Instruments Act, 1881 (XXVI of 1881.) and includes a hundi and a cheque,] (3) “bond” includes any instrument whereby a person obliges himself to pay money to another, on condition that the obligation shall be void if a specified act is performed, or is not performed, as the case may be : (4) “defendant” includes any person from or through whom a defendant derives his liability to be sued: (5)   “easement” includes a right not arising from con tract, by which one person is entitled to remove and appropriate for his own profit any part of the soil belonging to another or anything growing in, or attached to or subsisting upon, the land of another: (6) “foreign country” means any country other than   2 [Pakistan   3 * * *]: (7)   “good faith” : nothing shall be deemed to be done in good faith which is not done with due care and atten tion: (8) “plaintiff” includes any person from or through whom a plaintiff derives his right to sue :  4 [(9)] “promissory note” has the same meaning as in the Negotiable Instruments Act, 1881 (XXVI of 1881.);] (10) “suit” does not include an appeal or an application: and (11) “trustee” does not include a benamidar, a mortgagee remaining in possession after the mortgage has been satisfied, or a wrong doer in possession without title. _____  PART II LIMITATION OF SUITS, APPEALS AND APPLICATIONS 3. Dismissal of suits, etc., instituted, etc., after period of limitation.   Subject to the provisions contained in sections 4 to 25 (inclusive), every suit instituted, appeal preferred, and application made, after the period of limitation prescribed therefore by the  1 Subs. by the Limitation (Amdt.) Ordinance, 1980 (62 of 1980), s. 2, for the original clause (2).  2 Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and Third Sch., for “British India”.  3 The comma and words “but includes an Acceding state” omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 2 and Second Sch.  4 Subs. by Ordinance 62 of 1980, s.2, for the original clause (9). Page 4 of 50",
  "first schedule shall be dismissed, although limitation has not been set up as a defence.  Explanation. ___ A suit is instituted, in ordinary cases, when the plaint is presented to the proper officer; in the case of a pauper, when his application for leave to sue as a pauper is made; and, in the case of a claim against a company which is being wound up by the Court, when the claimant first sends in his claim to the official liquidator.  4. Where Court is closed when period expires.   Where the period of limitation prescribed for any suit, appeal or application expires on a day when the Court is closed, the suit, appeal or application may be instituted, preferred or made on the day that the Court re opens.  5. Extension of period in certain cases.   Any appeal or application for   1 [a revision or] a review of judgment or for leave to appeal or any other application to which this section may be made applicable   2 [by or under any enactment] for the time being in force may be admitted after the period of limitation prescribed therefor, when the appellant or applicant satisfies the Court that he had sufficient cause for not preferring the appeal or making the application within such period.  Explanation. ___   The fact that the appellant or applicant was misled by any order, practice or judgment of the High Court in ascertaining or computing the prescribed period of limitation may be sufficient cause within the meaning of this section.  3 *   *   *   *   *   *   *  6. Legal disability. ___   (1) Where a person entitled to institute a suit   4 [or pro ceeding] or make an application for the execution of a decree is, at the time from which the period of limitation is to be reckoned, a minor, or insane, or an idiot, he may institute the suit   4 [or proceeding] or make the application within the same period after the disability has ceased, as would otherwise have been allowed  1 Ins. by the Limitation (Amdt.) Ordinance, 1962 (43 of 1962), s. 2.  2 Subs. by the Indian Limitation (Amdt.) Act, 1922 (10 of 1922), s. 2, for “by any enactment or rule”.  3 A section 5A was temporarily ins. here for a period of six months with effect from the 13th February 1948, see the Negotiable Instruments. Act (Temporary Amdt.) Ordinance, 1948 (6 of 1948), s. 3 and the Ministry of Finance Notification No. D. 2702 F/48, dated the 11th May, 1948, Gazette of Pakistan, 1948, Pt. I. p. 258.  4 lns. by Ord. 43 of 1962, s. 3. Page 5 of 50",
  "from the time prescribed therefor in the third column of the first schedule   1 [or in section 48 of the Code of Civil Procedure, 1908 (Act V of 1908)]. (2) Where such person is, at the time from which the period of limitation is to be reckoned, affected by two such disabilities, or where, before his disability has ceased, he is affected by another disability, he may institute the suit or make the application within the same period, after both disabilities have ceased, as would otherwise have been allowed from the time so prescribed. (3) Where the disability continues up to the death of such person, his legal representative may institute the suit or make the application within the same period after the death as would otherwise have been allowed from the time so prescribed. (4) Where such representative is at the date of the death affected by any such disability, the rules contained in sub sections (1) and (2) shall apply.  Illustrations  ( a )   The right to sue for the hire of a boat accrues to A during his minority. He attains majority four years after such accruer. He may institute his suit at any time within three years from the date of his attaining majo rity .  ( b )   A right to sue accrues to Z during his minority. After the accruer, but while Z is still a minor, he becomes insane. Time runs against Z from the date when his insanity and minority cease.  ( c )   A right to sue accrues to X during his minority. X dies before attain ing majority, and is succeeded by Y, his minor son. Time runs against Y from the date of his attaining majority.  7. Disability of one of several plaintiffs or applicants.   Where one of several persons jointly entitled to institute a suit   2 [or proceeding] or make an application for the execution of a decree is under any such disability, and a discharge can be given without the concurrence of such person, time will run against them all: but, where no such discharge can be given, time will not run as against any of them until one of them becomes capable of giving such discharge without the concurrence of the others or until the disability has ceased.  Illustrations  ( a )   A incurs a debt to a firm of which B, C and D are partners. B is insane, and C is a minor. D can give a discharge of the debt without the concurrence or B and C. Time runs against B, C and D.  ( b )   A incurs a debt to a firm of which E, F and G are partners. E and F are insane, and G is a minor. Time will not run against any of them until either E or F becomes sane, or G attains majority.  1 Added by the Limitation (Amdt.) Ordinance, 1962 (43 of 1962), s. 3.  2 Ins. ibid. Page 6 of 50",
  "1 8. Special exceptions.   Nothing in section 6 or in section 7 applies to suits to enforce rights of pre emption, or shall be deemed to extend, for more than three years from the cessation of the disability or the death of the person affected thereby, the period within which any suit must be instituted or application made.  Illustrations  ( a )   A, to whom a right to sue for a legacy has accrued during his minority, attains majority eleven years after such accruer. A has, under the ordinary law, only one year remaining within which to sue. But under section 6 and this section an extension of two years will be allowed him, making in all a period of three years from the date of his attaining majority, within which he may bring his suit.  ( b )   A right to sue for an hereditary office accrues to A who at the time is insane. Six years after the accruer A recovers his reason. A has six years, under the ordinary law, from the date when his insanity ceased within which to institute a suit. No extension of time will be given him under section 6 read with this section.  ( c )   A right to sue as landlord to recover possession from a tenant accrues to A, who is an idiot. A dies three years after the accruer, his idiocy continu ing up to the date of his death. A’s representative in interest has, under the ordinary law, nine years from the date of A’s death within which to bring a suit. Section 6 read with this section does not extend that   time,   except   where   the   representative   is   himself   under   disability   when   the representation devolves upon him.  9. Continuous running of time.   Where once time has begun to run, no subsequent disability or inability to sue stops it : Provided that where letters of administration to the estate of a creditor have been granted to his debtor, the running of the time prescribed for a suit to recover the debt shall be suspended while the administration continues.  10.   Suits   against   express   trustees   and   their   representatives.   Notwithstanding   anything hereinbefore contained, no suit against a person in whom property has become vested in trust for any specific purpose, or against his legal representatives or assigns (not being assigns for valuable consideration), for the purpose of following in his or their hands such property or the proceeds thereof, or for an account of such property or proceeds shall be barred by any length of time.  1 [For the purposes of this section any property comprised in a Hindu, Muhammadan or Buddhist religious or charitable endowment shall be deemed to be property vested in trust for a specific purpose,  1 Ins. by the Indian Limitation (Amdt.) Act, 1929 ( 1 of 1929),s. 2. Page 7 of 50",
  "and the manager of any such property shall be deemed to be the trustee thereof.]  11. Suits on foreign contracts. ___ (1) Suits instituted in   1 [Pakistan] on contracts entered into in a foreign country are subject to the rules of limitation contained in this Act. (2) No foreign rule of limitation shall be a defence to a suit instituted in   1 [Pakistan] on a contract entered into in a foreign country, unless the rule has extinguished the contract and the parties were domiciled in such country during the period prescribed by such rule. __________  PART III COMPUTATION OF PERIOD OF LIMITATION 12. Exclusion of time in legal proceedings. ___ (1) In computing the period of limitation prescribed for any suit, appeal or application, the day from which such period is to be reckoned shall be excluded. (2) In computing the period of limitation prescribed for an appeal, an application for leave to appeal and an application for a review of judgment, the day on which the judgment complained of was pronounced, and the time requisite for obtaining a copy of the decree, sentence or order appealed from or sought to be reviewed, shall be excluded. (3) Where a decree is appealed from or sought to be reviewed, the time requisite for obtaining a copy of the judgment on which it is founded shall also be excluded. (4) In computing the period of limitation prescribed for an application to set aside an award, the time requisite for obtaining a copy of the award shall be excluded.  2 [(5) For the purposes of sub sections (2), (3) and (4), the time requisite for obtaining a copy of the decree, sentence, order, judgment or award shall be deemed to be the time intervening between the day on which an application for the copy is made and the day actually intimated to the applicant to be the day on which the copy will be ready for delivery.]  13. Exclusion of time of defendants, absence from Pakistan and certain other territories.   In computing the period of limitation prescribed for any suit, the time during which the defendant has been absent from   1 [Pakistan] and from the territories beyond   1 [Pakistan] under the administration of  3 [the   4 [Federal Government]]   5 * * * shall be excluded.  1 Subs. by the Central laws (Statute Reform) Ordinance, 1960 (21 of 1960) s.3 and 2nd Sch., for “the Province and Capital of the Federation” which had been subs. by A.O., 1949, for British India.  2 Added by Act XIII of 1991, s.2.  3 Subs. by A.O., 1937 for “the Govt”.  4 Subs. by F.A.O., 1975, Art.2 and Table, for “Central Government”.  5 The words “or the Crown Representative” omitted by A. O. 1949. Page 8 of 50",
  "14. Exclusion of time   of proceeding   Bona fide   in Court without jurisdiction. __ (1) In computing the period of limitation prescribed for any suit, the time during which the plaintiff has been prosecuting with due diligence another civil proceeding, whether in a Court of first instance or in a Court of appeal, against the defendant, shall be excluded, where the proceeding is founded upon the same cause of action and is prosecuted in good faith in a Court which, from defect of jurisdiction, or other cause of a like nature, is unable to entertain it. (2) In computing the period of limitation prescribed for any application, the time during which the applicant has been pro secuting with due diligence another civil proceeding, whether in a Court of first instance or in a Court of appeal, against the same party for the same relief shall be excluded, where such proceeding is prosecuted in good faith in a Court which, from defect of jurisdiction, or other cause of a like nature, is unable to entertain it.  Explanation I. ___ In excluding the time during which a former suit or application was pending, the day on which that suit or application was instituted or made, and the day on which the proceedings therein ended, shall both be counted.  Explanation Il. ___ For the purposes of this section, a plaintiff or an applicant resisting an appeal shall be deemed to be prosecuting a proceeding.  Explanation III.— For the purposes of this section misjoinder of parties or of causes of action shall be deemed to be a cause of a like nature with defect of jurisdiction.  15. Exclusion of time during which proceedings are suspended. —(1) In computing the period of limitation prescribed for any suit or application for the execution of a decree, the institution or execution of which has been stayed by injunction or order, the time of the continuance of the injunction or order, the day on which it was issued or made, and the day on which it was withdrawn, shall be excluded. (2) In computing the period of limitation prescribed for any suit of which notice has been given in accordance with the requirements of any enactment for the time being in force, the period of such notice shall be excluded.  16. Exclusion of time during which proceedings to set aside execution sale are pending.   In computing the period of limitation prescribed for a suit for possession by a purchaser at a sale in execution of a decree, the time during which a proceeding to set aside the sale has been prosecured shall be excluded. Page 9 of 50",
  "17. Effect of death before right to sue accrues. ___ (1) Where a person, who would, if he were living, have a right to institute a suit or make an application, dies before the right accrues, the period of limitation shall be computed from the time when there is a legal representative of the deceased capable of instituting or making such suit or application. (2) Where a person against whom, if he were living, a right to institute a suit or make an application would have accrued dies before the right accrues, the period of limitation shall be computed from the time when there is a legal representative of the deceased against whom the plaintiff may institute or make such suit or application. (3) Nothing in sub sections (1) and (2) applies to suits to enforce rights of pre emption or to suits for the possession of immoveable property or of an hereditary office.  18. Effect of fraud.   Where any person having a right to institute a suit or make an application has, by means of fraud, been kept from the knowledge of such right or of the title on which it is founded, or where any document necessary to establish such right has been fraudulently concealed from him, the time limited for instituting a suit or making an application ___  (a)   against the person guilty of the fraud or accessory thereto, or  (b)   against any person claiming through him otherwise than in good faith and for a valuable consideration, shall be computed from the time when the fraud first became known to the person injuriously affected thereby, or, in the case of the concealed document, when he first had the means of pro ducing it or compelling its production.  19. Effect of acknowledgment in writing. ___ (1) Where, before the expiration of the period prescribed for a suit or application in respect of any property or right, an acknowledgment of liability in respect of such property or right has been made in writing signed by the party against whom such property or right is claimed, or by some person through whom he derives title or liability, a fresh period of limitation shall be computed from the time when the acknowledgment was so signed. (2) Where the writing containing the acknowledgment is undated, oral evidence may be given of the time when it was signed; but, subject to the provisions of the Evidence Act, 1872 (I of 1872) oral evidence of its contents shall not be received. Page 10 of 50",
  "Explanation I. ___ For the purposes of this section an acknowledgment may be sufficient though it omits to specify the exact nature of the property or right, or avers that the time for payment, delivery, performance or enjoyment has not yet come, or is accompanied by a refusal to pay, deliver, perform or permit to enjoy, or is coupled with a claim to a set off, or is addressed to a person other than the person entitled to the property or right.  Explanation II. ___ For the purposes of this section, “signed” means signed either personally or by an agent duly authorised in this behalf.  Explanation III . ___ For the purposes of this section an application for the execution of a decree or order is an application in respect of a right.  20. Effect of payment on account of debt or of interest on legacy. — 1 [(1) Where payment on account of a debt or of interest on a legacy is made before the expiration of the prescribed period by the person liable to pay the debt or legacy, or by his duly authorised agent, a fresh period of limitation shall be computed from the time when the payment was made:]  2 [Provided that   3 * * * an acknowledgment of the payment appears in the handwriting of, or in a writing signed by, the person making the payment.]  (2) Effect of receipt of produce of mortgaged land.   Where mortgaged land is in the possession of the mortgagee, the receipt of the rent or produce of such land shall be deemed to be a payment for the purpose of sub section (1).  Explanation. ___ Debt includes money payable under a decree or order of Court.  21. Agent of person under disability. ___ (1) The expression “agent duly authorised in his behalf,” in sections 19 and 20, shall, in the case of a person under disability, include his lawful guardian, committee or manager, or an agent duly authorised by such guardian, committee or manager to sign the acknowledgment or make the payment.  (2) Acknowledgement or payment by one of several joint contractors, etc.   Nothing in the said sections renders one of several joint contractors, partners, executors or mortgagees chargeable by reason only of a written acknowledgment signed or of a payment made by, or by the agent of, any other or others of them.  1 Subs. by the Indian Limitation (Amdt.) Act, 1942 (16 of 1942), s. 2, for the original sub section (1).  2 Subs. by the Indian Limitation (Amdt.) Act, 1927 (1 of 1927), s. 2 for the original proviso.  3 The commas and words “save in the case of payment of interest made before the 1st day of January, 1928,” omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Second Sch., Page 11 of 50",
  "1 [(3) For the purposes of the said sections ___  (a)   an acknowledgment signed, or a payment made, in respect of any liability, by, or by the duly authorised agent of, any widow or other limited owner of property who is governed by the Hindu law, shall be a valid acknowledgment or payment, as the case may be, as against a reversioner succeeding to such liability; and  (b)   where a liability has been incurred by, or on behalf of, a Hindu undivided family as such, an acknowledgment or payment made by, or by the duly authorised agent of, the manager of the family for the time being shall be deemed to have been made on behalf of the whole family.]  22. Effect of substituting or adding new plaintiff or defendant. ___   (1) Where, after the institution of a suit, a new plaintiff or defendant is substituted or added, the suit shall, as regards him, be deemed to have been instituted when he was so made a party. (2) Nothing in sub section (1) shall apply to a case where a party is added or substituted owing to an assignment or devolu tion of any interest during the pendency of a suit or where a plaintiff is made a defendant or a defendant is made a plaintiff.  23. Continuing breaches and wrongs.   In the case of a continuing breach of contract and in the case of a continuing wrong independent of contract, a fresh period of limitation begins to run at every moment of the time during which the breach or the wrong, as the case may be, continues.  24. Suit for compensation for act not actionable without special damage.   In the case of a suit for compensation for an act which does not give rise to a cause of action unless some specific injury actually results therefrom, the period of limitation shall be computed from the time when the injury results.  Illustration  A owns the surface of a field. B owns the subsoil. B digs coal thereout without causing any immediate apparent injury to the surface, but at last the surface subsides. The period of limitation in the case of a suit by A against B runs from the time of the subsidence.  1 Sub section (3) ins. by the Indian Limitation (Amdt.) Act, 1927 (1 of 1927), s. 3. Page 12 of 50",
  "25. Computation of time mentioned in instruments.   All instruments shall, for the purposes of this Act, be deemed to be made with reference to the Gregorian calendar.  Illustrations  ( a )   A Hindu makes a promissory note bearing a Native date only, and payable four months after date. The period of limitation applicable to a suit on the note runs from the expiration of four months after date computed according to the Gregorian calendar.  ( b )   A Hindu makes a bond, bearing a Native date only, for the repay ment of money within one year. The period of limitation applicable to a suit on the bond runs from the expiration of one year after date computed accord ing to the Gregorian calendar. __________  PART IV ACQUISITION OF OWNERSHIP BY POSSESSION 26. Acquisition of right to easements. ___ (1) Where the access and use of light or air to and for any building have been peaceably enjoyed therewith as an easement, and as of right, without interruption, and for twenty years, and where any way or watercourse, or the use of any water, or any other easement (whether affirmative or negative) has been peaceably and openly enjoyed by any person claiming title thereto as an easement and as of right without interruption, and for twenty years, the right to such access and use of light or air, way, watercourse, use of water, or other easement shall be absolute and indefeasible. Each of the said periods of twenty years shall be taken to be a period ending within two years next before the institution of the suit wherein the claim to which such period relates is contested. (2) Where the property over which a right is claimed under sub section (1) belongs to   1 [the Government], that sub section shall be read as if for the words “twenty years” the words   “sixty years” were substituted.  Explanation. ___ Nothing is an interruption within the meaning of this section, unless where there is an actual discontinuance of the possession or enjoyment by reason of an obstruction by the act of  1 The word “Govt.” was first subs. by A. O., 1937 and then amended by A. O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956), to read as above. Page 13 of 50",
  "some person other than the claimant, and unless such obstruction is submitted to or acquiesced in for one year after the claimant has notice thereof and of the person making or authorising the same to be made.  Illustrations  ( a )   A suit is brought in 1911 for obstructing a right of way. The defen dant admits the obstruction, but denies the right of way. The plaintiff proves that the right was peaceably and openly enjoyed by him, claiming title thereto as an easement and as of right, without interruption from 1st January 1890 to 1st January 1910. The plaintiff is entitled to judgment.  ( b )   In a like suit the plaintiff shows that the right was peaceably and openly enjoyed by him for twenty years. The defendant proves that the plaintiff, on one occasion during the twenty years, had asked his leave to enjoy the right. The suit shall be dismissed.  27. Exclusion in favour of reversioner of servient tenement.   Where any land or water upon, over or from which any easement has been enjoyed or derived has been held under or by   virtue of any interest for life or any term of years exceeding three years from the granting thereof, the time of the enjoyment of such easement during the continuance of such interest or term shall be excluded in the computation of the period of twenty years in case the claim is, within three years next after the determination of such interest or term, resisted by the person entitled, on such determination, to the said land or water.  Illustration  A sues for a declaration that he is entitled to a right of way over B’s land. A proves that he has enjoyed the right for twenty five years; but B shows that during ten of these years C, a Hindu widow, had a life interest in the land, that on C’s death B became entitled to the land, and that within two years after C’s death he contested A’s claim to the right. The suit must be dismissed, as A, with reference to the provisions of this section, has only proved enjoyment for fifteen years.  1 *   *   *   *   *   *   * __________  PART V SAVINGS AND REPEALS 29. Savings. ___ 2 [ ( 1) Nothing in this Act shall affect section 25 of the Contract Act, 1872 (IX of 1872).  1 Omitted by Act II of 1995, s. 2.  2 Subs. by the Indian Limitation (Amdt.) Act, 1922 (10 of 1922), s. 3, for the original sub section (1). Page 14 of 50",
  "(2) Where any special or local law prescribes for any suit, appeal or application a period of limitation different from the period prescribed therefor by the first schedule, the provisions of section 3 shall apply, as if such period were prescribed therefor in that schedule, and for the purpose of determining any period of limitation prescribed for any suit, appeal or application by any special or local law ___  (a)   the provisions contained in section 4, sections 9 to 18, and section 22 shall apply only in so far as, and to the extent to which, they are not expressly excluded by such special or local law; and  (b)   the remaining provisions of this Act shall not apply.]  1 [(3)] Nothing in this Act shall apply to suits under the Divorce Act (IV of 1869).  1 [(4)] Sections 26 and 27 and the definition of “easement” in section 2 shall not apply to cases arising in territories to which the Easements Act, 1882 (V of 1882), may for the time being extend.  30 and 31.   [ Provision for suits for which the period prescribed is shorter than that prescribed by the Indian Limitation Act,   1877.   Provision for suits by certain mortgagees in territories mentioned in the Second Schedule. ]   Rep. by the Repealing and Amending Act,   1930   (VIII of 1930),   s. 3   and Second Schedule.  32.   [ Repeals. ]   Rep. by the Second Repealing and Amending Act,   1914   (XVII of   1914), s. 3   and Second Schedule.  __________  1 The original sub sections (2) and (3) were re numbered as (3) and (4), by the Indian Limitation (Amdt.) Act, 1922 (10 of 1922), s. 3. Page 15 of 50",
  "THE FIRST SCHEDULE  (See section 3) FIRST DIVISION : SUITS Description of suit.   Period of limitation.   Time from which period begins to run. Part I.—Thirty days. 1.— To contest an award of the Board of Revenue Under the Waste Lands (Claims) Act, 1863 (XXIII of 1863). Thirty days   ..   When notice of the award is delivered to the plaintiff. 2.— For compensation for doing or for omitting to do an act alleged to be in pursuance of any enactment in force for the time being in   1 [Pakistan.] Part II.—Ninety days. Ninety days. .. When the act or omission takes place. 3.— Under the Specific Relief Act, 1877 (I of 1877), section 9, to recover possession of immoveable property. Part III.—Six months. Six months .. When the dispossession occurs.  2 *   *   *   *   *   *   *  1 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd   Sch. (with effect from the 14 th   October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”.  2 Article 4 relating to suits under the Employers and Workmen (Disputes) Act, 1860, omitted by the Repealing and Amending Act, 1937 (20 of 1937) s.3 and Second Schedule. Page 16 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  1 [ Part IV.—One year ]. 5.—   Under   the   summary procedure referred to in section 128 (2)   (f)   of   the   Code   of   Civil Procedure,   1908   (V   of 1908)   2 [where the provision of such summary procedure does not exclude the   ordinary   procedure   in   such suits 3 *   *].  4 [One year]   ..   When the debt or liquidated demand becomes   payable   or   when   the property becomes recoverable.  5 *   *   * 6.— Upon a Statute, Act, Regulation or Byelaw, for a penalty or forfeiture. One year   ..   When the penalty or forfeiture is incurred. 7.—   For the wages of a household servant, artisan or labourer   6 * * *.  7 [One year]   ..   When the wages accrue due. 8.—   For the price of food or drink sold by the keeper of a hotel, tavern or lodging house.  7 [One year]   ..   When the food or drink is delivered.  1 Ins. by the Indian Limitation (Amdt.) Act, 1925 (30 of 1925), s.2.  2 Added ibid.  3 The words “and under Order XXXVII of the said Code” omitted by the Civil Procedure and Limitation (Amdt.) Ordinance, 1961 (9 of 1961).  4 Subs. by Act 30 of 1925, s.2, for “Six months.”  5 The heading “Part IV .—One year” omitted, ibid.  6 The words “not provided for by this Schedule, Article 4” omitted by the Repealing and Amending Act, 1939 (34 of 1939) s.2 and First Sch.  7 Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 17 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd. Description of suit.   Period of limitation.   Time from which period begins to run.  Part IV.—One year— contd.  9.— For the price of lodging.   1 [One year]   ..   When the price becomes payable. 10.—To   enforce   a   right   of   pre emption whether the right is founded on   law,   or   general   usage,   or   on special contract.  1 [One year]   ..   When the purchaser takes, under the sale sought to be impeached, physical possession   of   the   whole   of   the property sold, or where the subject of the sale does not admit of physical possession,   when   the   instrument   of sale is registered. 11.—By a person, against whom any of   the   following   orders   has   been made to establish the right which he claims to the property comprised in the order :  1 [One year] ..   The date of the order. (1)   Order under the Code of Civil Procedure, 1908 (V of 1908), on a claim preferred to, or an   objection made to the attachment of, property attached in execution of a decree;  2 *   *   * 11A.—By a person against whom an order has  1 [One year]   The date of the order.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   Clause (2) omitted by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s.3 and Second Sch. Page 18 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run. Part IV.— One year— contd.  been made under the Code of Civil Procedure, 1908 (V of 1908), upon an   application   by   the   holder   of   a decree   for   the   possession   of immoveable   property   or   by   the purchaser of such property sold in execution of a decree, complaining of resistance   or   obstruction   to   the delivery   of   possession   thereof,   or upon an application by any person dispossessed of such property in the delivery of possession thereof to the decree holder   or   purchaser,   to establish the right which he claims to the   present   possession   of   the property comprised in the order. 12.—   To   set   aside   any   of   the following sales : (a) sale in execution of a decree of a Civil Court; (b) sale in pursuance of a decree or order   of   a   Collector   or   other officer of revenue;  1 [One year]   ..   When the sale is confirmed, or would otherwise   have   become   final   and conclusive   had   no   such   suit   been brought.  1 Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 19 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run. Part IV.— One year— contd.  (c) sale for arrears of Government revenue,   or   for   any   demand recoverable as such arrears;. (d)   sale of a patni taluq sold for current arrears of rent.  Explanation .—In this article “patni” includes   any   intermediate   tenure saleable for current arrears of rent. 13.—To alter or set aside a decision or   order   of   a   Civil Court   in   any proceeding other than a suit.  1 [One year] . .   The date of the final decision or rder in the case by a Court competent to determine it finally. 14.—To set aside any act or order of an officer of Government in his official capacity,not herein otherwise expressly provided for.  1 [One year] . .   The date of the act or order. 15.—Against   Government   to set   aside   any   attachment,   lease   or transfer of immoveable property by the revenue authorities for arrears of Government revenue.  1 [One year] . .   When the attachment, lease or transfer is made.  1 Subs. by the Repealing and Amending Act, 1923, (11 of 1923), s.2 and First Sch., for “Ditto”. Page 20 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part IV.—One year— contd.  16.—Against Government to recover money   paid   under   protest   in satisfaction of a   claim made by the revenue authorities on account of arrears of revenue or on   account of demands recoverable as such arrears. 1[One year] ..   When the payment is made. 17.—Against   Government   for compensation for land   acquired for public purposes. 1[One year] ..   The date of determining the amount of the compensation. 18.—Like   suit   for   compensation when   the   acquisition   is   not completed. 1[One year] ..   The date of the refusal to complete. 19.—For   compensation   for   false imprisonment. 1[One year] ..   When the imprisonment ends. 20.—By executors, administrators or representative   under   the   Legal Representatives’ Suits Act, 1855 (XII of 1855). 1[One year] ..   The date of the death of the person wronged. 21.—By executors, administrators or representatives   under   the   Fatal Accidents Act, 1855 (XIII of 1855). 1[One year] ..   The date of the death of the person killed. 22.—For   compensation   for   any other injury to the person. 1[One year] ..   When the injury is committed.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 21 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part IV.—One year— concld.  23.—For   compensation   for   a malicious prosecution.  1 [One year]   ..   When the plaintiff is acquitted, or the prosecution is otherwise terminated. 24.—For compensation for libel.   1 [One year]   ..   When the libel is published. 25.—For compensation for slander.   1 [One year]   ..   When the words are spoken, or, if the words   are   not   actionable   in themselves, when the special damage complained of results. 26.—For compensation for loss of service occasioned by the seduction of   the   plaintiff’s   servant   or daughter.  1 [One year]   ..   When the loss occurs. 27.—For compensation for inducing a person to break a contract with the plaintiff.  1 [One year]   ..   The date of the breach. 28.—For   compensation   for   and illegal, irregular or excessive distress.  1 [One year]   ..   The date of the distress. 29.—For compensation for wrongful seizure of moveable property under legal process.  1 [One year]   ..   The date of the seizure. 30.—Against   a   carrier   for compensation for losing or   injuring goods.  1 [One year]   ..   When the loss or injury occurs. 31.—Against   a   carrier   for compensation for non delivery of, or delay in delivering, goods.  1 [One year]   ..   When the goods ought to be delivered.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 22 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part V.—Two years.  32.—Against   one   who,   having   a right   to   use   property   for   specific purposes,   perverts   it   to   other purposes. Two years   ..   When the perversion first becomes known to the person injured thereby. 33.—Under   the   Legal Representatives’ Suits Act, 1855 (XII of 1855), against an executor.  1 [Two years]   ..   When the wrong complained of is done. 34.—Under the same Act against   an administrator.  1 [Two years]   ..   Ditto. 35.—Under the same Act against any other representative.  1 [Two years]   ..   Ditto. 36.—For   compensation   for   any malfeasance,   misfeasance   or nonfeasance independent of contract and not herein   specially   provided for.  1 [Two years]   ..   When the malfeasance, misfeasance or nonfeasance takes place.  Part VI.—Three years.  37.—For   compensation   for obstructing a way or a watercourse.  Three years ..   The date of the obstruction. 38.—For compensation for diverting a water course.  1 [Three years]   The date of the diversion. 39.—For compensation for trespass upon immoveable property.  1 [Three years]   The date of the trespass.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 23 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years— contd.  40.—For compensation for infringing copyright   or   any   other   exclusive privilege.  1 [Three years]   The date of the infringement. 41.—To restrain waste ..   1 [Three years]   When the waste begins. 42.—For   compensation   for   injury caused by an injunction wrongfully obtained.  1 [Three years]   When the injunction ceases. 43.—Under   the   2 [Succession Act,1925 (XXXIX of 1925), section 360   or   section   361,]   to   compel a refund   by   a   person   to   whom   an executor or administrator   has paid a legacy or distributed assets.  1 [Three years]   The date of the payment or distribution. 44.—By   a   ward   who   has attained majority, to set aside a   transfer of property by his guardian.  1 [Three years]   When the ward attains majority.  3   *   *   *   *   *   *   *  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   Subs. by the Repealing and Amending Act, 1930 (8 of 1930), s.2 and First Sch., for “Indian Succession Act, 1865, section 320 or section 321, or under the Probate and Administration Act, 1881, section 139 or section 140”.  3   Articles 45 and 46 omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and Second Sch. Page 24 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run. 47.—By   any   person   bound   by an order respecting the possession of immoveable property made under the Code of Criminal Procedure,   1898 (V of 1898),   2 * * * or by any one claiming   under   such   person,   to recover   the   property   comprised   in such order.  Part VI.—Three years contd.  1 [Three years]   The date of the final order in the case. 48.—For specific moveable property lost or acquired by theft, or dishonest mis appropriation or conversion,   or for   compensation   for   wrongfully taking or detaining the same.  1 [Three years]   When the person having the right to the   possession   of   the   property   first learns in whose possession it is.  3 [48A.—To   recover   moveable property conveyed or bequeathed in trust,   deposited   or   pawned,   and afterwards bought from the trustee, depositary or pawnee for a valuable consideration. Three years ..   When the sale becomes known to the plaintiff.  3 48B.—To   set   aside   sale   of moveable   property   comprised   in   a Hindu,   Muhammadan   or   Buddhist religious   or   charitable   endowment, made   by   a   manager   thereof   for   a valuable consideration. Three years ..   When the sale becomes known to the plaintiff.]  1 Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2 The words, commas and figures “or the Mamlatdars’ Courts Act, 1906,” omitted by A.O., 1949.  3 Entries 48A and 48B ins. by the Indian Limitation (Amdt.) Act, 1929 (1 of 1929), s.3. Page 25 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years — contd.  49.—For other specific moveable property, or for compensation for wrongfully taking or injuring or wrongfully detaining the same.  1 [Three years]   When the property is wrongfully taken or injured, or when the detainer’s possession becomes unlawful. 50.—For   the   hired   of animals,   vehicles, boats or household furniture.  1 [Three years]   When the hire becomes payable. 51.—For the balance of money advanced in payment of goods to be delivered.  1 [Three years]   When the goods ought to be delivered.  2 52.—For   the   price   of goods   sold   and delivered, where no fixed period of credit is agreed upon.  1 [Three years]   The date of the delivery of the goods.  2 53.—For   the   price   of goods   sold   and delivered to be paid for after the expiry of a fixed period of credit.  1 [Three years]   When the period of credit expires. 54.—For   the   price   of   goods   sold   and delivered   to   be   paid   for   by   a   bill   of exchange, no such bill being given.  1 [Three years]   When the period of the proposed bill elapses. 55.—For the price of trees or growing crops sold by the plaintiff to the defendant where no fixed period of credit is agreed upon.  1 [Three years]   The date of the sale. 56.—For the price of work done by the plaintiff for the   defendant at his   request, where no time has been fixed or payment.  1 [Three years]   When the work is done.  2 57.—For money payable for money lent.   1 [Three years]   When the loan is made.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   For period of limitation for these and certain other suits in the Province of the Punjab, see the Punjab Loans Limitation Act, 1904 (Punjab 1 of 1904), and s.29 (1) (b) of this Act. Page 26 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years— contd.  58.—Like suit when the lender has given a cheque for the   money.  1 [Three years]   When the cheque is paid.  2 59.—For   money   lent   under   an agreement that it shall be payable on demand.  1 [Three years]   When the loan is made. 60.—For money deposited under an agreement that it shall be payable on demand,   including   money   of   a customer in the hands of his banker so payable.  1 [Three years]   When the demand is made.  2 61.—For   money   payable   to   the plaintiff   for   money   paid   for   the defendant.  1 [Three years]   When the money is paid. 62.—For   money   payable   by   the defendant to the plaintiff for   money received by the   defendant for the plaintiff’s use.  1 [Three years]   When the money is received.  2 63.—For money payable for interest upon money due from the defendant to the plaintiff.  1 [Three years]   When the interest becomes due.  2 64.—For   money   payable   to   the plaintiff for money found to be due from the defendant to the plaintiff on accounts stated between them.  1 [Three years]   When   the   accounts   are   stated   in writing signed by the defendant or his agent duly authorized in this behalf, unless   where   the   debt   is,   by   a simultaneous   agreement   in   writing signed as aforesaid, made payable at a future time, and then when that time arrives.  3 [64A.—Under   Order   XXXVII   of the Code of Civil Procedure.  1 [Three years] ..   When the debt becomes payable.].  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2 For period of limitation for these and certain other suits in the Province of the Punjab, see the Punjab Loans Limitation Act, 1904 (Punjab 1 of 1904), and s.29 (1) (b) of this Act.  3 Articles 64A ins. by the Civil Procedure and Limitation (Amdt.) Ordinance, 1961 (9 of 1961), s.3. Page 27 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years— contd.  65.—For compensation for breach of a   promise   to   do   anything   at   a specified time, or upon the happening of a specified contingency.  1 [Three years]   When the time specified arrives or the contingency happens.  2 66.—On a single bond, where a day is specified for payment.  1 [Three years]   The day so specified.  2 67.—On a single bond, where no such day is specified.  1 [Three years]   The date of executing the bond.  2 68.—On   a   bond   subject   to   a condition.  1 [Three years]   When the condition is broken.  2 69.—On   a   bill   of   exchange   or promissory note payable at a fixed time after date.  1 [Three years]   When the bill or note falls due.  2 70.—On a bill of exchange payable at sight or after sight, but not at a fixed time.  1 [Three years]   When the bill is presented.  2 71.—On a bill of exchange accepted payable at a particular place.  1 [Three years]   When   the   bill   is   presented   at   that place. 72.—On   a   bill   of   exchange   or promissory note payable at a fixed time after sight or after demand.  1 [Three years]   When the fixed time expires. 73.—On   a   bill   of   exchange   or promissory note payable on demand and not accompanied by any writing restraining or postponing the right to sue.  1 [Three years]   The date of the bill or note.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   For period of limitation for these and certain other suits in the Province of the Punjab, see the Punjab Loans Limitation Act, 1904 (Punjab 1 of 1904), and s.29 (1) (b) of this Act. Page 28 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begin to run.  Part VI.—Three years— contd.  74.—On a promissory note or bond payable by instalments.  1 [Three years]   The   expiration   of   the   first   term   of payment as to the part then payable; and for the other parts the expiration of the respective terms of payment. 75.—On a promissory note or bond payable   by   instalments,   which provides that if default be made in payment of one or more instalments, the whole shall   be due.  1 [Three years]   When   the   default   is   made,   unless where the payee or obligee waives the benefit   of   the   provision,   and   then when fresh default is made in respect of which there is not such waiver.  2 76.—On a promissory note given by the maker to a third person to be delivered to the payee after a certain event should happen.  1 [Three years]   The date of the delivery to the payee.  2 77.—On a dishonoured foreign bill where   protest   has   been   made   and notice given.  1 [Three years]   When the notice is given.  2 78.—By   the   payee   against   the drawer of a bill of exchange which has   been   dishonoured   by   non acceptance.  1 [Three years]   The date of the refusal to accept.  2 79.—By   the   acceptor   of   an accommodation   –   bill   against   the drawer.  1 [Three years]   When the acceptor pays the amount of the bill.  2 80. Suit   on   a   bill   of   exchange, promissory note or bond not herein expressly provided for.  1 [Three years]   When the bill, note or bond becomes payable. 81.—By   a   surety   against   ..   the principal debtor.  1 [Three years]   When the surety pays the creditor.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2 For period of limitation for these and certain other suits in the Province of the Punjab, see the Punjab Loans Limitation Act, 1904 (Punjab 1 of 1904), and s.29 (1) (b) of this Act. Page 29 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period beings to run.  Part VI.—Three years— contd.  82.—By   a   surety   against   a   co surety.  1 [Three years]   When   the   surety   pays   anything   in excess of his own share. 83.—Upon   any   other   contract   to indemnify.  1 [Three years]   When   the   plaintiff   is   actually damnified. 84.—By an attorney or vakil for his cost of a suit or a particular business, there being no express agreement   as to the time when such costs are to be paid.  1 [Three years]   The date of the termination of the suit or business, or (Where the attorney or vakil property discontinues the suit or business)   the   date   of   such discontinuance. 85.—For   the   balance   due   on   a mutual,   open   and   current   account, where   there   have   been   reciprocal demands between the parties.  1 [Three years]   The close of the year in which the last item admitted or proved is entered in the   account;   such   year   to   be computed as in the account. 86.— 2 [(a) On a policy of insurance when   the   sum   insured   in   payable after   proof   of   the   death   has   been given to or received by the insurers. (b) On a policy of insurance   when the   sum   insured   is   payable   after proof of the loss has been given to or received by the insurers.]  1 [Three years]   2 [ (a)   The date of the death of the deceased.  (b)   The   date   of   the   occurrence causing the loss.] 87.—By   the   assured   to   recover premia paid under a policy voidable at the election of the insurers.  1 [Three years]   When the insurers elect to avoid the policy. 88.—Against a factor for an account.   1 [Three years]   When   the   account   is   during   the continuance of the agency, demanded and   refused   or,   where   no   such demand   is   made   when   the   agency terminates.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   Subs. for the original entry, by s. 122 of the Insurance Act, 1938 ( 4 of 1938), as amended by the Insurance (Amdt.) Act, 1941 (13 of 1941), s. 68. Page 30 of 50",
  "THE FIRST SCHEDULE.— contd.  FIRST DIVISION : SUITS— contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years— contd.  89.—By a principal against his agent for moveable property received by the latter and not accounted for.  1 [Three years]   Ditto. 90.—Other suits by principals against agents for neglect or misconduct.  1 [Three years]   When   the   neglect   or   misconduct becomes known to the plaintiff. 91.—To   cancel   or   set   aside   an instrument   not   otherwise   provided for.  1 [Three years]   When the facts entitling the plaintiff to have the instrument cancelled or set aside become known to him. 92.—To declare the forgery of an instrument issued or registered.  1 [Three years]   When   the   issue   or   registration becomes known to the plaintiff. 93.—To declare the forgery of an instrument attempted to be enforced against the plaintiff.  1 [Three years]   The date of the attempt. 94.—For property which the plaintiff has conveyed while insane.  1 [Three years]   When   the   plaintiff   is   restored   to sanity,   and   has   knowledge   of   the conveyance. 95.—To set aside a decree obtained by fraud, or for other relief on the ground of fraud.  1 [Three years]   When the fraud becomes known to the party wronged. 96.—For   relief   on   the   ground   of mistake.  1 [Three years]   When the mistake becomes known to the plaintiff. 97.—For   money   paid   upon   an existing   consideration   which afterwards fails.  1 [Three years]   The date of the failure.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 31 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd. Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years— contd.  98.—To   make   good   out   of   the general estate of a deceased trustee the loss occasioned by a breach of trust.  1 [Three years]   The date of the trustee’s death, or, if the loss has not then resulted, the date of the loss. 99.—For contribution by a party who has paid the whole or more than his share of the amount due under a joint decree, or by a sharer in a joint estate who has paid the whole or more than his share of the amount of   revenue due from himself and his co sharers.  1 [Three years]   The date of the payment in excess of the plaintiff’s own share. 100.—By   a   co trustee   to   enforce against   the   estate   of   a   deceased trustee a claim for contribution.  1 [Three years]   When   the   right   to   contribution accrues. 101.—For a seaman’s wages.   1 [Three years]   The end of the voyage during which the wages are earned. 102.—For   wages   not   other   wise expressly   provided   for   by   this schedule.  1 [Three years]   When the wages accrue due. 103.—By   a   2 [Muslim]   for   exigible dower ( mu’ ajjal ).  1 [Three years]   When   the   dower   is   demanded   and refused   or   (where,   during   the continuance of the marriage no such demand has been made),   when the marriage   is   dissolved   by   death   or divorce.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. 2 Subs. by F.A.O., 1975, Art. 2 and Table, for “Muhammadan”. Page 32 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd.  Description of suit.   Period of limitation.   Time from which period begins to run. Part VI.—Three years— contd. 104.—By a   1 [Muslim] for deferred dower ( mu’wajjal ).  2 [Three years]   When   the   marriage   is   dissolved   by death or divorce. 105.—By   a   mortgagor   after   the mortgage   has   been   satisfied,   to recover surplus collections received by the mortgagee.  2 [Three years]   When the mortgagor re enters on the mortgaged property. 106.—For an account and a share of the profits of a dissolved partnership.  2 [Three years]   The date of the dissolution. 107.—By   the   manager   of   a   joint estate   of   an   undivided   family   for contribution, in respect of a payment made   by   him   on   account   of   the estate.  2 [Three years]   The date of the payment. 108.—By a lessor for the value of trees cut down by his lessee contrary to the terms of the lease.  2 [Three years]   When the trees are cut down. 109.—For the profits of immoveable property   belonging to the plaintiff which have been wrongfully received by the defendant.  2 [Three years]   When the profits are received. 110.—For arrears of rent ..   2 [Three years]   When the arrears become due. 111.—By a vendor of   immoveable property   for   personal   payment   of unpaid purchase money.  2 [Three years]   The time fixed for completing the sale, or (where the title is accepted after the time fixed for completion) the date of the acceptance. 112.—For   a   call   by   a   company registered under any Statute or Act.  2 [Three years]   When the call is payable.  1 Subs. by F.A.O., 1975 Art.2 and Table, for “Muhammadan”.  2 Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 33 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VI.—Three years— contd.  113.—For specific performance of a contract.  1 [Three years]   The date fixed for the performance, or, if no such date is fixed, when the plaintiff has notice that performance is refused. 114.—For   the   rescission   of   a contract.  1 [Three years]   When the facts entitling the plaintiff to have   the   contract   rescinded   first become known to him. 115.—For   compensation   for   the breach of any contract, express or implied, not in writing registered and not herein specially provided for.  1 [Three years]   When   the   contract   is   broken,   or (where there are successive breaches) when the breach in respect of which the suit is instituted occurs, or (where the   breach   is   continuing)   when   it ceases. Part VII.—Six years. 116.—For   compensation   for   the breach   of   a   contract   in   writing registered.  Six years ..   When the period of limitation would begin to run against a suit brought on a similarly contract not registered. 117.—Upon a foreign judgment as defined   in   the   Code   of   Civil Procedure, 1908 (V of 1908).  1 [Six years]   The date of the judgment. 118.—To obtain a declaration that an   alleged   adoption   is   invalid,   or never, in fact, took place.  1 [Six years]   When the alleged adoption becomes known to the plaintiff. 119.—To obtain a declaration that an adoption is valid.  1 [Six years]   When the rights of the adopted son, as such, are interfered with. 120.—Suit for which no period of limitation   is   provided   elsewhere   in this schedule.  1 [Six years]   When the right to sue accrues.  Part VIII— Twelve years.  121.—To   avoid   incumbrances   or under tenures in an entire estate  Three years ..   When   the   sale   becomes   final   and conclusive.  1 Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 34 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VIII— Twelve years. __   contd. sold for arrears of Government revenue, or in a patni taluq or other saleable tenure sold for arrears of rent. 122.—Upon a judgment obtained in  1 [Pakistan], or a recognizance.  2 [Twelve years]   The   date   of   the   judgment   or recognizance. 123.—For a legacy or for a share of a residue bequeathed by a testator, or for   a   distributive   share   of   the property of an intestate.  2 [Twelve years]   When the legacy or share becomes payable or deliverable. 124.—For   possession   of   an hereditary office.  2 [Twelve years]   When the defendant takes possession of the office adversely to the plaintiff.  Explanation .—An hereditary office is possessed when the profits thereof are usually received, or (if there are no profits) when the duties thereof are usually performed. 125.—Suit   during   the   life   of   a Hindu   or   3 [Muslim]   female   by   a Hindu   or   3 [Muslim]   who,   if   the female died at the date of instituting the   suit, would be entitled to the possession   of   land,   to   have   an alienation of such land made by the female declared to be void except for here life or until her remarriage.  2 [Twelve years]   The date of the alienation.  1 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd   Sch, (with effect from the 14 th   October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”.  2   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  3   Subs. by F.A.O., 1975, Art. 2 and Table, for “Muhammadan”. Page 35 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VIII.— Twelve years —contd.  126.—By a Hindu governed by   the law of the Mitakshara to set aside his father’s   alienation   of   ancestral property.  1 [Twelve years]   When the alience takes possession of the property. 127.—By   a   person   excluded   from joint   family   property   to   enforce   a right to share therein.  1 [Twelve years]   When the exclusion becomes known to the plaintiff. 128.—By   a   Hindu   for   arrears   of maintenance.  1 [Twelve years]   When the arrears are payable. 129.—By a Hindu for a declaration of his right to maintenance.  1 [Twelve years]   When the right is denied. 130.—For   the   resumption   or assessment of rent free land.  1 [Twelve years]   When the right to resume or assess the land first accrues. 131.—To   establish   a   periodically recurring right.  1 [Twelve years]   When the plaintiff is first refused the enjoyment of the right. 132.—To enforce payment of money charged upon immoveable property.  2 [Explanation.—For the purposes of this article— (a)   the   allowance   and   fees respectively   called   malikana   and haqqs, and (b)   the value of any agricultural or other   produce   the   right   to   receive which is secured by a charge upon immoveable property,   3 [and  1 [Twelve years]   When the money sued for becomes due.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   Subs. by the Indian Limitation (Amdt.) Act, 1927 (1 of 1927), s.4 (1), for the original Explanation.  3   Ins. by the Transfer of Property (Amdt.) Supplementary Act, 1929 (21 of 1929) s. 9. Page 36 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd.  Description of suit.   Period of limitation.   Time from which period begins to run.  Part VIII.—Twelve Years —contd.  (c)   advances   secured   by mortgage by deposit of title deeds], shall be deemed to be money charged upon immoveable property.],  1 *   *   *   *   *   *   * 134.—To   recover   possession   of immoveable   property   conveyed   or bequeathed in trust or mortgaged and afterwards transferred by   the trustee or   mortgagee   for   a   valuable consideration.  2 [Twelve years]   3 [When the transfer becomes known to the plaintiff.]  4 [134A.—To set aside a transfer of immoveable property comprised in a Hindu,   5 [Muslim]   or   Buddhist religious   or   charitable   endowment, made by a manager thereof for a valuable consideration.  2 [Twelve years]   When the transfer becomes known to the plaintiff. 134B.—By the manager of a Hindu,  5 [Muslim]   or   Buddhist   religious   or charitable endowment to   recover possession of immoveable property comprised in the   endowment which has   been transferred by a   previous manager for valuable consideration.  2 [Twelve years]   The death, resignation or removal of the transferor.  1   Article 133 omitted by the Indian Limitation (Amdt.) Act, 1929 (1 of 1929), s.3.  2   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  3   Subs. by Act 1 of 1929, s.3, for “the date of the transfer”.  4   Articles 134A, 134B and 134C, ins. by the Indian Limitation (Amdt.) Act, 1929 (1 of 1929), s.3.  5   Subs. by F.A.O., 1975, Art.2 and Table, for “Muhammadan”. Page 37 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd. Description of suit.   Period of limitation.   Time from which period begins to run.  Part VIII. Twelve Year —contd.  134C.—By the manager of a Hindu, 1 [Muslim]   or   Buddhist religious or charitable endowment to recover   possession   of   moveable property   comprised   in   the endowment which has   been sold by a previous manager for a valuable consideration. Twelve years   The death, a resignation or removal of the seller.] 135.—Suit   instituted   in   a Court   2 [other than a High Court] by a   mortgage   for   possession   of immoveable property mortgaged.  3 [Twelve years]   When   the   mortgage’s   right   to possession determines. 136.—By a purchaser at a private sale   for   possession   of   immoveable property sold when the vendor was out of possession at the date of the sale.  3 [Twelve years]   When the vendor is first entitled to possession. 137.—Like suit by a purchaser at a sale in execution of a decree when the   judgment   debtor   was   out   of possession at the date of   the sale.  3 [Twelve years]   When   the   judgment debtor   is   first entitled to possession. 138.—Like suit by a purchaser at a sale in execution of a decree, when the   judgment debtor   was   in possession at the date of the sale.  3 [Twelve years]   The   date   when   the   sale   becomes absolute. 139.—By   a   landlord   to   recover possession from a tenant.  3 [Twelve years]   When the tenancy is determined.  1   Subs. by F.A.O, 1975, Art. 2 and Table, for “Muhammadan”.  2   Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2 nd   Sch., for “not established by Royal Charterl” (with effect from the 14 th   October, 1955).  3   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 38 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd.  Description of suit.   Period of limitation.   Time from which period begins to run. Part VIII.— Twelve years —contd. 140.—By   a   remainderman,   a reversioner (other than a landlord) or a   devisee,   for   possession   of immoveable property.  1 [Twelve years]   When his estate falls into possession. 141.—Like   suits   by   a   Hindu or   2 [Muslim]   entitled   to   the possession of immoveable property on the death of a Hindu or   2 [Muslim] female.  1 [Twelve years]   When the female dies. 142.—For possession of immoveable property when the plaintiff while in possession of the property, has been dispossessed or   has discontinued the possession.  1 [Twelve years]   The   date   of   the   dispossession   or discontinuance. 143.—Like suit,   when the plaintiff has become entitled by reason of any forfeiture or breach of condition.  1 [Twelve years]   When the forfeiture is incurred or the condition is broken.  3*   *   *  Part IX.—Thirty years.  145.—Against   a   depositary   or pawnee to recover Thirty years   The date of the deposit or pawn.  1   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  2   Subs. by F.A.O., 1975, Art. 2 and Table, for “Muhammadan”.  3   Omitted by Act. II of 1995, s.3. Page 39 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd. Description of suit.   Period of limitation.   Time from which period begins to run.  Part IX.—Thirty Years.— contd.  moveable property deposited or pawned. 146.— Before a   1 [High Court] in the exercise of its ordinary original civil jurisdiction   by   a   mortgagee   to recover   from   the   mortgage   the possession of immoveable property mortgaged.  2 [Thirty years]   When   any   part   of   the   principal or interest was last paid on account of the mortgage debt. 146A.—By or on behalf of any local authority for possession of any public street   or   road   or   any   part   thereof from which it has been dispossessed or of which it has discontinued the possession.  2 [Thirty years]   The   date   of   the   dispossession   or discontinuance. Part X.—Sixty years. 147.—By a mortgage for foreclosure or sale.  Sixty years   When   the   money   secured   by   the mortgage becomes due. 148.—Against   a   mortgagee   to redeem or to recover possession of immoveable property mortgaged.  2 [Sixty years]   When   the   right   to   redeem   or   to recover possession accrues : Provided   that   all claims   to   redeem arising under instruments of mortgage  1 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd   Sch. for “Court established by Royal Charter” (with effect from the 14 th   October, 1955).  2   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 40 of 50",
  "THE FIRST SCHEDULE.—contd. FIRST DIVISION : SUITS—contd. Description of suit.   Period of limitation.   Time from which period begins to run.  Part X.—Sixty years— contd.  of   immoveable   property   situate   in Lower,   Burma   which   had   been executed before the first day of May, 1863, shall be governed by the rules of limitation in force in that Province immediately before the same day. 149.— 1 [Any suit by or on behalf of the   3 [Federal Government]   or   any [Provincial Government]   4 [except a suit before the   5 [Supreme Court] in the   exercise   of   its   original jurisdiction].  2 [Sixty years]   ..   When the period of limitation would begin to run under this Act against a like suit by a private person. SECOND DIVISION : APPEALS Description of Appeal.   Period of limitation.   Time from which period begins to run. 150.—Under the Code of Criminal Procedure, 1898 (V of 1898, from a sentence of death   passed by a Court   of   Session   6 [or   by   a   High Court in the exercise of its   original Criminal Jurisdiction]. Seven days   ..   The date of the sentence.  1   The original words “Any suit by or on behalf of the Secretary of State for India in Council,” have successively been amended by A.O., 1937, and A.O., 1949, to read as above.  2   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  3   Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”.  4   Ins. by the Indian Limitation (Amdt.) Act, 1937 (14 of 1937), s.2.  5   Subs. by A.O., 1961, Art. 2 and Sch., for “Federal Court” (with effect from the 23 rd   March, 1956).  6   Added by the Criminal Procedure Amdt. Act, 1943 (26 of 1943), s.8. Page 41 of 50",
  "THE FIRST SCHEDULE.—contd. SECOND DIVISION : APPEALS—contd.  Description of Appeal.   Period of limitation.   Time from which period begins to run.  1 *   *   *   *   *   *   * 151.— From a decree or order of  2 [a High Court] in the exercise of its original jurisdiction. Twenty days ..   The date of the decree or order. 152.—Under the Code of Civil Procedure, 1908 (V of 1908), to the Court of a District Judge. Thirty days ..   The date of the decree or order appealed from. 153.—Under   the   same   Code   to   a High Court from an order of a Sub ordinate   Court   refusing   leave   to appeal to   4 [the Supreme Court.]  3 [Thirty days]   The date of the order. 154.—Under the Code of Criminal Procedure, 1898 (V of 1898), to any Court other than a   High Court.  3 [Thirty days]   The date of the sentence or order appealed from. 155.—Under   the   same   Code   to a High Court,   except in the cases provided for by article 150 and article 157. Sixty days ..   The   date   of   the   sentence   or   order appealed from.  1 Article 150A which was inserted by the Criminal Law Amdt. Act, 1923 (12 of 1923), s. 42 has been omitted by the Criminal law (Extinction of Discriminatory Privileges) Act, 1949 (2 of 1950), s.2 and Sch.  2   The original words “any of the High Courts of Judicature at Fort William, Madras and Bombay or the Chief Court of the Punjab or the Chief Court of Lower Burma” have successively been amended by the Repealing and Amending Act, 1930 (8 of 1930), A.O., 1937, A.O., 1949 and the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd   Sch. (with effect from the 14 th   October, 1955), to read as above.  3   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”.  4   Subs. by .A.O., 1961, Art. 2 and Sch., for “His Majesty in Council” (with effect from the 23 rd   March, 1956). Page 42 of 50",
  "THE FIRST SCHEDULE.—contd. SECOND DIVISION : APPEALS—contd.  Description of Appeal.   Period of limitation.   Time from which period beings to run. 156.—   Under   the   Code   of   Civil Procedure, 1908 (V of 1908), to a High   Court,   except   in   the   cases provided for by article 151   and article 153. Ninety days   ..   The   date   of   the   decree   or   order appealed from. 157.— Under the Code of Criminal Procedure, 1898 (V of 1898), from an order of acquittal. Six months   ..   The date of the order appealed from. THIRD DIVISION : APPLICATIONS. Description of application.   Period of limitation.   Time from which period begins to run.  1 [158.—Under   the   Arbitration   Act, 1940 (X of 1940), to set aside an award or to get an award remitted for reconsideration. Thirty days ..   The date of service of the notice of filling of the award.] 159.—   For   leave   to   appear   and defend   a   suit   under   summary procedure   referred to in section 128 (2)(f)   2 [or under Order   XXXVII] of the   3 [Code of Civil Procedure, 1908 (V of 1908)].  4 [Ten days] ..   When the summons in served. 160.— For an order under the same Code,   to   restore   to   the   file   an application for review Fifteen days ..   When the application for review is rejected.  1 Subs. (from the 1 st   July, 1940) by the Arbitration Act, 1940 (10 of 1940), s. 49 (2) and Fourth Sch., for Art. 158 which was previously amended by the Repealing and Amending Act, 1919 (18 of 1919), s.2 and First Sch.  2   Ins. by the Indian Limitation (Amdt.) Act, 1925 ( 30 of 1925), s.3  3   Subs. by Act 10 of 1940, Fourth Sch., for “same Code” (from 1 st   July, 1940).  4   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First Sch., for “Ditto”. Page 43 of 50",
  "THE FIRST SCHEDULE.—contd. THIRD DIVISION : APPLICATIONS—contd. Description of application.   Period of limitation.   Time from which period beings to run. rejected in consequence of the failure of the applicant to appear when the application   was   called   on   for hearing. 161.— For a review of judgment by a   1 * Court of Small Causes   2 *   *   * or by a   Court invested with the jurisdiction of a   1 * Court   of Small Causes   when   exercising   that jurisdiction.  3 [Fifteen days]   The date of the decree or order. 162.— For a review of judgment by  4 [a High Twenty days   The date of the decree or order.  1 The word “provincial” omitted by the Berar Laws Act, 1941 (4 of 1941), s.2 and Third Sch. (with effect from the 1 st   August, 1941).  2   The parentheses and words “(other than Presidency Small Cause Court)” which were ins. ibid. (with effect from the 1 st   August, 1941), have been omitted by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s.3 and Second Sch.  3   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and 1 st   Sch., for “Ditto”.  4 Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd   Sch. (with effect from the 14 th   October, 1955), for “any of *[the following Courts, namely] the †[High Court of East Bengal, the High Court, at Lahore] and the Chief Court of Sind”.* Ins. by the Repealing and Amending Act, 1927 (10 of 1927), s.2 and First Sch. *The original words were “High Courts of Judicature at Fort William, Madras, and Bombay or the Chief Court of the Punjab or the Chief Court of Lower Burma”. The Sind Courts (Supplementary) Act, 1926 (34 of 1926) which was to come into force on the commencement of the Sind Courts Act, 1926 (Bom. 7 of 1926), directed the insertion of the words “or the Chief Court of Sind” after the word “Bombay”. Though this amendment had not come into force the words “Bombay, Lahore and Rangoon and the Chief Court of Sind” were subs. for the words “and Bombay or the Chief Court of Sind or the Chief Court of the Punjab or the Chief Court of Lower Burma” by Act 10 of 1927, s.2 and First Sch. for the words “Lahore and Rangoon”. Page 44 of 50",
  "THE FIRST SCHEDULE.—contd. THIRD DIVISION : APPLICATIONS—contd. Description of application.   Period of limitation.   Time from which period beings to run. Court] in the exercise of its original jurisdiction.  1 *   *   *   *   *   *   *  163.— By a plaintiff, for an order to set aside a dismissal for default of appearance or for failure to pay costs of service of process or to furnish security for costs. Thirty days   ..   The date of the dismissal. 164.—   By a   defendant,   for   an order to set aside a decree passed ex parte.  2 [Thirty days]   ..   The date of the decree or where the summons was not duly served, when the applicant has knowledge of the decree. 165.— Under the Code of Civil Procedure, 1908 (V of 1908) by a person   dispossessed   of immoveable   property   and disputing the right of the decree holder or purchaser at a sale in execution of a decree to be put into possession.  2 [Thirty days]   ..   The date of the dispossession.  the words “Lahore, Rangoon and Nagpur” were subs. by the C.P. Courts (Supplementary) Act, 1935 (8 of 1935), s.2 and Sch., and the word “Rangoon” was omitted by A.O., 1937. Lastly A.O., 1949, substituted “High Courts of Judicature at Fort William, Madras, Bombay, Lahore and Nagpur” by “High Court of East Bengal, the High Court at Lahore”.  1 Article 162A as ins. by the Limitation (Amdt.) Ordinance, 1962 (43 of 1962), s.5 has been omitted by the Limitation (Amdt.) Act, 1965, (11 of 1965), s.2.  2   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First t   Sch., for “Ditto”. Page 45 of 50",
  "THE FIRST SCHEDULE.—contd. THIRD DIVISION : APPLICATION—contd.  Description of application.   Period of limitation.   Time from which period beings to run. 166.— Under the same Code to set aside   a   sale   in   execution   of   a decree   1 [including   any   such application by a Judgment debtor.]  2 [Thirty days]   ..   The date of the sale. 167.— Complaining of resistance or obstruction to delivery of possession of immoveable property decreed or sold in execution of a decree.  2 [Thirty days]   ..   The   date   of   the   resistance   or obstruction. 168.—   For   the   readmission   of   an appeal   dismissed   for   want   of prosecution.  2 [Thirty days]   ..   The date of the dismissal. 169.—   For   the   re hearing   of   an appeal heard ex parte.  2 [Thirty days]   ..   The date of the decree in appeal, or, where notice of the appeal was not duly served, when the applicant has knowledge of the decree. 170.—   For   leave   to   appeal   as   a pauper.  2 [Thirty days]   ..   4 [The   date   of   the   decree   appealed from.] 171.—   Under   the   Code   of   Civil Procedure, 1908 (V of 1908),   3 [by the legal representative of a deceased plaintiff   or   defendant   for   setting aside an order or Judgment made or pronounced in his absence]. Sixty days   ..   The date of the order of Judgement. 172.— Under the same Code by   the assignee   or   the   receiver   of   an insolvent plaintiff or appellant for an order to set aside the dismissal of a suit or an appeal.  2 [Sixty days]   ..   The date of the order of dismissal.  1 Ins. by the Indian Limitation (Amdt.) Act, 1927 (1 of 1927), s.4 (2).  2   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), s.2 and First, Sch., for “Ditto”.  3   Subs. by the Law Reforms Ordinance, 1972 (12 of 1972), s.2 and Sch., for “an order to set aside an abatement”.  4   Subs. ibid., s.2 and Sch., for “the date of the abatement”. Page 46 of 50",
  "THE FIRST SCHEDULE.—contd. THIRD DIVISION : APPLICATIONS   ___ contd. Description of application.   Period of limitation.   Time from which period beings to run. 173.—   For   a   review   of   judgment except in the cases provided for by article 161 and article 162. Ninety days   ..   The date of the decree or order. 174.—   For   the   issue   of   a   notice under the same Code, to show cause why any payment made out of Court of any money payable under a decree or   any   adjustment   of   the   decree should not be recorded as certified.  1 [Ninety days]   When the payment or adjustment is made. 175.— For payment of the amount of a decree by installments. Six months   ..   The date of the decree. 176.—   Under   the   same   Code   to have the legal   representative of a deceased plaintiff or of a deceased appellant made a party.  2 [Ninety days]   The date of the death of the deceased plaintiff or appellant. 177.— Under the same Code to have the legal representative of a deceased defendant   or   of   a   deceased respondent made a party.  1 [Ninety days]   The date of the death of the deceased defendant or respondent.  3 [178.—Under   the   Arbitration   Act, 1940 (X of 1940), for the filling   in Court of an award. Ninety days   ..   The date of service of the notice of making of the award].  1 Subs. by the Repealing and Amending Act, 1923 (11 of 1923), for “Ditto”.  2   Subs. by the Indian Limitation and Code of Civil Procedure (Amdt.) Act, 1920 (26 of 1920), s.2, for “Ditto”.  3   Subs. by the Arbitration Act, 1940 (10 of 1940), Fourth Sch., for the original Art. 178 (with effect from the 1 st   July, 1940). Page 47 of 50",
  "THE FIRST SCHEDULE.—contd. THIRD DIVISION : APPLICATION—contd.  Description of application.   Period of limitation.   Time from which period beings to run. 179.—   By   a   person   desiring   to appeal under the   1 [Code of Civil Procedure,   1908   (V   of   1908)]   to  2 [the Supreme Court] for leave to appeal.  3 [Ninety days]   The date of the decree appealed from. 180.—   By   a   purchaser   of immoveable   property   at   a   sale   in execution of a decree for delivery of possession. Three years   ..   When the sale becomes absolute. 181.—   Applications   for   which   no period   of   limitation   is   provided elsewhere   in   this   schedule   or   by section   48   of   the   Code   of   Civil Procedure, 1908 ( V of 1908).  4 [Three years]   When the right to apply accrues.  5 *   *   *   *   *   *   * 183.—   To   enforce   a   judgment, decree or order of any   6 [High Court] in   the   exercise   of   its   ordinary original civil jurisdiction, or an  7 [Six years]   ..   When a present right to enforce the judgment, decree or order accrues to some person capable of releasing the right :  1 Subs. by the Arbitration Act, 1940 (10 of 1940), Fourth Sch., for “same Code” (with effect from the 1 st   July, 1940).  2   Subs. by A.O., 1961, Art. 2 and Sch. for “His Majesty in Council” (with effect from the 23 rd   March, 1956).  3   Subs. by the Indian Limitation and Code of Civil Procedure (Amdt.) Act, 1920 (26 of 1920), s.2, for “Ditto”.  4   Subs. by the Repealing and Amending Act, 1923 (11 of 1923), for “Ditto”.  5   Article 182 omitted by the Law Reforms Ordinance, 1972 (12 of 1972) s.2 and Sch., which was previously amended by Ord. 43 of 1962, s.5.  6   Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2 nd   Sch. for “Court established by Royal Charter” (with effect from the 14 th   October, 1955).  7   Subs. by the Law Reforms Ordinance, 1972 (12 of 1972), s.2 and Sch., for “Twelve years”. Page 48 of 50",
  "THE FIRST SCHEDULE.—contd. THIRD DIVISION : APPLICATION—contd. Description of application.   Period of limitation.   Time from which period beings to run. order of   1 [the supreme Court]. Provided   that   when   the   judgment, decree or order has been revived, or some   part   of   the   principal   money secured thereby, or some interest on such money has been paid, or some acknowledgment of the right thereto has been given in writing signed by the person liable to pay such principal or interest or his agent,   to the person entitled   thereto   or   his   agent,   the twelve years shall be computed from the date of such revivor, payment or acknowledgment or the latest of such revivors,   payments   or acknowledgments,   as   the   case   may be. THE SECOND SCHEDULE.—[TERRITORIES REFERRED TO IN SECTION 31.]   Rep. by the Repealing and Amending Act, 1930 (VIII of 1930), s.3 and Second Schedule . __________  THE THIRD SCHEDULE.—[ENACTMENTS REPEALED.]  Rep. by the Second Repealing and Amending Act, 1914 (XVII of 1914), s.3 and Second Schedule.  __________  1   Subs. by F.A.O. 1961, Art. 2 and Sch., for “His Majesty in Council” (with effect from the 23 rd   March, 1956). Page 49 of 50",
  "Page 50 of 50"
]