[
  "WEST PAKISTAN LAND REVENUE RULES, 1968  (As amended upto date) (April 2010 )  Compiled by  PROJECT MANAGEMENT UNIT COMPUTERIZATION OF LAND RECORDS BOARD OF REVENUE, PUNJAB, LAHORE.",
  "WEST PAKISTAN LAND REVENUE RULES, 1968 C O N T E N T S  Preamble .................................................................................................................  PART I - PRELIMINARY  1.   Short title and commencement................................................................................  2.   Definitions. ................................................................................................................ 1  PART II- PROCEDURE OF REVENUE OFFICERS  3.   Statements and pleadings to be brief.. .................................................................... 4.   Verification of applications, etc. ............................................................................. 5.   Proceedings not to abate on death or marriage of party   ....................................... 6.   In fixing dates, etc. Revenue Officer to follow procedure of Revenue Court ........ 6-A.   Remand of cases ..................................................................................................... 7.   Commissions– Act V of 1908. ................................................................................ 8.   Expenses of witnesses. ............................................................................................ 9.   Record of mutation proceedings. ............................................................................ 10.   Record of other proceedings under the Act. ........................................................... 11.   Contents of orders. . ................................................................................................ 12.   Apportionment and recovery of costs. . .................................................................. 13.   Execution of orders of ejectment, etc. .................................................................... 14.   Charges for service of process through post. . .......................................................  PART III – VILLAGE HEADMEN ( LAMBARDARS )  15.   ................................................................................................................................. 16.   Number of headmen. ............................................................................................... 17.   Matters to be considered in first appointment......................................................... 18.   Dismissal of headmen. ............................................................................................ 19.   Matters to be considered in appointment of successor. .......................................... 20.   Appointment of revenue farmers and mortgagees as headmen. ............................. 21.   Appointment of officiating headmen in place of absentees. ................................... 22.   Duties of headmen. ................................................................................................. 23.   Collection, control and distribution of village officers’ cesses............................... 24.   Punishments. ................................................................................................................ 25.   Appointment of substitutes for non-resident headmen. ..........................................",
  "26.   Appointment of other substitutes and their position. .............................................. 27.   Determination of office of substitute. ..................................................................... 28.   Rules governing appointment and removal of substitute. . ..................................... 29.   Remuneration of substitute. ....................................................................................  PART IV- RECORDS-OF-RIGHTS AND PERIODICAL RECORDS  30.   Other documents included in the records-of-rights and periodical records. ........... 31.   Manner in which the Record-of-Rights prepared, signed and attested. .................. 32.   Gist of the order of mutation. .................................................................................. 33.   Report regarding cause of delay in mutation cases. ................................................ 34.   Roznamcha Waqiati to be maintained by the Patwari. ........................................... 34-A.   Collection of mutation fee in cases of registered deeds .......................................... 35.   Production of documents or furnishing of information under section 47. .............. 36.   Inspection of records of Patwaris and grant of certified copies or extracts therefrom. ................................................................................... 37.   Inspection of maps and land records filed in the Tehsil revenue record room or consigned to the district/sub-divisional revenue record room. ................. 37-A.   Preparation of produce statements and five-yearly abstracts of yield ....................  PART V- CROP INSPECTION AND KHARABA  38.   Date on which inspection of each harvest to be commenced ................................. 39.   Crop Inspection Register ........................................................................................ 39-A.   Fard Raftar Girdawari ............................................................................................ 40.   Correction of entries in the Crop Inspection Register. ........................................... 41.   Failure of crop to be entered in the Register Girdawari.......................................... 42.   Scale on which relief to be given ........................................................................... 43.   Circumstances under which no Kharaba Statement is to be prepared ....................  PART VI-DEMAND STATEMENTS ( Dhal Bachh )  44.   Bachh Papers. .........................................................................................................  PART VII-A. COLLECTION OF LAND REVENUE BY   LAMBARDARS  45.   Place of payment. ....................................................................................................  B. COLLECTION OF LAND REVENUE BY   TAPEDARS  46.   Payment of land revenue and rates and cesses........................................................ 47.   Security to be furnished by Mukhtiarkar, Head Munshi, Supervising Tapedar and Tapedar. ......................................................................... 48.   Surety to be liable in the same manner as Principal. .............................................. 49.   Liability of surety not effected by death of Principal or by his taking a different appointment. ...............................................................................",
  "50.   How surety may withdraw from further liability ................................................... 51.   Register of sureties. .................................................................................................  COLLECTION OF RATES AND CESSES  52.   Number of instalments and amount. ....................................................................... 53.   Rates and cesses paid alongwith first instalments of land revenue. ....................... 54.   Rules in the case of estates in which no land revenue is payable. .......................... 55.   Portion of rates and cesses not payable to Government. ........................................  RECOVERY OF ARREARS  56.   Application of Headmen for recovery of arrears from defaulters........................... 57.   Defaulter to be summoned. ..................................................................................... 58.   Recovery of arrears from defaulters. ...................................................................... 59.   Sale under section 88 or section 90 to be preceded by attachment. ........................  PROCESS FEES  60.   Charge for service of processes. .............................................................................  PART VIII-REMISSION OF LAND REVENUE  61.   Power to sanction remission. ..................................................................................  PART IX-SURVEY AND BOUNDARIES  62.   Demarcated areas of forest land, etc. owned by Government to be considered estates.................................................................................................... 63.   Survey marks. ......................................................................................................... 64.   Boundary marks. ..................................................................................................... 65.   Land measurement or survey. ................................................................................. 66.   Size of area of Survey / Khasra Number ............................................................... 67.   Conditions for and restrictions upon sub-division of Survey / Khasra numbers .......................................................................................  PART IX-A-DEMARCATION OF LAND AND EVICTION OF UNAUTHORISED LANDOWNERS  67-A.   Demarcation of land. .............................................................................................. 67-B.   Eviction of unauthorized land-owners ....................................................................  PART X-EXECUTION OF CETAIN ORDERS OF CIVIL AND CRIMINAL COURTS THROUGH REVENUE OFFICERS  68.   Appraisement of value of produce before sale. ..................................................... 69.   Agency to be used in conducting sale. ................................................................... 70.   Date on which possession is to be given to decree-holder of Civil Court ..............  PART XI- MISCELLANEOUS",
  "71.   Village Note Book. ................................................................................................ 72.   Forms WPLR Rules. ..............................................................................................  APPENDIX A   ........................................................................................................  APPENDIX B   .......................................................................................................",
  "* [WEST PAKISTAN] LAND REVENUE RULES, 1968  (Prescribed vide Board of Revenue, West Pakistan’s notification No.377/68-219-U (I), dated 25 th   June, 1968, published in the Gazette of West Pakistan, Extraordinary, July 13, 1968, as amended) _____________ With reference to the Board of Revenue, West Pakistan Notification No.82/68- 43-U (I), dated the 4   th   March, 1968, published in the extraordinary issue of the “Gazette of West Pakistan”, dated the 12   th   March, 1968, and in supersession of all existing rules on the subject, the Board of Revenue, in exercise of the powers conferred upon it by sections 4(9)(iii), 20, 36, 37(2), 38(2), 39(2), 41, 42, 43, 55, 77, 113, 121, 122(2), 129(1), 133, 148, 170, 177 and 182 of the   **   [West Pakistan] Land Revenue Act, 1967 (West Pakistan Act XVII of 1967), and with the prior approval of Government and in the case of rules under section 170 of the said Act, with the concurrence of the High Court, is pleased to make the following rules: -  PART I – PRELIMINARY  1.   Short title and commencement. -   (1) These rules may be called the   ***   [West Pakistan] Land Revenue Rules, 1968. (2)   They shall come into force at once. 2.   Definitions.-   In these Rules, unless there is anything repugnant in the subject or context- (a)   “Act” means the   ****   [West Pakistan] Land Revenue Act, 1967 ; (b)   “form” means a form appended to these rules ; (c)   “Section” means a section of the Act; and (d)   “Union Committee”, “Town Committee” and “Union Council” shall have the meanings respectively assigned to them under the   *****   [Basic Democracies Order, 1959 (P.O. No.18 of 1959)].  PART II – PROCEDURE OF REVENUE OFFICERS  3.   Statements and pleadings to be brief.-   The statements and pleadings made by or on behalf of parties to any proceedings before a Revenue Officer whether oral or written shall be as brief as the nature of the case admits; and shall not be argumentative, but shall be confined as much as possible to a simple and concise narrative of the facts which the party by whom or *   In accordance with the provisions of clause (6), read with clause (7), of Article 268 of the Constitution of the Islamic Republic of Pakistan, 1973, in the application of the West Pakistan Land Revenue Rules, 1968, to the Province of the Punjab, the words “West Pakistan” are to be construed as “Punjab”. **   By the Punjab Laws (Adaptation) Order, 1974 (Pb. A.O. 1 of 1974), the words “West Pakistan” occurring in the long title and preamble of West Pakistan Land Revenue Act, 1967, were substituted by the words “The Punjab” ***   In accordance with the provisions of clause (6), read with clause (7), of Article 268 of the Constitution of the Islamic Republic of Pakistan, 1973, in the application of the West Pakistan Land Revenue Rules, 1968, to the Province of the Punjab, the words “West Pakistan” are to be construed as “Punjab”. ****   By the Punjab Laws (Adaptation) Order, 1974 (Pb. A.O. 1 of 1974), the words “West Pakistan” occurring in the long title and preamble of West Pakistan Land Revenue Act, 1967, were substituted by the words “The Punjab” *****   The Basic Democracies Order, 1959 in so far as applicable to the Province of the Punjab was repealed by the Punjab Local Government Act, 1975 (XXXIV of 1975) which was succeeded by the Punjab Local Government Ordinance, 1979 (VI of 1979) and said Ordinance of 1979 was repealed and replaced by the Punjab Local Government Ordinance, 2001 (XIII of 2001).",
  "on whose behalf the statement or pleading is made believes to be material to the case and which he either admits or believes that he will be able to prove. 4.   Verification of applications, etc.-   Every written application or statement filed by a party to a proceeding before a Revenue Officer shall be drawn up and verified in the manner provided by the Civil Procedure Code for written statements in suits. 5.   Proceedings not to abate on death or marriage of party.-   The death of one of the parties to a proceedings before a Revenue Officer or, in a proceeding to which a female is a party, her marriage, shall not cause the proceeding to abate; and the Revenue Officer before whom the proceeding is held shall have power to make the successor-in-interest of the deceased person or the married female, a party thereto. 6.   In fixing dates, etc. Revenue Officer to follow procedure of Revenue Court.-   In fixing dates for the hearing of parties and their witnesses, in adjourning proceedings, and in dismissing applications for default, or for other sufficient reason, a Revenue Officer, shall, so far as the nature of the case may require or permit, be guided generally by the principles laid down in the Civil Procedure Code, 1908 (Act V of 1908). 22   [6-A.   Remand of cases.-   (a) In an appeal under section 161, or in a revision under section 164 against the final order of a Revenue Officer in a case, no Appellate or Revisional authority other than the Board of Revenue shall have the power to remand the case; (b) subject to clause (a), the Appellate or the Revisional Authority, as the case may be, shall finally determine the case notwithstanding that the impugned order proceeds upon a ground other than that on which the Appellate or Revisional Authority proceeds; (c) where the impugned order has omitted to decide a question of fact which appears to the Appellate or the Revisional Authority, as the case may be, to be essential for the correct decision of the case, the said Authority may direct the Revenue Officer who passed the impugned order to return a finding thereon, after recording additional evidence, if necessary. The Appellate or the Revisional Authority, as the case may be, shall after considering any objections which may be preferred against such finding by a party within a time to be fixed by the said Authority, proceed to decide the case; (d) the Appellate or the Revisional Authority may, for reasons to be recorded in writing, allow additional evidence to be produced and take such evidence either itself or direct the Revenue Officer who passed the impugned order or any other subordinate Revenue Officer to take such evidence and send the same to it.] 7.   Commissions - Act V of 1908.-   23 [ (1)] The provisions of sections 75 to 78 of the Civil Procedure Code and of Order XXVI, in Schedule I, annexed to the said Code in respect of Commissions shall apply to proceedings before a Revenue Officer. 24   [(2) If for any reason it is not possible for a female heir to appear before the Revenue Officer, he may either himself record her statement at her residence or issue a Commission to do so: Provided that the Commission, if issued, may preferably comprise a lady member of the Provincial Assembly or the National Assembly or a lady member of the Local Council concerned or any other lady carrying a social / official status.] 22   Added by Board of Revenue Punjab’s notification No. 689-89/2168-LR-II dated 12 th   September, 1989. 23   Renumber (1) by Board of Revenue, Punjab’s notification No.1396-90/1171/LR-I dated 14 th   June, 1990 published in the Gazette of Punjab, Extraordinary, June 14, 1990. 24   Added ibid.",
  "8.   Expenses of witnesses.-   (1) A Revenue Officer may award to a witness, attending his Court or office a sum on account of his expenses, not exceeding the amount admissible to him in civil suits under the Rules and Orders of the High Court. (2)   The sum so awarded shall be the costs in the proceedings. 9.   Record of mutation proceedings.-   25 [ (1)] In proceedings under sub section (6) of section 42, a record of the statements of parties and witnesses shall be made by the Revenue Officer with his own hand, and his order shall state briefly the persons examined by him, the facts to which they deposed and the grounds of the order.  Explanation .- Where the acquisition of the right is by a registered deed or by or under the order or decree of a Court it shall not be necessary to record the statements of the parties and witnesses or to enforce their attendance. 26   [(2) In case of mutation of inheritance the following procedure shall also be followed by the Revenue Officer – (a) The Revenue Officer shall record the statements of at least two respectable persons preferably of   Lambardars   or members of the Local Council concerned in respect of the legal heirs of the deceased and shall also obtain their signatures / thumb impressions on the Register of Mutation ; (b) The inheritance shall, in the first instance, be sanctioned in favour of all legal heirs including females ; (c) Where the property devolves through an un-disputed “will” it shall be dealt with in accordance with the law of Succession by inheritance for the time being in force governing the parties concerned ; (d) The order of the Revenue Officer shall indicate that the deceased was a   Muslim  following   Hanfi   or   Shia Fiqah   or was a non- Muslim   ; and (e) No mutation of gift or relinquishment of a right in respect of property inherited by a female heir shall be attested until the expiry of 40 days of the death of the propositus.] 10.   Record of other proceedings under the Act.-   In other proceedings under the Act, not being proceedings under section 141, the Revenue Officer shall make, with his own hand, a brief memorandum of the statements of parties and witnesses at the time when each statement is made. 11.   Contents of orders.-   In every proceeding in which an order is passed on merits after inquiry, the Revenue Officer making the order shall also record a brief statement of the reasons on which it is founded. 12.   Apportionment and recovery of costs.-   (1) In proceedings in which costs have been incurred, the final order shall apportion the costs between the parties to the proceedings. (2) Costs thus apportioned shall be recoverable by the Revenue Officer by attachment and sale of the movable property of the person liable for the same in the manner prescribed in section 83. 13.   Execution of orders of ejectment, etc.-   (1) Orders of ejectment from, and delivery of possession of immovable property, shall be enforced in the manner provided in the Code 25   Renumbered (1) by Board of Revenue, Punjab’s notification No.1396-90/1171/LR-I dated 14 th   June, 1990, published in the Gazette of Punjab, Extraordinary, June 14, 1990. 26   Added ibid.",
  "of Civil Procedure and the Rules and Orders of the High Court, for the time being in force, in respect of the execution of a decree of a Civil Court. (2) And in enforcing these orders, a Revenue Officer shall have all the powers in regard to contempts, resistance and the like, which a Civil Court may exercise in the execution of a decree of the description mentioned in sub-rule (1). 14.   Charges for service of process through post.-   In all cases in which processes are issued by post, the parties concerned shall be required to pay   Talbana , at the rate of   27   [Rupee one per head] by means of court-fee stamps.  PART III – VILLAGE HEADMEN ( LAMBARDARS )  15. The rules under this part and the rules 55, 56, 57 and 58 in so far as they relate to the headmen ( Lambardars ), shall not extend to the areas excepted under section 180. 16.   Number of headmen.-   (1) A sufficient number of headmen shall be appointed to every estate, and this number when once fixed shall not be increased or reduced except by or under the order of the Commissioner. (2) Except as provided in rule 21, if an estate or a considerable portion thereof is owned by Government, the headman may be appointed from among the tenants and in other estates he shall be appointed from among the land-owners. (3) The lessee of an uncultivated or forest estate owned by Government, shall, during the currency of his lease, be the headman thereof.  17.   Matters   to   be   considered   in   the   first   appointment 28   .-   (1) In the first appointment of a headman (Lambardar), following matters shall be considered and the maximum marks to be assigned against each item are as under: (a)   Hereditary claim of the candidate   Maximum Marks   30 i.   First blood   30 Marks ii.   Second blood   15 Marks (b)   Candidate’s community in the estate   Maximum Marks   30 or sub-division of the estate for which appointment is to be made. i.   Overwhelming majority   30 Marks iii.   Second largest majority   15 Marks (c)   Extent of property of the candidate in   Maximum Marks   10 the estate or sub-division of the estate for which appointment is to be made. i.   Five acres or more   10 Marks ii.   Less than five acres   05 Marks 27   Substituted by Board of Revenue, Punjab’s notification No.3969-73/1492-LR-II, dated 29 th   June, 1973, published in the Gazette of Punjab, Extraordinary, June 29, 1973, for the figure, words and commas “35 paisa, per head, with the minimum of 50 paisa”. 28   Substituted by Board of Revenue, Punjab’s notification No. 881-2010/397-LR-II, dated 20th April, 2010. In exercise of the powers conferred under section 36 of the Punjab Land Revenue Act, 1967 (XVII of 1967), with the previous approval of the Government and after previous publication vide notification No. 3724-2009/1436-LR-II, dated 4th November, 2009 published in the Punjab Weekly Gazette Part-I dated 16th December, 2009.",
  "(d)   Educational qualifications of the candidate.   Maximum Marks   10 i.   Secondary School Certificate, 10 Marks Equivalent or above. ii.   Literate i.e. able to   05 Marks read and write Urdu (e)   Personal character, ability and influence   Maximum Marks   10 of the candidate and his freedom from indebtedness. (f)   Quality of farming of the candidate in   Maximum Marks   10 the revenue estate (2) On receipt of a proposal regarding the appointment of a headman from the Tehsildar, the Collector shall hold “Ijlas-e-Aam” in the Revenue Estate and submit to the District Collector his report and recommendations concerning each item under sub-rule (1) and the marks awarded to each candidate. (3) On receipt of a report and recommendations of the Collector, the District Collector shall give an opportunity of hearing to all the candidates, give his own findings on the report and recommendations of the Collector and pass orders regarding selection of the candidate keeping in view the marks obtained by each candidate according to the criteria laid down in sub-rule (1). 18.   Dismissal of headmen.- (1)   A headman shall be dismissed when - (a)   he has been, on conviction for an offence involving moral turpitude, sentenced to imprisonment for a term of not less than six months; or (b)   in an estate owned altogether or chiefly by Government, he ceases to possess the interest which led to his appointment; or (c)   in any other estate, he ceases to be a land-owner in the estate or sub-division of the estate, in respect of which he holds office; or (d)   he has mortgaged his holding and has delivered possession of the holding to the mortgagee; provided that in special cases the Collector may, with the Commissioner's sanction, retain him in his office, if he can furnish adequate security for the payment of the revenue he has to collect and for the due discharge of his duties; or (e)   his holding has been transferred under section 84 or the assessment thereof has been annulled under section 86. (2)   A headman may be dismissed when - (a)   any criminal proceedings which have been taken against him show that he is unfit to be entrusted any longer with the duties of a headman; or (b)   he is seriously embarrassed by debt, or if his unencumbered holding is so small as to disqualify him, in the Collector's opinion, for the responsibilities of a headman; or (c)   owing to age or physical or mental incapacity, or absence from the estate, he is unable to discharge his duties; or",
  "(d)   there is reason to believe that he has taken part in, or concealed illicit distillation, or the smuggling of foodgrains, cocaine, opium or charas; or (e)   he takes part in any unconstitutional agitation against the Government or fails to give his active support to the Government in the maintenance of law and order; or (f)   he neglects to discharge his duties, or is otherwise shown to be incompetent; or (g)   the estate or sub-division thereof, in respect of which he holds office; or his own holding is attached, either for an arrear of land revenue or by order of any Court. (3)   A headman shall not be dismissed unless an opportunity has been afforded to him of showing cause against the proposed action. 19.   Matters to be considered in appointment of successor   29   .-   (1) In an estate or sub- division thereof, owned chiefly or altogether by Government, the successor to the office of headman shall be selected, with due regard to all the considerations, other than hereditary claims, in rule 17. (2) In other estates, the successor to the office of headman shall be selected with due regard to all the considerations mentioned in rule 17. (3) Election shall not, in any case, be resorted to as an aid in making appointments. 20.   Appointment of revenue farmers and mortgagees as headmen.-   (1) Where an office of headman becomes vacant in consequence of any proceedings taken for the recovery of an arrear of land revenue, under section 84, 85 or 86, the transferee, agent, or farmer who, under those proceedings, obtains possession of the land on which the arrears were due may, in the discretion of the Collector, be appointed a headman. (2) Where a headman, who is personally responsible for more than half the land revenue of an estate or of the sub-division thereof, in respect of which he holds office, has mortgaged his holding and has delivered possession thereof to the mortgagee, and the office of headman has become vacant in consequence thereof, the mortgagee may. at the discretion of Collector, be appointed as headman. (3) On the termination of any such transfer, farm or attachment, as is referred to in sub-rule (1) or on the release of any such mortgage as is referred to in sub-rule (2), a headman appointed under this rule shall cease to hold office, and a new headman shall be appointed with reference to the considerations enumerated in rule 17. 21.   Appointment of officiating headmen in place of absentees.- Where a headman has abandoned the estate, a temporary headman may be appointed by the Collector, in place of the absentee headman, till a permanent headman is appointed, keeping in view the following principles.- (i)   In estates wholly abandoned by the proprietors, or in which a major area or the whole of a   Patti   has been abandoned, appointment shall be made from among the persons who have been resettled on the land in the estate, preferably from those who have previously been headmen in the estates vacated by them, in 29   Substituted by Board of Revenue, Punjab’s notification No. 881-2010/397-LR-II, dated 20th April, 2010. In exercise of the powers conferred under section 36 of the Punjab Land Revenue Act, 1967 (XVII of 1967), with the previous approval of the Government and after previous publication vide notification No. 3724-2009/1436-LR-II, dated 4th November, 2009 published in the Punjab Weekly Gazette Part-I dated 16th December, 2009.",
  "India, and if no such persons are available, selection should be made from among other persons who have been resettled on the land in the estate in accordance with the provisions of rules 16 and 17. (ii)   In estates which are wholly or mostly owned by Government, appointment shall be made in the manner provided in rule 16(2), preference being given to those who have previously been headmen. (iii)   In estates where only a small portion of land has been abandoned by the proprietors, the appointment may be made from among the land-owners or those resettled in the estate.  Explanation .-   A surety for persons appointed as headmen may be taken, in cases where it may be considered appropriate. 22.   Duties of headmen.-   In addition to the duties imposed upon headmen under any other law, a headman shall- (i)   collect, by due date, the land revenue and all sums recoverable as land revenue, from the estate, or sub-division of an estate in which he holds office, and pay the same personally or by revenue money order or by remittance of currency   notes   through   the   post   or   at   place   where treasury   business   is conducted by the State Bank of Pakistan, or any other Bank, by cheque, on a local bank, at the place and time appointed in that behalf, to the   Tehsildar  concerned; (ii)   collect the rents and other income of the common land, and account for these to the persons entitled thereto; (iii)   issue receipts in Form I to the land-owners and others, in token of having recovered the Government dues from them;  Explanation .-   The   Tehsildar   should arrange to supply printed receipt books (Form I) to the headmen, free of cost, according to their requirements. (iv)   report, to the   Tehsildar , all encroachments on roads (including village roads) or on Government waste lands and injuries to, or appropriation of Government property situated within the estate; (v)   report any injury to public buildings in the estate; (vi)   implement, to the best of his ability, any orders that he may receive from the Collector, requiring him to furnish information or to assist in providing, on payment,   supplies   or   means   of   transport,   for   troops   or   for   officers   of Government on duty; (vii)   assist, in such manner as the Collector may from time to time direct, at all crop inspections, recording of mutations, surveys, preparation of records-of-rights or other revenue business within the estate; (viii)   attend the summons of all authorities having jurisdiction in the estate; assist, when so required by them, all officers of the Government in the discharge of their duties, furnish all relevant information in this behalf and generally act for the land-owners, tenants and other residents of the estate or sub-division of the estate, in which he holds office in regard to their responsibilities to the Government;",
  "(viii-a)   30   persuade the residents of the estate to adopt modern technique of framing, enhance productivity and send their children / wards to school. (ix)   report to the   Patwari   any outbreak of disease among human beings or cattle in the estate or sub-division of an estate in which he holds office; (x)   report to the   Patwari   the deaths of any right-holders in the estate, or sub- division of the estate, in which he holds office; (xi)   report any breach or cut in a Government Irrigation canal or channel, to the nearest Canal Officer, z illadar   or canal   Patwari ; (xii)   under the general or special directions of the Collector, to use his good offices to assist all officers of Government and other persons duly authorized by the Collector, in the enrolment of military personnel. 23.   Collection, control and distribution of village officers' cesses. - (1) The Collector may, at any time, revise the arrangements in an estate regarding the collection, control and distribution of the village officers' cess. (2)   The headman shall be paid the following remunerations for his services- (i)   for collection of land revenue ( Pachotra ), 5% of the amount of land revenue collected; (ii)   for collection of water-rate ( abiana ), 3% of the amount collected. (iii)   for collection of- (a)   Rehabilitation Fee ; (b)   Historical Mosque Fund Cess; (c)   Temporary Cultivation Lease Money and Cash Rent; (d)   Consolidation Fee; (e)   Development Cess; and  31   [***] Explanation l.- The remuneration of   Lambardari   fee shall be calculated on the actual amount collected and not on the demand.  Explanation 2.-   The remuneration for the collection of land revenue ( Pachotra ) is a surcharge and is to be recovered from the land-owners, in addition to the land revenue.  Explanation 3.- In the case of water-rate ( abiana ) and the fees and cesses mentioned in sub-rule (2), the commission payable to the   Lambardar   is not recovered as surcharge, but is deducted from the amount recovered. 24.   Punishments.- Where a headman commits a breach of or neglects, the duties imposed on him, by or under these rules or by or under any other law for the time being in 30   Substituted by Board of Revenue, Punjab’s notification No. 881-2010/397-LR-II, dated 20th April, 2010. In exercise of the powers conferred under section 36 of the Punjab Land Revenue Act, 1967 (XVII of 1967), with the previous approval of the Government and after previous publication vide notification No. 3724-2009/1436-LR-II, dated 4th November, 2009 published in the Punjab Weekly Gazette Part-I dated 16th December, 2009. 31   Item “(f) Mutation Fee” deleted by Board of Revenue, Punjab’s notification No.3969-73/1492-LR-II, dated 29 th   June, 1973, published in the Gazette of Punjab, Extraordinary, June 29, 1973. Commission at the rate of 3% of the amount collected.",
  "force, the Collector may. after giving him an opportunity of showing cause against the proposed action, by order direct that- (a)   the emoluments of his office be withheld and forfeited to Government, for a term, not exceeding one year; or (b)   he may be suspended from office, for a term not exceeding one year.  Explanation .-   In the case of suspension, the Collector may appoint a substitute. 25.   Appointment of substitutes for non-resident headmen.-   (1) Where an estate is owned by a non-resident land-owner, he may nominate for the Collector's approval, a substitute ( Sarbrah ) from among the residents in the estate to discharge the duties of headman. If the owner fails to nominate a fit person, the Collector may appoint a substitute from among the residents tenants. (2) Where, in an estate owned by more land-owners than one, a non-resident headman is liable for more than half the land revenue of the estate, a substitute for such headman may be appointed from among the resident land-owners or tenants. In making such appointment, the Collector shall consult the wishes of the non-resident headman. 26.   Appointment of other substitutes and their position   32   .-   (l) Where, by reason of absence from his circle or estate, with the permission of the District Collector, or for any other good cause, a headman is unable to perform the duties of his office in person, a substitute may be appointed for the purpose. 27.   Determination of office of substitute.-   (l) When the person on whose behalf the substitute was appointed vacates his office, the tenure of office by the substitute shall also abate, thereon. (2) In other cases, an order appointing a substitute shall remain in force until it is revoked, or until the substitute dies or is dismissed or resigns the appointment. 28.   Rules governing appointment and removal of substitute 33   .-   (1) In making substitute appointments under rule 26, the District Collector shall consult the substantive headman (Lambardar). (2) Any resident land-owner in the estate or circle or any resident tenant in cases falling under rule 16(2) shall be eligible for appointment as a substitute. (3) A substitute may be removed at any time by the District Collector either on his own motion, or at the request of the person for whom the substitute was appointed, for any reason which would justify the removal of the headman (Lambardar). 29.   Remuneration of substitute.-   (1) For special reason to be recorded in the order appointing a substitute, the person in whose stead a substitute is appointed may be permitted to enjoy a portion not exceeding one-half of the   Lambardari   fee. 32   Substituted by Board of Revenue, Punjab’s notification No. 881-2010/397-LR-II, dated 20th April, 2010. In exercise of the powers conferred under section 36 of the Punjab Land Revenue Act, 1967 (XVII of 1967), with the previous approval of the Government and after previous publication vide notification No. 3724-2009/1436-LR-II, dated 4th November, 2009 published in the Punjab Weekly Gazette Part-I dated 16th December, 2009. 33   Substituted by Board of Revenue, Punjab’s notification No. 881-2010/397-LR-II, dated 20th April, 2010. In exercise of the powers conferred under section 36 of the Punjab Land Revenue Act, 1967 (XVII of 1967), with the previous approval of the Government and after previous publication vide notification No. 3724-2009/1436-LR-II, dated 4th November, 2009 published in the Punjab Weekly Gazette Part-I dated 16th December, 2009.",
  "(2) In the absence of any such order, a substitute is entitled to the whole fee.  PART IV-RECORDS-OF-RIGHTS AND PERIODICAL RECORDS  30.   Other documents included in the records-of-rights and periodical records.-   (l) In addition to the documents specified in clauses (a) to (c) of sub section (2) of section 39, the following other documents shall be included in the record-of-rights ( Misl-i-Haqiat ) under clause (d) of that sub section:- (i)   Preliminary proceeding (Form II), (ii)   Genealogical tree (Form III). (iii)   Index Survey /   Khasra   Numbers (Form IV). (iv)   Alphabetical index of owners   34   [and mortgagees] (Form V). 35   [*******]  (vi)   Note of changes in kind of soil (Form VII). (vii)   Register   haqdaran nakhlistan   (where) the   nakhlistan   is assessed to revenue (Form VIII). (viii)   Statement of rights in wells and tube-wells (Form IX). (ix)   Statement of distribution of water (where the lands are irrigated by means of  Karez   or other similar source) (Form X). (x)   Statement of rights in water-mills (Form XI). (xi)   Order of the Revenue Officer determining the assessment. (xii)   Order of the Revenue Officer distributing the assessment over holdings. (xiii)   Field Book (Form XII). (2)   The   following   documents   shall   also   be   included   in   the   periodical   record ( Chaharsala ) under the provisions of sub section (2) of section 41:- (i)   Title page of register   haqdaran zamin   (Form XIII). (ii)   Documents referred to in items   36   [(ii) to (iv)] and (vi) to (x) of sub-rule (1). (iii)   Supplementary map (Form XIV). (iv)   Fard Badar   (Form XV). (v)   Checking and attestation notes by the   Kanungo . (vi)   Checking and attestation notes by the Revenue Officer. (vii)   Final attestation certificate of Register   Haqdaran Zamin   by the Revenue Officer (Form XVI). 31.   Manner in which the Record-of-Rights prepared, signed and attested . -(l) A schedule shall be approved by the Collector for each   Tehsil , prescribing the arrangements for the preparation of the record referred to in rule 30(2) of the estates, and shall be so arranged that the work of each year shall cover about a fourth of each   Kanungo's   whole circle. 34   Added by Board of Revenue, Punjab’s notification No.1750-88/281-LR-II dated 02-04-1989, published in the Gazette of Punjab, Extraordinary, April 4, 1989. 35   Item “(v) Alphabetical index of mortgagees (Form VI)” omitted ibid. 36   Substituted ibid for the figures “(ii),(iii)”",
  "(2) Cent per cent entries of the record-of-rights and periodical records shall be checked and attested on the spot by the Field   Kanungo . (3) The entries and documents included in the record-of-rights ( Misl-i-Haqiat ) shall be checked and attested, cent per cent by the   Naib   Tehsildar /Head   Munshi   incharge of the circle in all respects and at least 25% by the   Tehsildar   concerned. (4) The   Tehsildar   or   Naib-Tehsildar /Head   Munshi   incharge of the circle, shall check the periodical records and   make his final attestation and shall observe the following procedure:- (i)   25 per cent   Khatauni   shall be read out on the spot, in the presence of the right- holders. (ii)   At least 25% of the mutations attached to the Register   Haqdaran Zamin   shall be compared with the   Khewats   concerned. (iii)   At least 25% of the   Khata   holdings shall be compared with the previous Register   Haqdaran Zamin.  (5) The Assistant Collector of the first grade, Collector, Commissioner, Assistant to the Director of Land Records and the Director of Land Records shall also check and attest the record-of-rights and periodical records, from time to time, to ensure that the   Kanungo   and  Tehsildar ,   Naib - Tehsildar   (Head   Munshi ) have carried out the prescribed checking and attestation and that the other provisions of the Act and these rules are being complied with. (6) A statement in Form XVII with regard to checking and attestation carried out under sub-rules (2) to (5), for each month, shall be submitted by the   Tehsildar   to the Collector through the Revenue Assistant, Sub-Divisional Officer concerned and the Collector shall submit all such statements in a consolidated form to the Commissioner and to the Director of Land Records. (7) The original copy of the record-of-rights and periodical records shall be consigned to the District Revenue Record Room; and the second copy thereof shall be kept by the  Patwari : Provided that in the case of the map of the estate, the second copy shall be consigned to the   Tehsil /Sub-Divisional Revenue Record Room and a copy of the map of the estate, prepared on cloth, shall be kept by the   Patwari . (8) A third copy of the documents listed below, shall be supplied to the Union Committee, Town Committee or Union Council concerned:- (i)   Register   Haqdaran Zamin.  (ii)   Register   Girdawari.  (iii)   Dhal Bachh.  (iv)   Map of the estate. 32.   Gist of the order of mutation.- When a mutation is decided by a Revenue Officer, a gist of the order, shall be sent, in Form XVIII to the   *   [Secretary of the Union Committee, Town Committee or the Union Council, as the case may be], in which the estate is situated and to the person whose right has been transferred. *   Now “Union Administration”",
  "Explanation.- In case of mutation of inheritance, the copy of the gist of the order shall be sent to the heir(s) of the deceased. 33.   Report regarding cause of delay in mutation cases .- In respect of all mutations, pending over three months, the Revenue Officer shall submit to the Collector, through the Revenue Assistant or the Sub-Divisional Officer concerned, a report in Form XIX. 34.   Roznamcha Waqiati to be maintained by the Patwari .- (l) The Roznamcha Waqiati (Daily Diary) to be maintained by the   Patwari , under clause (a) of sub section (1) of section 42, shall be in the Form XX. (2) The pages of Roznamcha shall be stitched in a volume and each page shall bear the book number and page number in print. (3) The   Patwari   shall prefix to every entry, in the Roznamcha a separate serial number, in large and clear figures. Every entry shall be closed by an asterisk, and no blank line shall be left between two consecutive entries. Such orders and instructions as relate to rules of practice, shall be entered in red ink. The date of each day's entries shall be given according to the official calendar. (4) In addition to the events to be entered in Roznamcha according to the instructions which may be issued by the Commissioner from time to time, the following occurrences shall be entered in the Roznamcha on the day on which they come to the   Patwari 's notice, and the manner in which they come to his knowledge. (i)   Any epidemic disease among human beings or livestock, or any calamity affecting crops, including crop pests. (ii)   All alluvion, or diluvion, with approximate areas and details so far as known at that time. (iii)   Falls of rain and their duration, and whether slight, medium or heavy and the damage or benefit to the standing crops as a result. (iv)   The dates on which canals or   Rajbahas   began or ceased to run, and on which there was any marked change in the supply of canal water. (v)   Deaths of land-owners, village officers and pensioners. (vi)   The ejectment, absconding, or settling of cultivators or right-holders, and the relinquishment, change or renewal of any tenure. (vii)   The execution of any decree of Court affecting the land, its rent, or its produce. (viii)   Taccavi   advances made by Government and repayments of the same; as also notes of the progress or completion of works for which   taccavi   has been granted. (ix)   Orders of Revenue Officers or   Kanungos   received by the   Patwari   or executed in the circle. (x)   Attachment proceedings affecting the land, its cultivation, or its produce, or cattle. (xi)   Any encroachment on or damage to Nazul or Government Property or roads. (xii)   Any suspensions or remissions of revenue, and any alteration of the rate of cesses.",
  "(xiii)   The cultivation of land occupied by groves held free of revenue. (xiv)   The erection, destruction or decay of survey marks or boundary marks and the alteration of village boundaries. (xv)   The visit of any Government official to the circle. (xvi)   Any fact relating to land or its revenue or rent specially reported to the  Patwari   by a person interested therein, with a request that it be entered in his Roznamcha or which the   Patwari   may think of importance. (xvii)   Any alteration in the ownership, cultivating possession or rent of land, which may have been recorded in the crop-inspection register. (xviii) The receipt of any registration Memos. received in respect of item (xvii). (xix)   Any case of rick-burning, and, when it is suspected that the crime is due to incendiarism, this should be specified. (xx)   Any cases of increase of mortgage money, with details of the amount, parties and village. (xxi)   Distribution of   Dhal   Bachhes   to headmen and bills of assessment to land- owners. (5)   The signature or thumb-impression of the headman or member of the Union Committee, Town Committee or Union Council concerned, shall also be obtained at the time of making entries, relating to changes in revenue records. (6)   A copy of the report, recorded by the   Patwari , in the Roznamcha under sub sections (1) to (3) of section 42, shall be exhibited at the   Patwari 's office for a period of one month, from the date of its recording and shall be made available to the public for inspection during office hours, without any fee. 37   [34-A.   Collection of mutation fee in cases of registered deeds.-   (1) Where the acquisition of right or interest in an estate is by a registered deed, the mutation fee at the rate fixed under section 46 shall be collected at the time of registration of such deed by the Registering Officer. (2) The Registering Officer collecting the fee under sub-rule (1) shall credit 7/10 th   of the amount into Government Treasury under the head “O. 124 Land Revenue-Other-Mutation Fee” and the remaining 3/10   th   of the amount of the fee shall be paid by the Registering Officer to the Circle Revenue Officer for disbursement to the   Patwari   making the entries in the register of mutations.] 35.   Production   of documents or furnishing of information under section 47.- (1) When any information is furnished to the Revenue Officer or   Patwari , or any document is produced before him, under the provisions of section 47, the Revenue Officer or the   Patwari  concerned, as the case may be, shall give a written acknowledgement thereof, to the person furnishing the information or producing the document, in Form XXI. (2) Any document so requisitioned and produced shall be returned in original, after inspection, to the person who produced it, with an endorsement by the Revenue Officer or the  Patwari , as the case may be, under his signature. 37   Added by Board of Revenue Punjab’s Notification No. 1180-87/837/LR-II dated 12-05-1987, published in the Gazette of Punjab, Extraordinary, May 13, 1987.",
  "36.   Inspection of Records of Patwaris and grant of certified copies or extracts therefrom.-   (1) The   Patwari   shall allow any one interested to inspect his records and to take notes therefrom, in pencil, in his presence, during office hours, on all working days. He shall give to the applicants certified copies or extracts therefrom and enter in his diary, a note, of the inspections allowed and copies or extracts given. (2)   Such copies or extracts shall be given by the   Patwari , to the applicants, within three days from the receipt of the application. 38   [(2-A) A person who desires to obtain a certified copy of revenue record in possession of a   Patwari   may apply to the Collector of the Sub-Division on all working days except Sundays giving necessary particulars of the record of which a copy is required. All such applications will be entered in a register in Form XXI-A. The applicant shall be given a date to receive the said copy within a week from the receipt of the application: Provided that if so required the copy shall be provided on payment of urgent fee within 24 hours]. (3)   The charges shall be made, as detailed in Schedule in Appendix B. 37.   Inspection of maps and land records filed in the Tahsil revenue record room or consigned to the district/sub-divisional revenue record room. -   (1) The Officer Incharge of the   Tahsil , Sub- Divisional or District Revenue record room, shall allow any one interested to inspect the maps and land records prepared under the Act and the documents prepared under the West Pakistan Consolidation of Holdings Ordinance, 1960, and to take notes therefrom, in pencil, in his presence, in the record room, during office hours, on all working days. (2)   An application for the inspection of maps and land records kept in the Revenue Record Room, shall be made in writing and shall distinctly specify the record, inspection of which is desired. (3) The following charges shall be paid for each hour or part thereof on which the inspection is made:- 39   [(i)   Ordinary   Rs.2 (ii)   Urgent   Rs.4] When the application does not specify the number, date and nature of the record to be inspected, or if the description given in such application is incorrect and it shall, in consequence, be necessary to search the record, a fee at   40   [Rupees two] shall be payable, for such search.  Explanation .-   (1) For the purposes of this rule, the District   Kanungo   and   Tahsil  Office   Kanungo   will   be the   incharge of the   Revenue   Record Rooms   at District   and  Tahsil /Sub-Division, respectively. In the absence of these officials, their Assistants or other officials appointed or deputed by the Collector, shall perform such duties. (2) A separate application shall be made and separate fee paid, for the inspection of each record. (3) The fee shall be paid, by means of court-fee stamp(s), affixed to the original application, before the record is handed over to the applicant. 38   Added by Board of Revenue, Punjab’s Notification No. 1180-87/837/LR-II dated 12-05-1987, published in the Gazette of Punjab, Extraordinary, May 13, 1987. 39   Substituted by Board of Revenue, Punjab’s notification No.3969-73/1492-LR-II, dated 29 th   June, 1973, published in the Gazette of Punjab, Extraordinary, June 29, 1973. 40   Substituted ibid for the words “Rupee one”.",
  "41   [37-A.   Preparation of produce statements and five-yearly abstracts of yield.- (l) Any interested person may apply to the Court concerned for the preparation of produce statements required in connection with the disposal of rent cases and five-yearly abstracts of yield required in cases relating to the temporary alienation of land in satisfaction of a decree of a Civil or Revenue Court. (2)   The following fees shall be charged for - (i)   Produce statement   ...   Rs. 2 for first 10   Khasra   numbers and 20 paisa for each additional   Khasra  number per   harvest subject to a maximum of Rs. 20 in   single case. (ii)   Five yearly abstract of yield   ...   50 paisa for one   Khasra   number and 20 paisa for every additional   Khasra  number subject to a maximum of Rs. 20 in a single case. (3)   On receiving the application under sub-rule (1) the Court concerned should:- (a)   Collect from the parties concerned the amount of fee prescribed under sub-rule (2), (b)   Credit three-fourth of the fee thus realized into the treasury under the receipt head “VII-Land Revenue-Misc.-Copying fee for the preparation of produce statement and five-yearly abstracts of yield”, (c)   Credit the rest one-fourth of the fee to the Deposit head “Deposit of fees received by Government servant for work done for private bodies under \"Civil Deposit\", and (d)   Issue the requisition for the preparation of such statement or abstracts, to the Sardar   Kanungo   or   Tahsildar   concerned, who shall thereupon cause such statement or abstracts to be prepared by the concerned official within ten days from the receipt of such requisition. (4)   (i) Statements or abstracts relating to Civil Courts at District Headquarters shall be prepared by the   Naib-Sadar   Kanungo   and those relating to the Courts of Assistant Commissioner,   Tehsildar ,   Naib - Tehsildar   and other Courts at Sub-Divisional   Tehsil   or Sub- Tehsil   Headquarter shall be prepared by the  Tehsil   Office   Kanungo . (ii)   For the purpose of this rule, the   Naib-Sadar   Kanungo   and Tehsil Office  Kanungo   shall be deemed to include any official appointed or deputed by the Collector for this purpose. (5)   At the close of each quarter the Court concerned shall send the deposit receipts to the   Tehsildar   or   Sadar   Kanungo   concerned, who will arrange to draw one-fourth of the amount of fee referred to in clause (c) of sub-rule (3) for payment to the Official concerned from   the   expenditure   head   “7-Land   Revenue-Land-Records-District   Charges-Other Allowances and Honoraria-Fee to   Kanungos   for preparing produce statement and five-yearly abstracts of yield”. 41   Added by Board of Revenue, Punjab’s notification No.15455-74/67-LR-II, dated 8 th   January, 1975, published in the Gazette of Punjab, Part III, April 29, 1977.",
  "(6)   The particulars of all such requisitions and the amount of fee chargeable shall be entered in the register maintained in the Land Records Office of the District or   Tehsil , as the case may be in Form XXIII-A].  PART V-CROP INSPECTION AND   KHARABA  38.   Date   on   which   inspection   of   each   harvest   to   be   commenced.-   (1)   The Commissioner may fix the date on which the inspection of each harvest shall commence, according to the circumstances of the area. In the absence of such fixation of dates, the inspection of each harvest shall commence, as follow:-  Kharif ............................................................... 1 st   October  Rabi ...................................................................1 st   March Extra ( Zaid )   Rabi ............................................. 15 th   April (2)   When for any reason, the ripening of the crop is later than usual, the Collector may postpone the inspection for a period, not exceeding fifteen days. 39.   Crop Inspection Register.-   42   [(1)] For each estate, a crop inspection register ( Girdawari ) shall be maintained, in Form XXIV. 43   [(2) For each estate, a register of changes in cultivations, possession and rent to be known as the “Register   Taghayyurat-e-Kasht ” shall also be maintained by the   Patwari   in Form XXIV-A in which he will enter such harvest-wise changes as are not disputed and will incorporate the same in the Register   Girdawari   after due checking and attestation thereof by the Field   Kanungo   and the Circle Revenue Officer]. 44   [39-A.   Fard   Raftar   Girdawari .-   (1)   The   Schedule   of   programme   for   Crop Inspection ( Fard Raftar   Girdawari ) shall be so arranged that at the time of   Kharif   and   Rabi  Girdawaris , the   Patwari   should first take up the estate for which the periodical record is to be prepared. (2) A copy of the   Fard Raftar   Girdawari   shall be sent by the   Patwari   in advance to the Chairman of the respective Union Council who may depute one of the Members of the Union Council to be present at the time of harvest inspection by the   Patwari] . 40.   Correction of entries in the Crop Inspection Register.-   No alteration shall be made in the Register   Girdawari   after the   Dhal Bachh   of respective harvest has been drawn up, except with the sanction of the Collector. If at the time of preparation of Register Haqdaran Zamin, an entry in the Register   Girdawari   is found to be incorrect, it shall nevertheless be retained unaltered and the correct entry shall be noted in red ink, in the remarks column and shall be attested by the   Kanungo . 41.   Failure of crop to be entered in the Register   Girdawari .-   (l) When a crop fails to germinate or dries up, or is destroyed by calamity of season or the yield falls short of the normal out-turn, a corresponding entry of the failure of crop ( Kharaba ), shall be made in the Register   Girdawari   (Form XXIV), at the time of harvest inspections. (2)   In areas in which land revenue is assessed in the form of prescribed rates under clause (b) of sub section (3) of section 56 a statement of   Kharaba   shall be prepared in Form XXV. 42   Renumbered as (1) by Board of Revenue, Punjab’s Notification No. 1180-87/837/LR-II dated 12-05-1987, published in the Gazette of Punjab, Extraordinary, May 13, 1987. 43   Added by Board of Revenue, Punjab’s Notification No. 1180-87/837/LR-II dated 12-05-1987, published in the Gazette of Punjab, Extraordinary, May 13, 1987. 44   Added ibid.",
  "(3)   The entries in the statement of   Kharaba   shall be checked, on the spot, cent per cent by the   Kanungo ; 50% by the   Naib - Tahsildar / Head Munshi   or   Tahsildar   and 25% by the Assistant Collector of the first Grade. (4)   The checking of statement of   Kharaba   shall be carried out within fifteen days following the day on which the crop inspection by the   Patwari   is concluded. 42.   Scale on which relief to be given . -Deductions for   Kharaba   shall be entered in accordance with the following scale (taking 100 paisa, as the average yield of a crop):- (a) Yield more than 75   paisa   No deduction. (b) Yield more than 50   paisa   but not more than 75 paisa.   Deduct ¼ of the sown area. (c) Yield more than 25   paisa   but not more than 50 paisa.   Deduct ½ of the sown area. (d) Yield not more than 25   paisa .   Deduct whole sown area.  Explanation 1 .-When the crop has been cut before the field is inspected, the crop shall be presumed to have matured and no deductions for   Kharaba   under this rule shall be allowed.  Explanation 2.- In case a land-owner has objection to the   Kharaba   allotted by the  Patwari   or   Kanungo , his objection shall be noted in the remarks column of the Form XXV and   the   Tahsildar / Naib - Tahsildar   ( Head   Munshi )   shall   pass   orders,   after   personally inspecting the survey/ Khasra   numbers concerned. 43.   Circumstances under which no Kharaba Statement is to be prepared .- In the event of widespread calamity, such as floods or hail-storms or locust, the Collector, may dispense with the preparation of statements of   Kharaba , prescribed under rule 41(2).  PART VI-DEMAND STATEMENTS ( Dhal Bachh )  44.   Bachh Papers. -   (1) In each estate, a distribution of revenue ( Dhal Bachh ) of fixed ( Malia Mustaqil ) or in the form of prescribed rates ( Ghair Mustaqil ), shall be prepared by the   Patwari ,   Khewat -wise, in Form XXVI or Form XXVII, as the case may be. (2)   In the areas where collection of revenue is made by   Tapedars , the   Tapedar  ( Patwari ) shall prepare a bill of assessment, in respect of each land-owner in Form XXVIII and deliver the same to him. (3)   In   the   areas   where   collection   of   revenue   is   made   through   Headmen ( Lambardars ), the   Patwari   shall prepare a copy of   Dhal Bachh , headman-wise, showing the particulars of each land-owner and deliver the same to the headman ( Lambardar ).  PART VII-A. COLLECTION OF LAND REVENUE BY   LAMBARDARS  45.   Place of payment. -   Land revenue shall be paid at the office of the   tehsil   to which the estate belongs, except in the following cases:- (a)   Where the   tehsil   treasury at the district headquarters has been incorporated with the district treasury, the payment shall be made into the district treasury.  Explanation I .-The headman shall present the   arz irsal   (Form XXIX) to the   tehsil  revenue accountant ( Wasil Baqi Nawis ) at the   tehsil , who shall verify the correctness and proper distribution of the amount tendered, by reference to the demand statement (village",
  "khatauni ) and shall prepare receipts ( dakhilas ) (Form XXX), in triplicate, shall sign them and shall obtain the signature of the   Tehsildar   or the   Naib-Tehsildar /Head   Munshi   thereon. The headman shall then take the money and three copies of the receipt to the treasury and deposit the amount in the treasury.  Explanation II .- The headman may pay land revenue, rates and cesses, etc. by means of- (i)   a crossed cheque, in favour of the   Tahsildar   concerned, alongwith the   arz irsal   referred to in Explanation I; or (ii)   revenue money-order in favour of the   Tahsildar   concerned, in which case the entries of   arz irsal   shall be copied on the coupon of the money-order form.  Explanation III.   If the land revenue, cesses, etc. are paid by means of a cheque or revenue money order, the   Tahsildar   concerned shall arrange for the deposit of the same into the treasury, in the manner referred to in Explanation I. (b)   Where   a   special   arrangement   has   been   made,   with   the   sanction   of   the Collector, authorizing any person, to pay land revenue direct into the district treasury, the payment shall be made as provided in clause (a). (c)   Where special permission of the Commissioner has been given, authorizing any person, to pay land revenue into the headquarters treasury of another district, within his division or, with the concurrence of the Commissioner concerned, into the headquarters treasury of any district, in another division of West Pakistan, the payment shall be made at the place so approved.  Explanation.-   The continuance of such special arrangement shall depend on the punctual payment of the revenue and, on any arrear falling due, the Collector or the Commissioner, as the case may be, shall make an order canceling that arrangement.  B. COLLECTION OF LAND REVENUE BY   TAPEDARS  46.   Payment of land revenue and rates and cesses.-   (l) All payments of land revenue, rates and cesses shall be made to the   Tapedar   concerned, who shall issue receipts in Form I to the land-owners in token of having received the Government dues, from them. The  Tapedar   shall deposit the amount in the Treasury on Form XXX, which shall be checked and signed by the Revenue Accountant and the   Mukhtiarkar , or Head   Munshi . (2)   Where a special arrangement has been made, with the sanction of the Collector, authorizing any person, to pay land revenue direct into the Government treasury, the payment shall be made in Form XXX which shall be checked and singed by the Revenue Accountant and the   Mukhtiarkar   or Head Munshi. (3)   The land-owner may remit the amount of land revenue or other dues by means of- (a) a crossed cheque in favour of the   Mukhtiarkar   concerned, alongwith a copy of the bill of assessment; or (b) revenue money-order in favour of the   Mukhtiarkar   concerned, in which case the entries of bill of assessment shall be copied on the coupon of the money- order form. In the aforesaid cases, the   Mukhtiarkar   concerned shall arrange for the deposit of the amount in the Treasury in Form XXX.",
  "47.   Security to be furnished by Mukhtiarkar, Head Munshi, Supervising Tapedar and Tapedar.- (l) All   Mukhtiarkars , Head Munshis, Supervising   Tapedars   and   Tapedars  shall, before entering upon their office, furnish security in the amounts respectively shown hereunder against them, either by deposit of Securities of the Central Government duly endorsed, accompanied by a power to sell or in Form XXXI:- (i)   Mukhtiarkars   Rs. ten thousand.  (ii)   Head   Munshis   Rs. five thousand. (iii)   Supervising   Tapedars   Rs. five thousand. (iv)   Tapedars   Rs. five thousand. (2) The securities shall be deposited with the Collector. 48.   Surety to be liable in the same manner as Principal.- The surety or sureties of the officers referred to in rule 47 shall be liable to be proceeded against jointly and severally, in the same manner as his or their Principal is liable to be proceeded against, in case of default, and notwithstanding such Principal may be so proceeded against: Provided that in any case of failure to discharge or make good any sum of money due to Government, no greater sum than is sufficient to cover any loss which the Government may actually sustain, by the default of the Principal, shall be recovered from the surety or sureties, as the amount which may be due from such surety or sureties, under the terms of the security bond executed by him or them. 49.   Liability of surety not affected by death of Principal or by his taking a different appointment.-   The liability of the surety or sureties shall not be affected by the death of a Principal, or by his appointment to a post different from that which he held when the bond was executed, but shall continue so long as the Principal occupies any post in which security is required and until his bond is cancelled. 50.   How surety may withdraw from further liability.- Any surety, whether under a separate or joint bond, may withdraw from his suretyship, at any time, on his stating in writing, to the officer to whom the bond has been given, that he desires so to withdraw; and his responsibility under the bond shall cease, after sixty days from the date on which he gives such writing, as to all demands upon his Principal concerning money, for which his Principal may become chargeable after the expiration of such period of sixty days, but shall not cease as to any demands for which his Principal may have become liable before the expiration of such period even though the facts establishing such liability may not be discovered till afterwards. 51.   Register of sureties -   The Collector shall keep a register in Form XXXII of all securities furnished by each officer, in his district.  COLLECTION OF RATES AND CESSES  52.   Number of instalments and amount.- (l) Where the annual land revenue of an estate is payable at one harvest, the demand of each year from that estate on account of rates and cesses shall be paid at the same harvest. (2)   In all other cases, the demand of each year from an estate on account of rates and cesses shall be paid in two instalments, viz one at the   Kharif   harvest and the other at the   Rabi  harvest and each instalment shall bear the same proportion to the total demand of the year as",
  "the instalment or instalments of land revenue due on the same estate for the same harvest bear to the total land revenue payable by the estate for the same year. 53.   Rates and cesses paid alongwith first instalments of land revenue.- Rates and cesses due at each harvest, shall be payable on the date on which the first instalment of land revenue due from the same estate, on account of the same harvest, is payable, and except as by these rules is otherwise provided, at the revenue office appointed for the receipt of land revenue due to Government in the same   Tehsil . 54.   Rules in the case of estates in which no land revenue is payable.- Where no land revenue is payable by an estate, the rates and cesses due therefrom shall be payable by the same instalments and dates by which the rates and cesses of the adjacent estates are payable; and the Collector shall, by order, determine the instalments and the dates which are applicable under this rule. 55.   Portion of rates and cesses not payable to Government.-   A headman, when paying an instalment of rates and cesses as required by rule 53 shall, subject to the provisions of clause (a) of rule 24, be entitled to withhold the   Lambardari   fee.  RECOVERY OF ARREARS  56.   Application of Headmen for recovery of arrears from defaulters.- (1) When headman wants to make recovery of land revenue or any sum recoverable as an arrear of land revenue under section 113, he shall make an application to the Revenue Officer stating herein- (a)   the name and description of the defaulter; (b)   the arrear of which recovery is desired; (c)   the circumstances which have made the application necessary. (2)   Any number of defaulters residing in the same estate may, at the discretion of the Revenue Officer, to whom the application is made, be included in the same application, but the arrear due from each defaulter shall be separately specified. 57.   Defaulter to be summoned.-   (1) If the application is in proper form and the arrear of which recovery is desired has not been due for more than six months, the Revenue Officer shall fix a date for the hearing of the case and shall serve a notice of demand in Form XXXIII on the defaulter, together with a notice requiring him to appear on the date so fixed, if the demand has not, in the meantime, been paid.",
  "(2)   If the arrear has been due for more than six months the application shall be rejected, unless the applicant satisfies the Revenue Officer that the delay in realizing the arrear is not due to his neglect, and, if he is so satisfied, the Revenue Officer shall proceed as in sub-rule (1). 58.   Recovery of arrears from defaulters.-   On the date fixed for the attendance of the defaulter, or any subsequent date to which the matter may be adjourned the Revenue Officer shall make an inquiry into the existence of the arrear. And if it is proved, he shall record an order stating the amount of the arrear and the person who is the defaulter, and shall thereafter proceed to recover the same. 59.   Sale under section 88 or section 90 to be preceded by attachment.- (l) When it is proposed to sell a holding or any other immovable property under section 88 or section 90, such holding or immovable property shall, in the first place, be attached in the manner provided in section 85. (2)   The sale of immovable property shall be conducted by a Revenue Officer not below the rank of a   Tehsildar .  PROCESS FEES  60.   Charge for service of processes.-   For the service of every notice of demand, warrant or other process for the collection of Revenue, under Chapter VIII and IX of the Act, 45   [the following charges shall be made: - (i)   where the revenue involved is Rs.10 or less   ..   Rs.1.50 (ii)   where the revenue involved is more than Rs.10 and   less   Rs.5.00 than Rs.1,000. (iii)   where the revenue involved is Rs.1,000 and above   ..   Rs.10.00]  PART VIII-REMISSION OF LAND REVENUE  61.   Power to sanction remission.- The Delegation of Powers, in respect of the remission of land revenue are as under:- (a)   Remission of land revenue on account of failure of crop (i) Board of Revenue (ii) Commissioners Full Powers Full Powers (b)   Remission of land revenue during calamities (i) Board of Revenue (ii) Commissioners (iii) Deputy Commissioners Full Powers Rs.10,000 per district Upto Rs.1,000  45   Substituted by Board of Revenue, Punjab’s notification No.3969-73/1492-LR-II, dated 29 th   June, 1973, published in the Gazette of Punjab, Extraordinary, June 29, 1973 for the words and figures “a charge of Re. 1 shall be made where the revenue involved is more than Rs. 5 and 75 paisa where the revenue involved is Rs. 5 or less”.",
  "PART IX-SURVEY AND BOUNDARIES  62.   Demarcated areas of forest land, etc. owned by Government to be considered estates.- All demarcated areas of uncultivated and forest land owned by Government are declared to be estates within the meaning of the Act. 63.   Survey marks.- The survey marks defined in clause (24) of section 4, set up by the Survey of Pakistan include:- (i)   Great Trigonometrical Stations. (ii)   Base line stones, placed in the course of riverain surveys. (iii)   Traverse stations (in estates not surveyed on the square system). (iv)   other   traverse   data   (such   as   corner   stones,   indicating   blocks   in   the rectangulation). (v)   international boundary pillars. 64.   Boundary marks.-   The following boundary marks shall be erected by or under the orders of Revenue Officers-  A-TRI-JUNCTION PILLARS ( SIHADAS )  At every point, where the boundaries of more than two estates meet and, at such other places on the boundary line, as may be necessary for the convenient determination, of the boundary of an estate, a tri-junction pillar of the following specification shall be constructed: -  Material.- A single block of stone, or masonry of stone or burnt brick with lime mortar; if masonry, upper surface to be plastered with   pacca   lime plaster.  Shape.- If a stone block, in length and breadth not less than 18 inches and in depth, not less than 3 feet. If masonry cubic, each edge of the cube not less than three feet long.  Position.- The lowest side of the pillar to be accurately bedded upon a levelled surface, and only half the pillar to be above ground.  B -   BURJIS  (i)   At every angle on the boundary line between two   sihadas   a   Burji   mound or  dari   (mud pillar or stone slab) shall be set up. (ii)   At every corner of the survey squares or rectangles, a masonry or stone pillar, shall be set up. 65.   Land measurement or survey.- The land measurement or survey may be - (a)   on square system; or (b)   on rectangulation system; or (c)   on   Kishtwari   system (measurement in original shape of the Survey/ Khasra  Number) in the hilly tracts or riverain areas or similar lands where the measurement or survey is not practicable in accordance with the square or rectangulation systems. 66.   Size of area of Survey/Khasra Number.- Notwithstanding the provisions of sub section (1) of section 133, Survey/ Khasra   numbers which have already been made of less than one acre in area or which may be so made under the order of the Collector in this behalf,",
  "and any Survey/ Khasra   number separately entered in the record-of-rights or the periodical record, shall, irrespective of its area, be deemed to have been made under the Act. 67.   Conditions for and restrictions upon sub-division of Survey/Khasra numbers.-  (1) Survey/ Khasra   numbers may be divided into so many sub-divisions – (a)   as may be required in connection with the acquisition of rights referred to in sub-section (1) of section 42, or (b)   for any other reasons with the sanction of the Collector. (2)   The area and land revenue of such sub-divisions shall be entered in columns 11 and 13, respectively, of the Mutation Register (Form XXXV). The supplementary map ( Tatimma Shajra ) of the respective Survey/ Khasra   number shall be drawn on the back of the mutation sheet giving the particulars contained in Form XIV.  46   [PART IX-A-DEMARCATION OF LAND AND EVICTION OF UNAUTHORIZED LANDOWNERS  67-A.   Demarcation of land.- (1) An application under section 177 for defining the limits of an estate, a holding, a field or any portion thereof, shall contain the following particulars:- (a)   Designation of the Revenue Officer to whom it is addressed. (b)   Name, parentage and address of the applicant and if the applicant is minor, or a person of unsound mind. the name, parentage and address of his guardian or of a male member of his family. (c)   Name, parentage and address of the person or persons against whom the application is made, and if he or any one of them is a minor or of unsound mind, the name, parentage and address of his guardian or of a male member of his family. (d)   Location and full description of the land to be demarcated. (e)   A brief statement of facts and reasons necessitating the making of application. (f)   Signatures or thumb-impression of the applicant. (g)   Any other matter which is necessary for the proper disposal of application. (2)   An application under sub-rule (1) shall bear the court-fee stamp of rupee one and shall be accompanied by: - (a)   An attested copy of the latest entry in Register   Haqdaran-Zamin   or   Jamabandi  relating to the land mentioned in the application; and (b)   an attested copy of the portion of the map of the estate showing field numbers mentioned in the application. (3)   The application shall be presented to: - (a)   the Revenue Officer-in-charge of the Circle in case the land to be demarcated is situated within a   Tehsil ; and (b)   the Revenue Officer-in-charge of a Sub-Division, in case the limits of the land to be defined extend to an adjoining Sub-Division or District. 46   Added by Board of Revenue, Punjab’s notification No.2313-73/629-LR-I, dated 19 th   July, 1973, published in the Gazette of Punjab, Part III, November 23, 1973.",
  "(4) On the receipt of such application duly accompanied by the attested copies mentioned in sub-rule (2), the Revenue Officer concerned shall: - (a)   cause the application to be registered in the relevant column of the Register to be maintained in his office in Form XXXIII-A; (b)   fix time and date for demarcation of boundaries; and (c)   cause a notice in Form XXXIII-B to be issued in duplicate to- (i)   the parties to the application; (ii)   Lambardar   of the village in which the land mentioned in the application is situated; (iii)   Field   Kanungo   of the Circle; (iv)   Revenue   Patwari   of the village if the notice is not to be served through him; and (v)   any other person whose presence at the time of demarcation of boundaries is considered necessary or expedient by the Revenue Officer. (5)   The notice issued under clause (c) of the preceding sub-rule shall be served on the persons mentioned therein, in the following modes, at least one week before the date fixed for demarcation of land:- (a)   by delivering a copy thereof to the person mentioned therein and obtaining his signature or thumb-impression on duplicate copy in token of his having received the same: (b)   in case of refusal to receive the notice or absence of such person, by affixing a copy thereof on the outer-door of his house or place of residence, in the presence of at least one witness and also by beat of drum at the expense of the applicant; (c)   if any person to be served is residing at a place, other than the village in which the land is situated, notice shall be served on him, by means of registered post \"Acknowledgement Due\", or by any other means as the Revenue Officer deems fit. The expenses for such service shall be borne by the applicant. (6)   At the time and on the date fixed for demarcation of boundaries, the Revenue Officer shall, in the presence of the parties and other persons mentioned in clause (c) of sub- rule (4) as may be present in response to the notice served on them, cause the measurement of the   land   to   be   taken   under   his   personal   supervision,   strictly   in   accordance   with   the instructions and standing orders on the subject issued by the Financial Commissioner and the Board of Revenue from time to time. (7)   (a) Soon after taking necessary measurement, the Revenue Officer, on the basis of data so collected, shall draw up a plan of the encroached area, if any, and shall prepare a report \"inter alia\", containing the following details:- (i)   Time, date and place of demarcation of boundaries. (ii)   Full description of the land measured and demarcated. (iii)   Mode and details of the measurements taken.",
  "(iv)   Persons   in   whose   presence   such   measurements   were   taken   and   other demarcation proceedings took place and the objection, if any, raised by any one or more of them during that time. (v)   Limits of the existing possession including the exact dimensions of the encroached area, if any, and the names of the persons found in possession thereof. (b) The Revenue Officer, after preparing the report, shall read out the same to the parties and record their statements as to whether they have understood the proceedings or any party thereof and have any objection against any portion of his report. (c)   After recording such statements and his opinion thereon, the Revenue Officer, on return to his Headquarter, shall place the report, together with the plan of encroached area and   statement of the parties, on the file and cause the particulars of the proceedings entered in the relevant columns of Register maintained in office in Form XXXIII-A. 67-B.   Eviction of unauthorized land-owners.- (1) An application under section 122 for the eviction of a land-owner found in wrongful possession of a land as a result of demarcation proceedings taken under section 117 read with rule 67-A, shall contain the following particulars:- (a)   Name, parentage and address of the applicant, and in case he is minor or a person of unsound mind, parentage and address of his guardian or of a male member of his family. (b)   Name, parentage and address of the person who has been found in wrongful possession of the land (hereinafter referred to as the respondent) and if he happens to be a minor or a person of unsound mind, the name , parentage and address of his guardian or of any male member of his family. (c)   Location and description of the land, the possession of which is required. (d)   Brief statement of demarcation proceedings, its result and reasons for the application. (e)   Any other fact which may be necessary for the fair disposal of the application. (2)The application shall bear the court-fee stamp of rupee one and shall be accompanied by: - (a)   a certified copy of the report, including copy of the plan of encroached area, prepared by the Revenue Officer in the demarcation proceedings conducted by him under rule 67-A; and (b)   as many copies of the application as the number. (3)   The application shall be addressed and submitted to the Collector-in-charge of the Sub-Division in which the land in dispute is situated: Provided that where the demarcation proceedings are conducted by the Revenue Officer-in-charge of the Sub-Division, the application shall be addressed and submitted to the Collector of the District. (4)   On the receipt of the application, the Collector shall fix a date for its hearing and cause its notice in Form XXXIII-C, together with a copy of the application, to be served on the respondent in the manner prescribed in sub-rule (5) of rule 67-A.",
  "(5)   On the date fixed for hearing, the respondent may put up his appearance either in person or through an authorised agent and may file his reply to the application. The Collector, on the same date of hearing or on any subsequent date to which the proceedings may be adjourned,   after   hearing   the   parties   and   examining   the   record,   including   the   file   of demarcation proceedings, may - (a) direct fresh demarcation proceedings to be taken by the same or any other Revenue Officer, if he is satisfied that the land-owner whose eviction from the land has been sought, had no knowledge of the demarcation proceedings or there was   some   material   irregularity   committed   by   the   Revenue   Officer   in   such proceedings; or (b) accept the application and order eviction of the respondents or any one or more of them who have been found in wrongful possession of the land or any portion thereof: Provided that where the proceedings substantially involve a question of title or an intricate question of law, the Collector shall not pass any order on the merits of the application and shall refer the parties to the Civil Court. (6)   If the Collector orders fresh demarcation proceedings to be taken by the same or any other Revenue Officer, such Revenue Officer shall follow the procedure laid down in rule 67-A to the extent and from the stage it become applicable. (7)   On the acceptance of the application, the Collector shall afford the respondent an opportunity of delivering possession of the disputed land to the applicant within a period not exceeding one month and if he fails to do so, the Collector, on an application made by the applicant, shall issue a warrant of eviction in Form XXXIII-D which shall be executed by an official not below the rank of a   Kanungo , with or without police assistance, according to the circumstances of each case].  PART X-EXECUTION OF CERTAIN ORDERS OF CIVIL AND CRIMINAL COURTS THROUGH REVENUE OFFICERS  68.   Appraisement of value of produce before   sale.- When the produce of any land has been attached in pursuance of an order for its attachment and sale addressed to the Collector by a Civil or Criminal Court, the Collector shall direct that an appraisement of the attached produce be made by a Revenue Officer or by the   Kanungo   of Circle in which the land is situated within a month of the date of receipt of such direction. The produce shall not be sold until the appraisement has been approved by the Collector or by a Revenue Officer appointed by him in this behalf: Provided that if the appraisement is not made within the prescribed period, the sale of the produce shall not be delayed merely on this account. 69.   Agency to be used in conducting sale.-   Sale of the produce of land shall be made by a Revenue Officer or by the Field   Kanungo   of the Circle in which the land is situated. The sale shall be conducted in the presence of the Headman, or a Member of the Union Committee, Town Committee, or Union Council within the jurisdiction of which the land is situated. 70.   Date on which possession is to be given to decree-holder of Civil Court.- When an order of a Civil Court is sent to the Collector for the execution of a decree for the possession of lands the Collector shall give possession to the decree-holder on the date specified in the decree or in the direction issued by the Civil Court executing the decree. If no date is specified in the decree or by the Civil Court and the land of which possession is to be",
  "given is in the cultivating possession of the judgment-debtor, the Collector shall at once refer to the Civil Court for instructions as to whether or not he is to delay execution until any crop which may have been sown by the judgment-debtor and is standing on the land, has been removed.  PART XI- MISCELLANEOUS  71.   Village Note Book.-   (1)   A village note book ( Lal Kitab ) shall be prepared, for each estate, comprising the following statements- (i)   Annual Area. (ii)   Annual   Kharif   Crop. (iii)   Annual   Rabi   Crop. (iv)   Annual Revenue Account. (v)   Annual Transfers of Land by Owners, etc. (v-a)   Annual Sales and Mortgages of Ownership by classes of land. (vi)   Quadrennial Abstract of Ownership and Mortgages. (vii)   Quadrennial Abstract of Cultivation by Owners and Tenants. (viii)   Quadrennial Abstract of Cash Rent paid by Tenants. (ix)   Quinquennial Return of Cattle, Carts, etc. (x)   Assessment. (2)   A note book comprising the statements mentioned in sub-rule (1), in a consolidated form, shall also be maintained in respect of each Assessment Circle,   Tehsil   and District. 72.   Forms.-   In addition to the Forms specified in the foregoing rules, the following forms are also prescribed: - (i)   Register Haqdaran Zamin (Form XXXIV). (ii)   Mutation Register (Form XXXV) (iii)   Statement of Customs (Form XXXVI). (iv)   Requisition of information/documents (Form XXX VII). (v)   Holding Slip (Form XXXVIII). (vi)   Interrogatory (Form XXXIX). (vii)   Register of Miscellaneous Land Revenue (Form XL). (viii)   Warrant of Arrest (Form XLI). (ix)   Warrant of Committal of Defaulter to Civil Jail (Form XLII). (x)   Order for the Release of Defaulter (Form XLIII). (xi)   Warrant of Distraint (Form XLIV). (xii)   Warrant of sale of movable property (Form (XLV). (xiii)   Warrant of Transfer of Holding (Form XLVI). (xiv)   Warrant of Attachment (Form XLVII).",
  "(xv)   Proclamation of Sale (Form XLVIII). (xvi)   Certificate of Sale (Form XL1X). (xvii)   Instrument of Partition (Form L). (xviii) Register showing the amount of fee realized by   Patwari ; for inspection of records and grant of certified copies therefrom (Form LI). (xix)   Register showing survey equipments (Form LII). (xx)   Register of Records in the custody of   Patwari   (Form LIII). (xxi)   Statement showing the condition of Survey and Boundary Marks (Form LIV). (xxii)   Register of   Patwari   Circles (Form LV). (xxiii)   Work-book for   Patwaris   (Form LVI). (xxiv) Work book for   Kanungos   (Form LVII). (xxv)   Work-book for   Tehsildars   and   Naib - Tehsildars /Head   Munshi   (Form LVIII). (xxvi) List of Mortgages with possession (Form LIX). (xxvii) List of Rents (Form LX). (xxviii)List of   Khatauni   Totals (Form LXI). 47   [(xxix) Day Book (Form LXII). (xxx)   Ledger of Demand and Collections (Form LXIII). (xxxi) Balance Sheet (Form LXIV). (xxxii) Register of Demand and Recoveries of Water-Course Expenses (Form LXV). (xxxiii)Register of Area and Assessment of Cultivation in Un-surveyed Land (Form LXVI)]. 47   Added by Board of Revenue, West Pakistan’s notification No.534/69/526-U(I), 15   th   September, 1969, published in the Gazette of West Pakistan, Extraordinary, October 9, 1969.",
  "APPENDIX A FORM I ( See   RULES 22 AND 46) RECEIPT FOR THE COLLECTION OF LAND-REVENUE, RATES AND CESSES, ETC.  Book No.   Date ______________ Receipt No. Received Rs. ________________________ (in words)_______________________________ ___________________________________________________________________________ 1.   Land-Revenue Fixed   ......  In the form of prescribed rates   ......  Rs.   Ps.   as detailed in the margin, on Khewat (name of Land-owner)_______________________ ____________________________________ estate ______________ tehsil __________ district _____________________________ for the harvest _____(if any) _______Estate______ Patti __________   __________________ Tapedar Circle ______________________________ 2.   Development Fee   ......  3.   Local Rate   ......  4.   Canal water-rate   ......  5.   Mutation fee   ......  6. 7. 8. 9. Total   ......  Taraf Kharif Rabi Lambardar",
  "FORM II ( See   RULE 30) PRELIMINAY PROCEEDING (ROBKAR IBTEDAI)  Record-of-right (misl-i-haqiat)   Estate _____________________ Had-Bast No. __________________________ Tehsil _______________________________ District __________________________ Year ____________________________________ This record-of-rights of the above-named estate has been prepared in pursuance of the orders of the Board of Revenue, West Pakistan, issued vide Notification No. ____________, dated ______________ under sub-section (1) of section 40 of the West Pakistan Land Revenue Act, 1967. This record comprises the following documents:- This Preliminary proceeding up to the Estate Genealogical tree Index survey / Khasra No. 48   [Alphabetical Index of owners and mortgagees] 49   [*****] Register Haqdaran Zamin Note of changes in kind of soil Reigister Haqdaran Nakhlistan Statement of rights in wells and tubewells Statement of customs Order of the Revenue Officer determining the assessment Order of the Revenue Officer distributing assessment over holdings. Sheets of accepted mutations Field Book REMARKS Date of commencement ______________ Date of completion of record ________________ I certify that this record-of-rights is correct and complete in all respects. Collector. Dated____________   District_____________ 48   Substituted by Board of Revenue, Punjab’s notification No.1750-88/281-LR-II dated 02-04-1989, published in the Gazette of Punjab, Extraordinary, April 4, 1989). 49   Omitted ibid.",
  "FORM III ( See   RULE 30) SHAJRA NASAB Genealogical tree (Shajra Nasab) of Owners Estate...............Tehsil...............District...............Year............  Statement of the owners   Statement of Signs  1.   Origin of rights and primary division of the lands. Name of Signs   Colour of Signs 2.   The foundation of the estate,and how named. 1.   Headman (Lambardar) Vermilion Encircled 3.   Method of collection of the Revenue- 2.   Isssue-less  (a) (b) under the former Govt:- under the regime of the present Govt:- 3.   Wife or widow  (i) (ii) during the former settlement During the present settlement. 4.   Whose father or grandfather or husband is land owner and is alive. Name in red ink. 5.   Daughter Patti Taraf",
  "Part-A for opening page Part-B for other pages Caste and sub- caste No.Khewat Measure of Rights.",
  "FORM IV ( See   RULE 30) INDEX SURVEY / KHASRA NUMBERS  Estate...............Tehsil...............District...............  Survey / Khasra No. No. Khatuni  50   [FORM V ( See   RULE 30) ALPHABETICAL INDEX OF OWNERS AND MORTGAGEES (INDEX RADEEFEAR MALIKAN WA MURTAHINAN)  Estate...............Tehsil...............District............... Book No. Leaf No. Alphabetical Letters Name of owner / mortgagee with father’s / husband’s name No. Khewat Ownership rights Mortgagee rights   Other rights, if any. ]  51   [*****]  50   Substituted by Board of Revenue, Punjab’s notification No.1750-88/281-LR-II dated 02-04-1989, published in the Gazette of Punjab, Extraordinary, dated April 4, 1989. 51   FORM VI omitted ibid.",
  "FORM VII ( See   RULE 30) NOTE OF CHANGES IN KIND OF SOIL  Estate...............Tehsil............... District............... Year ....................  Area (in acres) and classes of land  Grand Total  Cultivated   Uncultivated Chahi Nahri Nul Chahi Barani Total Banjar Qadeem Banjar Jadeed Banjar Qadeem Ghair Mumkin Total According to the entries of last Register Haqdaran Zamin of the year .... According to the entries of the current Register Haqdaran Zamin Difference Increase Decrease  Signature of Patwari   Signature of Kanungo   Signature of Revenue Officer",
  "FORM VIII ( See   RULE 30) REGISTER HAQDARAN NAKHLISTAN (DATE TREES)  Register Heqdaran Nakhlistan   Estate...............Tehsil............... District............... Year .................... Book No. Leaf no. Khewat No. Khatauni No. Name of the owner of land with description. Name of the owner of date trees with description Survey / Khasra No. Area Source of Irrigation including name of well, rajbah, etc Number of date trees   Government demand Remarks Female Eunuch Male Total Revenue Cesses 1   2   3   4   5   6   7   8   9   10   11   12   13   14  Note:   In the register Haqdaran Nahlistan which forms part of record-of-rights (Misl- i-haqiat) column 5 (Survey / Khasra No.) should be divided into two sub-columns headed respectively “former” and “present”.",
  "FORM IX ( See   RULE 30) STATEMENT OF RIGHTS IN WELLS AND TUBE-WELLS (NAQSHA HAQUQ CHAHAT WA NUL-CHAHAT)  Statement of rights in Wells and Tube-wells   Estate...............Tehsil............... District............... Year .................... Wells   Tube-Wells Serial No. Survey / Khasera No. Khatauni No. Name of Well / Tube-well Depth to water (in feet) Depth on water (in feet) Whether single or double, pacca or katcha, in use or out of use Length of tube (in feet) Length of filter (in feet) Depth to water (in feet) Mouth of tube (in inches) Whether working on oil engine or electric motor with horse power Whether in use or out of order Whether at work at last settlement or made subsequently and in the later case, in what year it began to be used. Name of owner with description and share in ownership of well / tube-well Name of persons with description who use the well / tube- well, and share of water enjoyed by each REMARKS 1   2   3   4   5   6   7   8   9   10   11   12   13   14   15   16   17",
  "FORM X ( See   RULE 30) STATEMENT OF DISTRIBUTION OF WATER (FARD TAQSEEM AB)  Estate...............Tehsil...............District............... Year ....................  Source of Irrigation Serial No.   Number Khewat Name of owner with description Share   REMARKS",
  "FORM XI ( See   RULE 30) STATEMENT OF RIGHTS IN WATER MILLS (NAQSHA HAQUQ PANCHAKIAT)  Estate...............Tehsil...............District............... Year ....................  Income per day and night  Serial No. Survey / Khasra No. No. Khatauni Name of Karez, water-fountain stream, rand, on which the water-mill is installed Whether at work at last settlement of made subsequently and in the later case in what year it began to be used and at what expenses Name of owner of water-mill with description Name of owner of water-mill with description Name of asiaban with description Grinding for one day and night Share of owner of water Share of owner of water mill Share of asiaban For how many days and nights the water mill remains closed in a year Government demand REMARKS 1   2   3   4   5   6   7   8   9   10   11   12   13   14   15  Note:   The entries in columns 9 and 13 should be made very carefully, as the assessment of Revenue Officer mostly depends thereon.",
  "FORM XII ( See   RULE 30) FIELD BOOK  Field Book   Estate............Tehsil............District............... Year ........... Survey / Khasra No.   No. Khatauni Length and Breadth of Survey / Khasra No. Calculation of area Area and Soil classification Signature of Kanungo REMARKS Former   Present   East   West   South   North",
  "FORM XIII ( See   RULE 30) TITLE PAGE REGISTER HAQDARAN ZAMIN  Title page Register Haqdaran Zamin   Estate...............Tehsil............... District............... Year .................... Date of filing in the Tehsil Office   Date of consignment to District Revenue Record Room No. Nature of document Title page Genealogical tree Index Surevey / Khasra No. 52   [Alphabetical Index of owners and mortgagees]. Register Haqdaran Zamin Note of changes in kind of soil Register Haqdaran Nakhlistan Supplementary Map Fard Badar Checking and attestation notes by the Kanungo Checking and attestation notes by the Revenue Officer Final attestation Certificate by the Revenue Officer Sheets of accepted mutations REMARKS Pages from  Signature of Patwari   Signature of Kanungo   Signature of Revenue Officer  52   Added by Board of Revenue, Punjab’s notification No.1750-88/281-LR-II dated 02-04-1989, published in the Gazette of Punjab, Extraordinary, April 4, 1989.",
  "FORM XIV ( See   RULE 30) SUPPLEMENTARY MAP (TATIMMA SHAJRA)  PART A   PART B  Supplementary Field Book.   Estate ............... Tehsil...............District............... for the Year ............ Book No. Leaf No. 2 Squares / 2 Rectangles Signature   Signature   Signature of   of   of Patwari   Kanungo   Revenue Officer Survey / Khasara No. No. Khasra   Length and Breadth of Survey/ Khasra No. Calcula- tion of area Area and soil classifi- cation REMARKS Former Present   East   West   South   North Signature   Signature   Signature of   of   of Patwari   Kanungo   Revenue  Officer",
  "FORM XV ( See   RULE 30) FARD BADAR (STATEMENT OF CORRECTION OF CLERICAL MISTAKES)  A statement for the correction of clerical mistakes, which has been made in copying the entries of the Register Haqdaran Zamin into another or in incorporating a mutation in a Register Haqdaran Zamin and the correction of which does not involve the alteration of any mutation order shall be recorded in the form set forth below, to be known as Fard Badar:-  Fard Badar   Estate ............ Tehsil ............... District .................  Serial No. No. of Khewat   Patwari’s report Field Kanungo’s report Order of the Revenue Officer In last Register Haqdaran Zamin In new Register Haqdaran Zamin 1   2   3   4   5   6",
  "FORM XVI ( See   RULE 30) FINAL ATTESTATION CIRTIFICATE OF REGISTER HAQDARAN ZAMIN FOR THE YEAR .................  Estate ................. Tehsil ............... District .................   Book No. Leaf No.  Date of attestation  Place of attestation Khewat attested Verification of mutation orders incorporated in the Register Haqdaran Zamin Khewat checked with the previous Register Haqdaran Zamin Khewat compared with the Patwari’s current copy of the Register Haqdaran Zamin Survey / Khasra numbers of which supplementary maps were checked on the spot Survey / Khasra numbers of which supplementary maps were checked with reference to their incorporation in the tehsil copy of the map Mutations entered but not attested before 30 th   June REMARKS 1   2   3   4   5   6   7   8   9   10 I ................... certify that all necessary corrections have been made and that this Register Haqdaran Zamin is correct and complete in all respects, except as regards mutations shown in column 9 and other transfers discovered to have taken place before 30 th   June last and referred to in the memorandum attached to the Register Haqdaran Zamin. Dated .........................   Revenue Officer",
  "FORM XVII ( See   RULE 31(6)) STATEMENT SHOWING THE CHECKING AND ATTESTATION WORK OF RECOREDS OF RIGHTS AND PERIODICAL RECORDS  District ................. for the month ending ............................... Tehsil Year to which the records relates No. of estates for which the record of rights or periodical records are to be prepared  No. of estates for which the  records of rights or periodical records checked and attested No. of estates for which the record of rights or periodical records - REMARKS Kanungo Naib Tehsildar / Head Munshi Tahsildar Revenue Assistant / Sub-Divisional Officer, Assistant Commissioner / Deputy Collector Collector / Additional Collector Commissioner / Additional Commissioner Director of Land Records / Assistant to the Director of Land Records (a) Field in Tehsil / Sub-Divisional Revenue Record Room (b)   Consigned to District Revenue Record Room. Previous year Current year",
  "FORM XVIII ( See   RULE 32) MEMORANDUM REGARDING TRANSFER OF RIGHTS  Estate ................. Tehsil ............... District .................  1   2   3   4   5   6   7   8 Mutation Number   Nature of mutation, i.e. sale, mortgage, inheritance, etc. with price in case of sale and mortgage-debt in case of mortgage.  Date of decision   Name of transferor with description Name of transferee with description Area transferred, i.e. survey/ Khasra No. share of Khata, etc. Copy of the operative part of the Revenue Officer’s order, as recorded by him on counterfoil of mutation REMARKS",
  "FORM XIX ( See   RULE 33) STATEMENT SHOWING THE MUTATIONS PENDING OVER THREE MONTHS, FOR THE MONTH ENDING......................  Revenue Officer Circle ........................ Tehsil ............... District .................  Name of Estate   Mutation No.   Date of entry   Nature of mutation, i.e. sale, mortgage, etc. Reasons for non- attestation as well as the measures proposed to be adopted for disposal REMARKS",
  "FORM XX ( See   RULE 34) Book No......... Page No............  Roznamcha Waqiati of Patwari Circle .................. Tehsil ............... District ................. Serial No.   Date   Heading of entry   Occurrences   REMARKS",
  "FORM XXI ( See   RULE 35) AKNOWLEDGEMENT UNDER SECTION 47 (2) OF THE WEST PAKISTAN LAND REVENUE ACT, 1967  Certified that Mr. / Mrs. ....................................................... son of   , ................, resident of .................. Tehsil ............. District ................. has furnished the information / documents pertaining to the subject matter specified below, requisitioned under Section 47 (1) of the West Pakistan Land Revenue Act, 1967:- ........................................... ........................................... 2.   The document(s) have been returened after inspection. Dated ...................   Signature ........................ Patwari of the Circle Revenue Officer of the Circle ............... _______________________________________________________________________________ Note: Revenue Officer may strike off para 2 when a document is retained by him. { wife of",
  "53 [ FORM XXI-A (See sub-rule (2-A) of rule 36) Register showing the applications for grant f certified copies or extracts of records in possession of Patwari received in the office of Collector of the Sub-Division and disposed of.  Tehsil ...............   District ................ 1   2   3   4   5   6   7   8   9 Serial No. Date of Receipt of application Name of applicant with description Nature of record of which copy is desired Names of concerned estate, Patwari Circle and Union Council Ordinary or Urgent Date given for receipt of copies Incase of urgent applications, the date on which copies were actually delivered to the applicant Remarks  ]  53   Add by Board of Revenue, Punjab’s Notification No. 1180-87/837/LR-II dated 12-05-1987, published in the Gazette of Punjab, Extraordinary, dated May 13, 1987.",
  "supply of copies inspection of records FORM XXII { See   NOTE No. 4 UNDER THE SCHEDULE TO RULE 36(3) AT APPENDIX “B”} Receipt of fee for the inspection of records of patwari   and grant of certified copies or extracts therefrom  _________________________________________________________________________ Receipt No. ............................... Date .................................................... Received Rs. ........................................................................................ (in words) ............................................................................................ for the   as detailed below, of the estate ................................. Details of record Signature Patwari Circle ___________ Tehsil __________________ District _________________ ...................................................................................................... ...................................................................................................... ....................................................................................................... }",
  "Patwari Circle Office Kanungo Tehsil a copy copies FORM XXIII { See   NOTE No. 8 UNDER THE SCHEDULE TO RULE 36(3) AT APPENDIX “B”} Acknowledgement of the receipt of application for the supply of copies of records of Patwaris under Rule 36 of the West Pakistan Land Revenue Rules. Receipt No. ........................   Dated ........................ Received from ............................................................................ an application for the supply of   of records of the state ............................. and Rs. ............(in words)............................ as advance copying fee.",
  "54   [ FORM XXIII-A { See   Sub-rule (6) of RULE 37-A}  Register of fees for the Preparation of Produce Statement and Five-yearly Abstract of yield. Particular of requisition   Details of work Fees Serial No. Date of Receipt of requisition. Name of Court of Officer. Name of Parties. Name of Estate. Khasra No. Period for which produce statement of five-yearly Abstract of yield is desired. Govt.’s Share Share of Govt. servant concerned Signature of official preparing the statement of abstract and the date on which he presents the same in the Court or Office concerned. Attestation of Officers. Remarks Amount Date of payment Receipt No. Amount Date & payment Receipt No. 1   2   3   4   5   6   7   8   9   10   11   12   13   14 ] 54   Added by Board of Revenue, West Pakistan’s notification No.534/69/526-U(I), 15   th   September, 1969, published in the Gazette of West Pakistan, Extraordinary, October 9, 1969.",
  "Book No. Leaf No. Kharif Rabi Kharif Rabi Kharif Rabi Kharif Rabi FORM XXIV ( See   RULE 39) CROP INSPECTION REGISTER (REGISTER GIRDAWARI) A Register to be known as the Register   Girdawari   shall be maintained under the provisions of sub-section (3) of section 41, in the form setforth below:- Register Girdawari Estate ................. Tahsil ............... District .............. Survey / Khasra No. Name of owner and number Khewat Name of cultivator and number of Khatauni Area including class of soil Kharif Crop Rabi Crop Changes of rights, cultivation, possession and rent, with reference to Dakhil Kharij Kharif Crop Rabi Crop Changes of rights, cultivation, possession and rent, with reference to Dakhil Kharij Kharif Crop Rabi Crop Changes of rights, cultivation, possession and rent, with reference to Dakhil Kharij Kharif Crop Rabi Crop Changes of rights, cultivation, possession and rent, with reference to Dakhil Kharij Remarks 1   2   3   4   5   6   7   8   9   10   11   12   13   14   15   16   17  Note   – The twice cropped ( dofasli ) area shall be shown in red ink.",
  "Book No. Leaf No. Kharif Rabi  55   [ FORM XXIV-A ( See   sub-rule (2) of the Rule 39) Register Taghayyurat-e-Kasht Estate ................. Tahsil ............... District ................................... Year ......... 1   2   3   4   5   6   7   8 Serial No. Date of Crop Inspection Khasra number with areas under change Former entry Present entry Signature of Patwari with date Attestation by Field Kanungo with date Attestation by Revenue Officer with date ]  55   Added by Board of Revenue, Punjab’s Notification No. 1180-87/837/LR-II dated 12-05-1987, published in the Gazette of Punjab, Extraordinary, dated May 13, 1987.",
  "Kharif Rabi FORM XXV ( See   RULE 41) STATEMENT OF   KHARABA  Estate ................. Tahsil ............... District ............................ year ......... Survey / Khasra number and name (if any) AREA Attestation by Field Kanungo Attestation by tehsildar / Naib-Tehsildar (Head Munshi) Attestation by Assistant Collector of the first Grade Remarks Cultivated Matured Failed 1   2   3   4   5   6   7   8",
  "Kharif Rabi Patti Taraf Kharif Rabi Kharif Rabi Kharif Rabi Kharif Rabi Kharif Rabi Kharif Rabi Kharif Rabi  FORM XXVI ( See   RULE 44) DHAL BACHH MALIA MUSTAQIL (Distribution of fixed revenue over holdings) In the estates under fixed assessment under clause (a) of sub-section (3) of section 56, the   Bachh   papers to be known as   Dhal Bachh Malia Mustaqil   shall be prepared for every estate immediately after the   Kharif Girdawari   (harvest inspection), in the form setforth below:- ___________________________________________________________________________  Dhal Bachh Malia Mustaqil  Estate ...........   (if any)..........,Tahsil ............ District ...... Crop   year ......... Name of Lambardar ................................... (if any) Rates and Cesses   Dakhil Kharij fee Serial Number Name of land-owner with description Number Khewat Malik or reference to Dakhil Kharij Land Revenue Development Fee  Local Rate Lambardari Fee Water Rate Lambardari Fee on Water Rate Total Number Dakhil Kahrij Total Fee Grand Total Remarks Note:-   The Lambardar’s copy shall contain the entries of the respective harvest only. Kharif Rabi",
  "Patti. Taraf   Kha  FORM XXVII ( See   RULE 44) DHAL BACHH MALIA GHAIR MUSTAQIL (Distribution of revenue in the form of prescribed rates over holdings)  In the estates in which assessment is levied in the form of prescribed rates under clause (b) of sub-section (3) of section 56, the   Bachh   papers to be known as   Dhal Bachh Malia Ghair Mustaqil   shall be prepared after the   Girdawari   (Harvest inspection) on which the assessment is based, in the form set forth below:  ________________________________________________________________________  Dhal Bachh Malia Ghair Mustaqil  Estate ........   (if any) ....,......,Tahsil ........., District ..............Crop   year....  Name of Lambardar________________________________ (if any) Rates and Cesses   Dakhil Kharij Fee Serial Number Name of land-owner with description Number Khewat Malik Survey / Khasra Number Total area under assessment Source of Irrigation including name of well   rajbah , etc. Land Revenue Development Fee Local Rate Lambardari Fee Water Rate Lambardari Fee on Water Rate Total Number Dakhil Kharij Total Fee Grand Total Remarks",
  "Kha  FORM XXVIII ( See   RULE 44) BILL OF ASSESSMENT S.No. _________________________________ Name of land-owner with description___________________  Estate .....................,Tahsil ........., District ..............Crop   year.........  Number Khatauni Survey / Khasra No. Total areas under assessment Source of irrigation, including name of well,  rajbah , etc. Land revenue  Rates and Cesses  Dakhil Kharij  fee Grand Total Remarks Development Local Rate Water Rate No. of   Dakhil Kharij  Total Fee",
  "Kha Patti  FORM XXIX ( See   RULE 45) ARZ IRSAL Estate......   (if any)........ , Tahsil ........., District ...........   year ......  Name of Lambardar _________________________________________ Detailed distribution of the amount tendered under each head of account. Land Revenue Local Rate Development Fee Canal Water Rate Mutation fee Total Date ________________   Signature of Patwari Circle _______________",
  "Nation Tahsildar  FORM XXX ( See   RULES 45 AND 46)  PAYMENT RECEIPT ( DAKHLA ) Tahsil __________________, District ______________________________________  No. Estate Date of payment Name of   Lambardar   or   Tapedar  Year or Season (Harvest)  Details of Amount tendered under  each head of Account Land Revenue Local Rate Development Fee Canal Water Rate Mutation Fee Total Treasury Officer Sub-Treasury Officer Manager,   Bank of Pakistan Revenue Accountant   (Head Munshi) Original Duplicate Triplicate",
  "FORM XXXI ( See   RULE 47) SECURITY BOND  Whereas, I .......................................... inhabitant of ................................. have been appointed to the office of, ................................ and have been called upon to furnish security for the due discharge of the trusts, of the said office, or of any other office to which I may be hereafter appointed, and for the due account of all moneys, which may come to my possession or control by reason of any such office, I hereby bind myself, to pay to the Government the amount of any loss or defalcation in my accounts, within such time and to such person as shall be demanded by the person at the head of the office to which I belong, such demand to be in writing and to be left at my office or place of residence, and, in case of my making default therein, I bind myself to forfeit to the Government the sum of .......... rupees: Provided always that nothing herein contained nor the security hereby given shall be deemed to limit my liability in respect of the matters aforesaid to the forfeiture of the said sum of ....... rupees only, and that should that sum be insufficient to recoup the Government in full for any loss or damage sustained by it in respect of the matters aforesaid, I agree to pay to it on demand such further sum as shall be deemed by the person at the head of the said office as necessary in addition to the said sum to cover such loss or damages as aforesaid. Dated--------   (Signature) SECURITY TO BE SUB-JOINED TO THE BOND OF THE PRINCIPAL We ---------, hereby declare ourselves sureties for the above-said ------- that he shall do and perform all that he has above undertaken to do and perform, and in case of his making default therein we hereby bind ourselves to forfeit to the Government the sum of ------ rupees in which the above-said -------- has bound himself, or such small sum as shall be deemed sufficient by --------- to cover any loss or damage which the Government may sustain by reason of such default. Dated------   (Signature)",
  "FORM XXXII ( See   RULE 51) REGISTER OF SECURITIES  Consecutive member Name and designation of officer required to give security Amount of security given Nature of security given Names of securities, if any, and dates of their bonds. Names of new securities, if any, substituted for former ones who have died or withdrawn, or whose fitness is considered doubtful and dates of their security bonds. Amount of security, if any, for which each surety is liable on account of other officers, whether in the same or any other Department. Opinion of the head of office as to sufficiency of present security and date on which such opinion was recorded. Date of receipt of surety’s notice of withdrawal Commissioner’s inspection notes",
  "FORM XXXIII ( See   RULE 57) NOTICE OF DEMAND UNDER SECTION   OF THE WEST PAKISTAN LAND REVENUE ACT, 1967 No. of Notice ________ dated ________  To _______________ resident of village _________, Tehsil ___________ District ________ WHEREAS it is shown from the accompanying certificate * that an arrear of Rs. ____ is due from you on account of land revenue (and ....) you are hereby required to pay into the tehsil the said sum, together with the sum of Rs. ______ due as process fee, amounting to a total of Rs. _________, on or before the ________. Revenue Officer * A clear account certified by the tehsil revenue accountant should be endorsed on the notice.  Particulars to be filled in by the tehsil revenue accountant or other officer.  1.   Name of Peon _______ 2. Date of issue of notice ___________ 3.   Date fixed for its return __________ (The above to be entered before service of the notice) 4.   Date on which the notice was returned ____________ 5.   Revenue paid ..........   Rs. _____________ 6.   Process fee paid .......   Rs. _____________ 7.   Revenue due ............   Rs. _____________ 8.   Process fee due ........   Rs. _____________ Seal  81 82",
  "56   [FORM XXXIII-A ( See   RULE 67-A (4)(a))  Revenue Officer ............ Serial No. Date of filing the application. Particulars of Boundaries to be demarcated. Name of applicant with description. Purpose of application. Name and description of persons against whom making the demarcation of the spot. Demarcation of Boundaries Proceedings. Remarks. Name of Estate. Khewat Nos. and Killa / Khasra No. Whether the boundaries to be demarcated are situated within the Tehsil or on boundary line between two Tehsils or two Districts. Date of demarcation and the name of officer making the demarcation of the spot. Brief abstract of demarcation proceedings. Date and brief abstract of final order. Date of sending the file to Record Officer and signatures of record-keeper. 56   Forms XXXIII-A, XXXIII-B, XXXIII-C and XXXIII-D added by Board of Revenue, Punjab’s notification No.2313-73/629-LR-I, dated 19   th   July, 1973, published in the Gazette of Punjab, Part III, November 23, 1973.",
  "FORM XXXIII-B ( See   RULE 67-A (4)(e))  To (Name, parentage and address of the person to be served). Whereas an application has been made by ___________________ for defining the limits of land measuring __________ acres __________ kanals ________ marlas, bearing Khewat / Khata No. ____________ Khasra / Killa No. ______________ situated in the area of village __________ Tehsil _________ District __________ ; And, whereas, __________ day of _______ , 19 ____ about _______ a.m./p.m. has been fixed for demarcation of the boundaries of the said land and your presence there shall be necessary; Now, therefore, you are hereby directed to appear and be present at the date, time and land. *   In case you fail to appear and be present there in person or through a duly authorized agent in the manner indicated above, the demarcation proceedings shall be taken in your absence. Dated: _________   Signature and Seal of Revenue Officer. *   Strike out if the notice is addressed to the Revenue Patwari, Circle Kanungo, Lambardar or any other person who is not a party to the proceedings.",
  "FORM XXXIII-C ( See   RULE 67-B (4)) NOTICE OF EVICTION  In the Office of Collector _______________________ versus ____________________ (applicant)   (respondent) To ___________________________________________________ (Name and full address of the land-owner / respondents)  Whereas ____________ has /have made an application for your eviction from the land described in the application (copy enclosed herewith) which, as a result of demarcation proceedings conducted by Revenue Officer __________ on____________ has been found to be wrongfully in your possession;  Now, therefore, you are hereby called upon to appear before me either in person or through a duly authorized agent on ___________ day of ______19___at______ a.m. and to show cause, in writing as to why you should not be evicted from the said land. Dated:   Signature and Seal of the Collector",
  "FORM XXXIII-D ( See   RULE 67-B (7)) WARRANT OF EVICTION  In the Office of Collector __________________ _______________________ versus ____________________ (applicant)   (respondent) To _________________________________________________________ (Name and designation of the official who has to execute the warrant)  Whereas ____________ having been found to be in wrongful possession of the land measuring ____________Acres__________Kanals_________Marlas, bearing Khata/Khewat No. ________, Killa / Khasra No._______situated in the area of village ________________ Tehsil________________ District_____________ has / have failed to vacate possession within the period specified in my order __________ dated.  Now, therefore, you in pursuance of my order, dated ___________ are hereby authorized to evict the aforesaid land-owner / land-owners from the said land with/without police assistance and deliver its possession to __________ forthwith who has / have been found to be its rightful owner/owners. This warrant shall be returned on or before ________ with a report supported by an affidavit as to whether it has been duly executed and if it is not executed, with reasons for its non-execution. Dated________________   Signature and Seal of the Collector  ]",
  "FORM XXXIV ( See   RULE 72) REGISTER   HAQDARAN ZAMIN   (RECORD OF RIGHTS/ PERIODICAL RECORD) The statements referred to in clause (a) of sub-section (2) of section 39, shall be recorded in the form set forth below, to be know as the Register   Haqdaran Zamin   :- Register Haqdaran Zamin Estate......,   (if any)..................Tehsil............., District....... Year.........  57   [ PARTICULARS OF OWNER No. Khewat Malik No. Khatauni cultivator Name of owner with Father’s / Husband’s name, caste and residence. National Identity Card No. Ownership status (owner, mortgagor, mortgagee etc) Specific share in the joint Khewat Precise area according to the share Agricultural Pass Book No. Name of cultivator with description Survey/Khasra No. and name (if any) Area and soil classification of each number and total Khatauni cultivator and Khewat Malik Source of irrigation including name of well, Rajbah etc. Rent paid by cultivator, rate and demand Demand with details of revenue and cesses Remarks including – 1. Name of Lambardar (if any) 2. Rate of land revenue 1   2   3(a)   3(b)   3(c)   3(d)   3(e)   3(f)   ]   4   5   6   7   8   9   10 NOTE: In the Register Haqdaran Zamin which forms part of the record-of-rights, column 5 (Survey/Khasra No.), should be divided into two sub-columns headed respectively “former” and “present”. 57   Substituted by Board of Revenue, Punjab’s notification No.1750-88/281-LR-II, dated 02-04-1989, published in the Gazette of Punjab, Extraordinary, April 4, 1989.  Taraf Patti Book No. Leaf No.",
  "FORM XXXV ( See   RULE 72) MUTATION REGISTER (REGISTER DAKHIL KHARIJ)  The mutation register referred to in section 41(3) shall be maintained in the form set forth below to be know as the Register   Dakhil Kharij :- Register   Dakhil Kharij   Estate   No.Hadbast   Tehsil   District Serial No. Entry in Register   Haqdaran Zamin   or last entry in Register  Dakhil Kharij   which is proposed to be corrected New entry which is proposed to be substituted Nature and date of Dakhil Kharij with price in case of sale amount of mortgage debt, in case of mortgage. Land-revenue and Dakhil Kharij fee. Reports and Orders. Signature, Thumb-impression of witness. No. Khewat Register   Haqdaran Zamin  Name of owner with description Name of cultivator with description Survey/Khasra No. with name, if any. Area and kind of soil. No. of Khewat which will be substituted in the new Register Haqdaran Zamin Name of owner with description. Name of cultivator with description. Survey/Khasra No. with name, if any. Area and kind of soil. 1   2   3   4   5   6   7   8   9   10   11   12   13   14 Note – In column 13, the land revenue shall be recorded in red ink. Book No. Leaf No.",
  "FORM XXXVI ( See   RULE 72) STATEMENT OF CUSTOMS ( WAJIB-UL-ARZ )  The statement of customs respecting rights and liabilities in the estate referred to in clause (b) of sub-section (2) of section 39, shall be recorded in the form set forth below to be known as   wajib-ul-arz , which should contain information on so many of the matters given in column 2, as are pertinent to the estate:-  Wajib-ul-arz   Estate -------- Tehsil ----------- District ------------- Year -------------- 1   2   3 Sr. No. Heading of Custom   Informa tion 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. Common land, its cultivation and management, and the enjoyment of the proceeds thereof. Rights of grazing in common land. Rights to the enjoyment of sayer produce (miscellaneous income connected with land). Customs relating to the irrigation of land. Customs relating to mills, tanks, streams, or natural drainages. Customs of alluvion and diluvion. The rights of cultivators of all classes not expressly provided for by law (e.g. right to trees are manure, and right to plant trees) their customary liabilities other than rent. Customary dues payable to village servants and the service to be rendered by them. The rights of Government to any   Nazul   property (e.g. property which has become the property of Government by escheat or failure of heirs), forests, unclaimed, unoccupied, deserted or waste lands, quarries, ruin or objections of antiquarian interest, spontaneous products, and other necessary interest in land, included within the boundaries of the estate. The rights of Government in respect of fish and fisheries in streams, rivers etc. Any other important usage affecting the rights of land-owners, cultivators or other persons interested in the estate, not being a usage relating to sucession and transfer of landed property.  Explanation.   Where the record-of rights is being compiled or revised, if the persons interested are not agreed as the existence of any custom, the Collector or an Assistant Collector of the 1   st   grade shall decide the dispute in the manner provided in section 44. In the case of revision, he shall have regard to the provisions of section 45.",
  "FORM XXXVII ( See   RULE 72) REQUISITION FOR INFORMATION OR DOCUMENT UNDER SECTION 47(1) OF THE WEST PAKISTAN LAND REVENUE ACT, 1967  To ...................... , Resident of .................. Tehsil .................. District .................................. You are hereby directed to present yourself before me on the ......... day of .......... at ....................... in order to   all such   as may be within your   pertaining to the subject-matter specified in the margin. Signature ............................... Date this .......... day of .............   Patwari Circle .......................... Revenue Officer Circle ...............  furnish produce  information documents  knowledge possession or power",
  "58   [FORM XXXVIII ( See   RULE 72) HOLDING SLIP (PARCHA KHATAUNI)  At the time of field measurement for the preparation of map of the estate referred to in clause (c) of subsection (2) of section 39, a Holding Slip (Parcha Khatauni) shall be recorded in the form set forth below:-  HOLDING SLIP (PARCHA KHATAUNI)  Estate -------------   (if any) ---------- Tehsil ---------------District ------------Year----- No.   Khewat   in last Register  Haqdaran Zamin  New Khatauni No. Particulars of owner Name of owner with father’s/husband’s name, caste and residence. National Identity Card No. Ownership status (owner, mortgager, mortgagee etc.) Specific share in the joint Khewat Precise area according to the share Agricultural Pass Book No. Name of cultivator with description 1   2   3   4   5   6 Survey/  Khasra   No. and name (if any) Area and soil classific- ation of each No. and total   Khatauni   cultivator and   Khewat   Malik. Source of irrigation including name of well,   Rajbah , etc. Rent paid by cultivator Demand with details of revenue and cesses Remarks including – 1. Name of Lambardar (if any) 2. Rate of land revenue 3. Reference of mutation No. (if any) Former Present Area Soil classifi- cation 58   Substituted by Board of Revenue, Punjab’s notification No.1750-88/281-LR-II dated 2 nd   April,1989, published in the Gazette of Punjab, Extraordinary, April 4, 1989. Taraf Patti",
  "FORM XXX IX ( See   RULE 72) INTERROGATORY (BAND SAWAL)  If the Revenue Officer finds that a person whose statement is essential for the disposal of the mutation case, is residing outside the Tehsil an interrogatory be issued in the form set forth below:- Interrogatory in the name of ...............   of ............. caste....................... Village ....................... , Tehsil ..................... District ................... Serial No. Estate Tehsil District Mutation No. Brief account of the Transfer showing the name of transferor and transferee, the total area of the land transferred, the nature   and   date   of   transfer, consideration money, etc. Questions Date   and   signature   of   Patwari   and Kanungo. Answers Date and signature / thumb-impression of person giving statements. Signature   /   Thumb-impression   of person identifying. Place,   date   and   signature   of   officer recording the statement. Order   as   to   compliance   with   the Interrogatory. Repots   and   orders   after   compliance with the Interrogatory. Remarks 1   2   3   4   5   6   7   8   9   10   11   12   13   14   15  Notes.- (1)   The Patwari will fill in columns 1 to 8 of form and despatch it to the field Kanungo who will add his signature in column 8 of the form and send it on the Tehsildar. In column 13, the Tehsildar will address the Tehsildar or the other officer in whose jurisdiction the person is residing. The Tehsildar addressed should himself as far as possible, take the statement of the person concerned but may depute the Naib-Tehsildar (Head Munshi) or the field Kanungo of the circle to do so. (2) An interrogatory may be issued under the order of the attesting officer for the examination of a person residing within the limits of the tehsil if such person resides at a distance of more than 25 miles from the estate to which the mutation relates. son daughter wife",
  "FORM XL ( See   RULE 72) REGISTER OF MISCELLANEOUS LAND REVENUE  In   the   estates   where   the   land-revenue   is   collected   by   Tapedars,   a   register- miscellaneous land-revenue shall be maintained for each estate, in the form set forth below:- Register of Miscellaneous land-revenue Estate ........... Tehsil ......... District ........ Serial No. No. of case reported Name of person liable for payment, with description. No. of Khewat Detail of amount recoverable under each head of account Total Remarks Grass or grazing Trees, etc. Miscellaneous products, i.e. reeds, assessed in former year. Land Revenue written off or not assessed in faormer year.",
  "1. Land Revenue...   Rs ......... 2. Rates and cesses... Rs ......... 3. Other items realizable as land revenue...   Rs ......... Total...   Rs .........  FORM XLI ( See   RULE 72) WARRANT OF ARREST UNDER SECTION 82(1) OF THE WEST PAKISTAN LAND REVENUE ACT, 1967  To (Name of officer directed to arrest and bring the defaulter). Whereas ..................... , resident of ................. Tehsil ..................... District ............................................., is defaulter on account of an arrear of revenue that has accrued as shown in the margin, this is to command you to arrest the said defaulter and bring him before me with all convenient speed; provided that if the said defaulter shall without unnecessary delay produce the sum of Rs. .......... together with Rs. ....... for the cost of executing this process, and shall proceed personally to bring the said sum with you to the Tehsil or send it with you by his agent or servant, the arrest shall be suspended. You are further commanded to return this warrant on or before the ............. day of ....... with an endorsement certifying the day and the manner in which it has been executed or the reason why it has not been executed. Dated this .............................. day of .............. Signature of Revenue Officer, Seal",
  "FORM XLII ( See   RULE 72) WARRANT OF COMMITTAL OF DEFAULTER TO CIVIL JAIL UNDER SECTION 82(5) OF THE WEST PAKISTAN LAND REVENUE ACT, 1967  In the Court of the Collector, ............................................................ District Case No. .................. of ........................... To The Officer-in-Charge of the Civil Jail at ................. Whereas .............., son of ................, caste ............., resident of ........., Tehsil ........., District ..........., is a defaulter on account of an arrear of land revenue, you are hereby commanded to take the said ........... in custody and keep him confined in the Civil Jail for a period of ......... days or until such period, which should not exceed one month from the date of this order, the said arrear of land revenue is paid. Rs. ........... on account of diet allowance at the rate of ........ per diet, are sent with this warrant. Issued under my signature and seal this ............. day of .............  Signature of Collector.  Seal",
  "FORM XLIII ( See   RULE 72) ORDER FOR THE RELEASE OF A DEFAULTER UNDER SECTION 82(8) OF THE WEST PAKISTAN LAND REVENUE ACT, 1967 In the Court of the Collector, ...................................................... District Case No. .................. of .......................  To The Officer-in-Charge of the Civil Jail at ............ Whereas .........., son of ........., caste ........... resident of ............., Tehsil ....... who, under order, dated .......... was required to be confined in the Civil Jail for a period of ...... days on account of non-payment of arrears of land-revenue to be paid by him, has now paid the said amount or has urged for more time by furnishing security. Therefore, under orders passed this day, you are hereby directed to set free the said ......... now in your custody on receipt of this order. Issued under my signature and seal this ......... day of ...........  Signature of Collector,  Seal",
  "FORM XLIV ( See   RULE 72) WARRANT OF DISTRAINT UNDER SECTION 83 OF THE WEST PAKISTAN LANF REVENUE ACT, 1967  To Kanungo (or other officer whose service counts as superior) Whereas ........., resident of ........., Tehsil ......... District ........, is a defaulter  on account of arrear of revenue which has accrued as shown in the margin, this is to command you to distrain the movable property and the uncut or ungathered crops of the said defaulter, as set forth in the list hereto annexed or as pointed out to you on the spot, and to hold the same until further orders from me. Provided that if the said defaulter   shall,   without   unnecessary   delay,   produce   the   sum of Rs...... together with Rs.......... for the cost of executing this process and shall proceed personally to bring the said sum with you to the tehsil, or sent it with you by his agent or servant, the distraint shall be suspended. This warrant does not authorize you to distrain any of the property mentioned in the Proviso to section 60 of the Code of Civil Procedure, 1908 *   , or the following portion of the produce of the land of the defaulter, to with ............ which has been exempted form liability to sale by order of the Collector. You are further commanded to return the warrant on or before the day of .............. with an endorsement certifying the date and manner in which it has been executed or why it has not been executed.  Dated   Collector or Assistant Collector, 1 st   Grade.  *   [Proviso to section 60 of the Code of Civil Procedure, 1908 is printed in full on the back of the warrant. Land-revenue   ... Rates and cesses ... Other items   .... Total   .... Seal",
  "PROPETY MENTTIONED IN THE PROVISO TO SECTION 60 OF THE CODE OF CIVIL PROCEDURE, 1908  (a)   The necessary wearing-apparel, cooking vessels, beds and bedding of the judgment-debtor, his wife and children, and such personal ornaments as, in accordance with religious usage, cannot be parted with by any woman; (b)   tools of artisans, and, where the judgment-debtor is an agriculturist, his implements of husbandry and such cattle and seed-grain as may, in the opinion of the Court, be necessary to enable him to earn his livelihood as such, and such potion of agricultural produce or of any class of agricultural produce as may have been declared to be free from liability under the provisions of the next following section; (c)   houses and other buildings (with the materials and the sites thereof and the land immediately appurtenant thereto and necessary for their enjoyment) belonging to an agriculturist and occupied by him; (d)   books of account; (e)   a mere right to sue for damages; (f)   any right of personal service; (g)   stipends and gratuities allowed to pensioners of the Government, or payable out of any service family pension fund notified in the official Gazette by the Central Government or the Provincial Government in this behalf, and political pensions; (h)   the wages of labourers and domestic servants, whether payable in money or in kind; (i)   salary to the extent of the first hundred rupees and one-half of the remainder: Provided that where such salary is the salary of a servant of the State or a servant of a railway or local authority, and the whole or any part of the portion of such salary liable to attachment has been under attachment, whether continuously or intermittently for a total period of twenty-four months, such portion shall be exempt from attachment until the expiry of a further period of twelve months and, where such attachment has been made in execution of one and the same decree, shall be finally exempt from attachment in execution of that decree; (j)   the pay and allowances of persons to whom the Pakistan Army Act, 1952, applies, or of persons other than commissioned officers to whom the Naval Discipline Act as modified by the Pakistan Navy (Discipline) Act, 1934, applies; (k)   all compulsory deposits and other sums in or derived from any fund to which the Provident Funds Act, 1925, for the time being applies in so far as they are declared by the said Act not to be liable to attachment; (l)   any allowance forming part of the emoluments of any servant of the State or of any servant of a railway or a local authority which the appropriate Government may by notification in the official Gazette declare to be exempt from attachment, and any subsistence grant or allowance made to any such servant while under suspension; (m)   an expectancy of succession by survivorship or other merely contingent or possible right or increase; (n)   a right to future maintenance;",
  "(o)   any allowance declared by any Pakistan law to be exempt from liability to attachment or sale in execution of a decree; and (p)   where the judgment-debtor is a person liable for the payment of land revenue, any movable property, which, under any law for the time being applicable to him, is exempt form sale for the recovery of an arrear of such revenue. Explanation 1. – The particulars mentioned in clauses (g), (h), (i), (j), (l) and (o) are exempt from attachment or sale whether before or after they are actually payable, and in the case of salary other than salary of a servant of the State or a servant of a railway or local authority the attachable portion thereof is exempt from attachment until it is actually payable. Explanation 2. – In clauses (h) and (i), “salary” means the total monthly emoluments, excluding any allowance declared exempt from attachment under the provisions of clause (1) derived by a person from his employment whether on duty or on leave. Explanation 3. – In clause (1) “appropriate Government” means— (i)   as respects any person in the service of the Central Government, or any servant of a cantonment authority or of the port authority of a major port, the Central Government; (ii)   Omitted; (iii)   as respects any other servant of the State or a servant of any railway or of any other local authority, the Provincial Government.",
  "FORM XLV ( See   RULE 72) WARRANT FOR SALF OF MOVABLE PROPERTY UNDER SECTION 83 OF THE WEST PAKISTAN LAND REVENUE ACT, 1967  To Kanungo (or other officer whose service counts as superior) This is to command you to sell by auction, after giving ........... days previous notice by affixing the same to this office and after making due proclamation the movable property and uncut or ungathered crops destrained under a warrant from this office, dated the .........day of .............or so much of the said property as shall realize the sum of Rs.........., being the amount of the arrear of revenue still due by............  You are further commanded to return this warrant on or before the .........day of........., with an endorsement certifying the manner in which it has been executed or the reason why it has not been executed.  Dated:.............   Collector or Assistant Collector 1 st   Grade Seal",
  "FORM XLVI ( See   RULE 72) WARRANT OF TRANSFER OF HOLDING IN RESPECT OF WHICH AN ARREAR OF REVENUE IS DUE UNDER SECTION 84 OF THE WEST PAKISTAN LAND REVENUE ACT, 1967 To Kanungo (or other officer whose service counts as superior) Whereas an arrear of revenue has accrued on holding No....... in the estate called............., Tehsil.............., this is to give notice that the said holding is hereby transferred from............,   the previous owner of the said holding to ............a land- owner in the estate in which the holding is situate and not being a defaulter in respect of his own holding, on condition of the said........., paying the arrear due, to with Rs.............. before being put in possession of the holding, you are hereby directed as payment has been made on payment to put the said ...................in possession of the said holding and you are hereby authorized to remove any person bound by this warrant who may refuse to vacate the same. This transfer shall have effect till ................ Dated...............   Collector  Seal  by the said ................. of the said sum of Rs................,",
  "FORM XLVII ( See   RULE 72) WARRANT FOR ATTACHMENT OF AN ESTATE OR HOLDING UNDER SECTION 85 OF THE WEST PAKISTAN LAND REVENUE ACT, 1967 To Kanungo (or other officer whose service counts as superior) Whereas   an   arrear   of   land-revenue   has   accrued   in   respect   of   the estate called __   owned by ..., you are hereby ordered to attach the said estate Holding No.....in estate   holding and to give notice to the owner there of by taking his signature on the back of this warrant, that the said estate   is hereby taken under my management holding   the management of ............. whom I appoint agent for that purpose. This attachment shall have effect for ............years from the commencement of the ensuing agricultural year, unless the arrear be sooner discharged. Dated...............   Collector  Seal",
  "FORM XLVIII ( See   RULE 72) PROCLAMATION OF SALE UNDER SECTION 92 OF THE WEST PAKISTAN LAND REVENUE ACT, 1967 Whereas an arrear of revenue amounting to Rs. ........ has accrued in respect of the estate named____   and the sanction of the Board of Revenue—vide letter No... Holding no...in estate dated........... has been given under section 88 of the West Pakistan Land Revenue Act, to the sale of the immovable property detailed in the annexed schedule for the recovery of the said arrear, this is to give notice that the said immovable property will be sold by auction at ............... on the day of ................., at......................   O’clock. Land revenue amounting to Rs............. per annum is assessed on_______   the said estate__. payable in respect of   holding Any person intending to claim a right of pre-emption must, on pain of forfeiting the right, give notice of his intention to me on an office day before that fixed above for the sale.  The sale will be made subject to the provision of section 83 _   _   of the West section 92 (d) Pakistan Land Revenue Act, 1967, and the following encumbrances, grants or contracts are specially saved by the orders of the Commissioner   , viz. have been ascertained to exist in respect of the Property Dated...............   Collector  Seal",
  "FORM XLIX ( See   RULE 72) CERTIFICATE OF SALE UNDER SECTION 107 OF THE WEST PAKISTAN LAND REVENUE ACT, 1967  I, ............., Collector of ............, hereby certify that ........., resident of tehsil........,, district..........., has been declared the purchaser at sale by public auction on the .........day of ........, of ...............sold for the recovery of an arrear due in respect  thereof and that the sale has been duly confirmed by the Commissioner under of section 104 of the West Pakistan Land Revenue Act, 1967.  (To be added when the land is sold for an arrear due in respect thereof)  The following encumbrances, grants, or contracts specified in the proclamation of the sale are specially saved by the order of the Commissioner under section 93, sub-section (2) ,  clause (b) of the said Act, viz.--  This certificate is granted under the provisions of section 107 of the West Pakistan Land Revenue Act, 1967. Dated...............   Collector  Seal",
  "FORM L ( See   RULE 72) INSTRUMENT OF PARTITION UNDER SECTION 145 OF THE WEST PAKISTAN LAND REVENUE ACT, 1967 Before.........., exercising the powers of an Assistant Collector of the Ist Grade, under section 7(1)(d) of the West Pakistan Land Revenue Act, 1967. Partition case under Chapter XI of the West Pakistan land Revenue Act, 1967, between AB first party, and D, second party, claim to divide ....... Kanals of land value....... held by them in estate.....tehsil......   Whereas this case came before me for final disposal at .....on the .....day of ......and it was then ordered that partition be made of the land described in columns 1 and 2 of the schedule hereto annexed, and whereas the period of appeal against the said order has expired without an appeal being presented [or whereas the said order has been varied (or maintained) by an order of the ........, dated the ...... day of ........]. This instrument of partition is now prepared in order to give effect to my order aforesaid, dated the...... day of ...... [first order (as varied or maintained), by the order of the ......, dated the..... day of......second order, if any] and it is hereby declared that the partition will take effect on and from the .......day of .....19 Dated...............   Assistant Collector Ist Grade SCHEDULE Joint Land (Before Partition)   Separate Land (After Partition) Survey/ Khasra No. and name (if any) Area Names of joint owners with Khewat No. Survey/ Khasra No. and name (if any) Area Names of owner to whom field is allotted in partition. 1   2   3   4   5   6 Notes- (1) A separate entry should be made for each Survey/Khasra number. (2) The Instrument shall be stamped in accordance with the fee prescribed under No. 45, Schedule 1 of the Stamp (West Pakistan Amendment) Act, 1964.  Stamp Seal",
  "FORM LI ( See   RULE 72) REGISTER SHOWING THE AMOUNT OF FEE REALIZED BY PATWARI FOR INSPECTION OF RECORDS AND GRANT OF CERTIFIED COPIES THEREFROM The accounts of fee realized by Patwari for inspection of records and grant of certified copies therefrom shall be kept in the form set forth below:- Register showing the amount of fee realized for inspection of records and grant of certified copies therefrom. Patwari Circle ............, Tehsil................, District ......................... Serial No. Date Name of estate Name of applicant Nature of record of which copy or inspection is desired   Details of Work Amount of fee realized direct from applicant Amount of recoverable from applicant through Tehsil office Kanungo Signature of Patwari Signature of Kanungo Amount credited to Government with date and payment receipt (Dakhila) number Attestation of Officers Remarks Khatuni numbers Number of words Sruvey / Khasra Nos. Date of entries Number of inspections Patwari’s share Government share Total Patwari’s share Government share Total 1   2   3   4   5   6   7   8   9   10   11   12   13   14   15   16   17   18   19   20   21",
  "FORM LII ( See   RULE 72) REGISTER SHOWING SURVERY EQUIPMENT AND ALMIRAHS OR BOXES, ETC. A Register of survey equipment and furniture supplied to the Patwari and remaining in his custody shall be maintained in the form set forth below:- Register showing survey equipment and almirahs or boxes, etc. Patwari Circle ............, Tehsil ............, District ............ 1   2   3   4   5   6   7 No. Article Date of supply Condition in the year Signature of Patwari responsible for its custody Orders for removal of item from the register, with date Remarks Note—A consolidated copy of the above register with the omission of columns 4 and 5 shall also be kept by each Tehsil Office Kanungo.",
  "FORM LIII ( See   RULE 72) REGISTER OF RECORDS IN THE CUSTODY OF   PATWARI  A register in the following form shall be maintained by each Patwari showing the records in his custody:- Register of records in the custody of Patwari. Circle ..............., Tehsil.........................., District ...................... Name of estate Serial No. Year in which the record was prepared. Description of record. Date   of   filing   in   the   Tehsil   office   for   the destruction   or   otherwise   and   the   office Kanungo’s signature Signature of Patwari responsible for the custody of the records. REMARKS",
  "FORM LIV ( See   RULE 72) STATEMENT SHOWING THE CONDITION OF SURVEY AND BOUNDARY MARKS On the completion of the Kharif harvest inspection each Patwari shall send a report showing the condition of survey and boundary marks in the form set forth below to Tehsil Office Kanungo:- Statement showing the conditions of Survey and Boundary marks at the time of Kharif harvest inspection year .................. Tehsil ..............., District ............... Name of estate in which the pillar is built No. of pillar (if any) Survey / Khasra No. in which the pillar has been laid down Condition of pillars Action needed Remarks by the Kanungo and other visiting officers A—Survey marks B—Boundary marks Note – A consolidated copy of the above statement shall be submitted by the Tehsildar to the Deputy Commissioner.",
  "FORM LV ( See   RULE 72) REGISTER OF PATWARI CIRCLES A register of Patwari Circles of each tehsil shall be maintained by the District Kanungo in the form set forth below:- REGISTER OF PATWARI CIRCLES OF TEHSIL ......... DISTRICT .........  1   2   3   4   5   6   7   8   9   10   11   12 Name of Field Kanungo’s Circle Number and name of Patwari Circle Name of Patwari, father’s name and caste, native village, date of appointment and date of birth. Detail of Estates included in circle Special remarks of the Character of the work. Name of estate Total area Cultivated area Total Land Revenue Assessment Number of Survey / Khasra entries Number of Khatauni entries Number of Khewat entries Year Note—A copy of the above register with the omission of column 12 shall be kept by the Tehsil Office Kanungo.",
  "FORM LVI (See RULE 72) WORK-BOOK (ROZNAMCHA-KARGUZARI) FOR PATWARIS  Each Patwari shall keep a work-book (Roznamcha-Karguzari) in the form set forth below in which he will enter from day to day the work done by him:-  Work-Book Patwari Circle ______________________ Tehsil ______________ District _____________________ Name of Patwari ____________________________ Day and date  DETAIL OF WORK Remarks  Name of estate Name of work Area Number of fields Number of Khataunis Number of squares / rectangles Number of mutations Last-number at which the daily work is completed",
  "FORM LVII ( See   RULE 72) WORK-BOOK (ROZNAMCHA-KARGUZARI) FOR KANUNGOS  Each Kanungo shall keep a work-book (roznamcha-karguzari) in the form set forth below in which he will enter from day to day the work done by him:-  Work-Book (roznamcha-karguzari) Kanungo Circle .............................. Tehsil ............................, District ......................., Name of Kanungo ...........................  Day and date  Name of Estate visited and work in hand Date of previous visit to circle Abstract of work of the day Remarks",
  "FORM LVIII ( See   RULE 72) WORK-BOOK (ROZNAMCHA-KARGUZARI) FOR TEHSILDARS AND NAIB-TEHSILDARS/HEAD MUNSHIS  Each   Tehsildar   and   Naib-Tehsildar   (Head   Munshi)   shall   keep   a   work-book (roznamcha-karguzari) in the form set forth below in which he will enter from day to day the work done by him:-  Work-Book Revenue Officer Circle ............, Tehsil ......., District ............, Name of Revenue Officer ...........................  Day and date   Detail of Work done   REMARKS",
  "FORM LIX ( See   RULE 72) LIST OF MORTGAGES WITH POSSESSION  A list of Mortgages with possession in the form set forth below shall be appended to the holding slip (Form XXXVIII)  List of mortgages with possession Estate ............, Tehsil ......., District ............, Year ......................... Serial No. Khatauni No. Name of mortgagor with description Name of mortgagee with description Survey/Khasra No. Area and soil classification Amount of mortgage-debt Date of mortgage Remarks",
  "FORM LX ( See   RULE 72) LIST OF RENTS  A list of rents in the form set forth below shall be appended to the holding slip (Form XXXVIII)  List of rents   Estate ............, Tehsil .............., District .............., Year ....................... Serial No. Khatauni No. Names of owner and tenant written short Land with details of soil Rent with rate and amount Date when rent was fixed Crops grown Remarks",
  "FORM LXI ( See   RULE 72) LIST OF KHATAUNI TOTALS  A list of Khatauni totals in the form set forth below shall be appended to the holding slip (Form XXXVIII)  List of Khatauni. Total   Estate ............, Tehsil ......., District ............,Year ......... Khatauni No. How many Survey / Khasra Nos. AREA AND CLASSES OF LAND Grand Total REMARKS Cultivated   Uncultivated Total Total",
  "59   [ FORM LXII ( See   RULE 72) DAY BOOK  In the estates where the land-revenue is collected by Patwaris, a Day Book for each transaction shall be maintained for each estate, in the form set-forth below:-  ...............Day Book........... Estate ............, Hadbast No. ........................... Tehsil........... ................, District .........................,Year ........................ Serial No. Miscellaneous Land Revenue Date Khewat No. Name of owner with description Year and Season (Kharif or Rabi) Land Revenue Liable to Local Cess Free of Cesses Water Rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Patwari’s Receipt No. Dakhala No. date and place of payment if the amount remitted through Tehsil Office under sub- rules (2) and (3) of Rule 46 of the West Pakistan Land Revenue Rules, 1968 Signature of Patwari Remarks 59   Forms LXII, LXIII, LXIV, LXV and LXVI added by Board of Revenue, West Pakistan’s notification No. 534/69/526-U(I) dated 15   th   September, 1969, published in the Gazette of West Pakistan, Extraordinary, October 9, 1969.",
  "FORM LXIII ( See   RULE 72) LEDGER OF DEMANDS AND COLLECTIONS  In the estates where the Land Revenue is collected by Patwaris, a Ledger of Demands and Collections consisting of holding wise accounts shall be maintained for each estate, in the form set-forth below:-  Ledger of Demands and Collections: Estate ............, Hadbast No. ..................... Tehsil ......., District ............,Year ......... Khewat No. ................................. Name of land-owner with description ........................................................ ........................................................................................................ Miscellaneous Land Revenue Miscellaneous Land Revenue On what account Land Revenue Liable to Local Cess Free of Cesses Water Rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Remarks Date of of recovery Serial No. in Day Book On what account Land Revenue Liable to Local Cess Free of Cesses Water Rate Development Cess Local Rate Historical Mosque Fund cess Mutation Fee Total Remrks",
  "FORM LXIV ( See   RULE 72)  BALANCE SHEET  In the estates where the land-revenue is collected by Patwaris a Balance Sheet shall be prepared for each estate at the closing of agricultural year in the form set forth below:- Balance Sheet: Estate ................., Hadbast No.................... Tehsil.................., District ........,Year ending............  PART-A (AREA AND DEMAND) Area   Arrears of Land Revenue etc. of past years   Demand of Current Year Cultivated   Suspended   Unauthorized   Kharif   Rabi   Post Demand   Total Demands  Year   Year   Year   Year  Khewat No. Name of owner with description Kharif Rabi Fallow Total Kharif Rabi Kharif Rabi Kharif Rabi Kharif Rabi Land Revenue Miscellaneous land revenue Water rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Land Revenue Miscellaneous land revenue Water rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Land Revenue Miscellaneous land revenue Total Post Demand Land Revenue Miscellaneous land revenue Water rate Development Cess Local Rate Historical Mosque Fund Cess Total Demand of the Year",
  "PART-B (REMISSION AND SUSPENSION)  REMISSION   SUSPENSION  Kharif   Rabi   Kharif   Rabi  Land Revenue Water Rate Development Cess Local Rate Total Land Revenue Water Rate Development cess Local Rate Total Total remission of Kharif and Rabi Land Revenue Water Rate Development cess Local Rate Total Land Revenue Water Rate Development Cess Local Rate Total Total suspension of Kharif and Rabi",
  "PART-C (COLLECTION AND BALANCE E   TC .) Collection  Total collection of Kharif and Rabi  Un-Authorised Balance  Total un-auhtorised balance of Kharif and Rabi  Over Collection  Remarks  Kharif   Rabi   Kharif   Rabi  Land Revenue  Miscellaneous Land Revenue  Water Rate  Development Cess  Local Rate  Historical Mosque Fund Cess  Mutation Fee  Total  Land Revenue Miscellaneous Land Revenue Water Rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Land Revenue Miscellaneous Land Revenue Water Rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Land Revenue Miscellaneous Land Revenue Water Rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total Land Revenue Miscellaneous Land Revenue Water Rate Development Cess Local Rate Historical Mosque Fund Cess Mutation Fee Total",
  "FORMLXV ( See   RULE 72)  REGISTER OF DEMANDS AND RECOVERIES OF WATER-COURSE EXPENSES  In the area where the expenditure incurred by Government on the construction of water-courses is recoverable from the land owners under the law relating to irrigation as in force for the time being a register of demands and recoveries of water-course expenses shall be maintained for each estate, in the form set forth below,  Register of Demands and Recoveries of Water-course Expenses. Estate ................ Tehsil......................., District ........................ Khewat No. Name of land-owner with description and surety Survey / Khasra number held in the Khewat and liable to pay watercourse changes Net area of each Survey / Khasra No. (after deduction of area taken up for water-courses) Rate to be charged per acre. Total amount due from the land-owner Amount due to the land-owner Balance if due, to the land-owner (Column 9 - Column 6) Balance to be recovered from the land-owner Annual installment recoverable on each Survey/Khasra No. for_years ending with Recoveries Remarks Year   Year   Year As compensation for land taken up from each Survey / Khasra No. On account of doing the work himself Total (Column 7+8) Per entire holding (Khewat) Per each acre of the holding Per each Survey / Khasra No. Date Amount Date Amount Date Amount 1   2   3   4   5   6   7   8   9   10   11   12   13   14   15   16   17   18   19   20   21",
  "FORM LXVI ( See   RULE 72) REGISTER OF AREA AND ASSESSMENT OF CULTIVATION IN UNSURVEYED LAND In the areas where assessment is made-on unsurveyed land a register of area and assessment shall be maintained in the form set-forth below REGISTER OF AREA AND ASSESSMENT OF CULTIVATION IN UNSURVEYED LAND Estate ______________ Kharif _______________ Book No. ______________________ Tehsil ______________ District ___________________ Year ________________ Deh ___________________________ Rabi _________________________________ Leaf No. Measurement Land Revenue Length and Breadth Rates and Cesses  Date of measurement Serial No. Name of occupation with description Name of cultivation with description Name of makan or Survey / Khasra No. Source of irrigation Soil classification and crops. East West South North Calculation of area Total area (in acres) Rate of assessment per acra Land Revenue Local Rate Total Remarks",
  "39   [APPENDIX B  SCHEDULE CHARGES FOR INSPECTION OF RECORDS OF PATWARIS AND FOR GRANT OF COPIES OR EXTRACTS THEREFROM (See Rule 36(3)) Sr. No. Nature of work   Charges COPIES OF EXTRACTS CHARGES 1.   Register Haqdaran Zamin including extracts, in connection with the preparation of abstracts. In rural area Rs. 20/- per Khatuni holding and in Urban area Rs.40/- per Khatuni holding. 2.   Khatuni Ishtimal or Khatuni Killabandi or Khatuni paimaish bandobast. -do- 3.   Register Haqdaran Nakhlistan   -do- 4.   Naqsha Haqdaran (Ishtimal)   Rs. 50/- per khata 5.   Fehrist Muawza Darakhtan   -do- 6.   Inspection Note attached to periodical records (Register Haqdaran Zamin) Rs. 30/- 7.   Fard Badar   Rs. 50/- per fard badar 8.   Pending Dakhil Kharij   Rs. 50/- 9.   Interrogatories in pending Dakhil Kharij   Rs. 50/- 10.   Counterfoil of decided Dakhil Kharij   In rural area Rs. 40/- per mutation and in Urban/Cantt. Rs. 50/- per mutation. 11.   Shajra Nasib   Rs. 4/- per item (Part ‘A’) of Shajra Nasib Rs. 50/- per ghuri (Part ‘B’) 12.   Naqsha Chahat Nul Chahat   Rs. 30/- per well/tubewell 13.   Fard Taqseen Ab or Naqsha Haquq Rod Kohi   Rs. 30/- per statement. 14.   Wajib-ul-Urz   Rs. 5/- per item 15.   Naqsha Haquq Panchakiat   Rs. 10/- per Jandar or Panchaki 16.   Orders of the Collector (Settlement Officer) determining the assessment of Tariqa Bachh. Rs. 30/- per first 200 words and Rs. 10/- per every additional 100 words or part thereof. 17.   Dhal Bachh Malia Mustaqil or Ghair Mustaqil   Rs. 10/- per khata (no fee being charged if copies required for recovery of land revenue) 18.   Fard fee Ishtimal   Rs.10/- per khata 19.   Demand statement (Canal)   Rs.10/- per khata 20.   Settlement of Grazing dues   Rs.10/- per khata (no fee being charged if copies are required by the Headman (Lambardar) for the recovery of arrears of grazing dues) 39   Substituted by Board of Revenue, Punjab’s notification no. 2148-98/1184-LR-II, dated 11 th   August, 1998.",
  "21.   Register Girdawari including extracts from register girdawari called for by Courts / offices in connection with the preparation of 5 yearly abstract of yields Rs.10/- per khasra No. for entries in a single volume 22.   Register Taghayyurat-e-Kasht   Rs.18/- per khasra No. 23.   Daily diary (Roznamcha Waqiati)   Rs.30/- per entry made on one subject except as provided in subsection (1) of Section 42. 24.   Field Book   Rs.10/- per khasra No. 25.   Statement contained in village Note Book   Rs.10/- per statement 26.   Abstracts of Quinquennial average of Dakhil Kharij Rs.10/- per statement 27.   Fard Taqseem (Register of allotment of Colony Land) Rs.30/- per khata 28.   Parcha Zamindaran   Rs.30/- per khata, except as provided in note No.6 given below 29.   Register Scheme Ishtimal   Rs.30/- per khata 30.   Inspection of papers relating to the quadrennium / consolidation documents, including relevant entries of Register Dakhil Kharij Rs.30/- for 4 years record 31.   Tracing of Field Map   Rs.30/- per khasra No. 32.   Tracing of Tatimma Shajra   Rs.30/- per khasra No. 33.   Preparation of plans called for by Courts or Officers in connection with Civil and Revenue suits. Rs.30/- per khasra No. D-   URGENT COPIES OF EXTRACTS REQUIRED WITHIN 24 HOURS. Rs.100/- in addition to the normal fee payable for serial Nos.1 to 29 and 31 to 33. NOTES: (1)   For the purpose of fee for copies of extracts from Register Haqdaran Zamin in rent cases, the total number of Khatuni holdings should be taken into account irrespective of the fact whether they are cultivated by the landowner himself or by the tenant or sub-tenant, and in calculating the fee the number of khatas of which the copies or extracts are given may be ignored. (2)   For extracts, under serial Nos.1 and 21 and plans under Serial No.33 if prepared in connection with the temporary alienation of land in satisfaction of decree of Civil Court, the charge shall be subject to maximum of Rs. 100/- in a single case, irrespective Zamindar Register Girdawari or both, and whether or not, they involve the preparation of plan. (3)   A receipt in Form XXII shall be given to the payee for the fee actually realized, one fourth of the fee thus realized shall be retained by the patwari and three fourth shall be credited into the Government Treasury under the receipt head “0124017-Land Revenue Copying and Inspection Fee of Patwari’s records”. (4)   Patwaris are forbidden to prepare and supply copies or extracts of papers not shown in this Schedule. (5)   In the case of inspection of the Patwari’s record by sub-Inspector of Co-operative Societies under serial No. 30, for the business of the Society, no fee shall be charged.",
  "(6)   In the case of parcha zamindaran under serial No. 28, the Patwari is entitled to this fee, except at the close of settlement, Consolidation of holding or killabandi operations in the special cases where the Collector may see reasons to supply the parcha zamindaran, free of charge, at other time also. (7)   Any person desiring to obtain the certified copies of the revenue records in possession of the Patwari, may apply to the Tehsil Office Kanungo for this purpose giving sufficient information to enable the Patwari to make out the copies. The application need not bear any court fee stamps. The Tehsil Office Kanungo shall give a written acknowledgement of the receipt of such application in Form XXIII, the applicant obtain the required copies from the Patwari within ten days of the receipt of application and deliver the same to the applicant on payment of the fee prescribed under this schedule. For this purpose, the Tehsil Office Kanungo shall maintain a register, for recording:- i)   the date of receipt of the application; ii)   the name of applicant with description; iii)   the nature of record of which copy is desired; iv)   the name of concerned estate and patwar circle; v)   the date given for the receipt of the copies; vi)   the date on which the copies were actually delivered to the applicant; vii)   amount of fee realized.   (a)   Patwari’s share. (b)   Government share. (c)   Total. viii)   remarks."
]